[
  {
    "title": "1.2\tIntroduction to Case Building Procedures and Methodologies",
    "text": "The principal function of the SSWG is to provide steady-state power flow models, or base cases, which contain appropriate equipment characteristics, system data, and shall represent projected system conditions.  This procedure manual is intended to demonstrate compliance with NERC Reliability Standards applicable to steady-state modeling. The ERCOT Protocols require the SSWG Cases developed for annual planning purposes to contain, as much as practicable, information consistent with the Network Operations Model.\nPlanning models are bus-branch representations of the transmission system (60 kV and above), which includes buses, branches, impedances, facility ratings, loads, reactive devices, transformers, generators, and DC lines.\nThe ROS directs the SSWG as to which cases are to be created via changes to this procedure manual.  Currently, the SSWG builds a set of steady-state base cases on an annual basis, collectively called the SSWG Cases.  The SSWG Cases consist of the following:\n•\t8 seasonal cases representing on-peak and off-peak conditions for the four seasons of the next year beyond the year the cases are built\n•\t6 future year cases representing summer on-peak conditions with the first year beginning two years beyond the year the cases are built.\n•\t1 future year case representing high renewable generation ouput and minimum load conditions\n•\t1 future year case representing minimum load conditions\nThe future summer peak cases are collectively known as the Annual Planning Models and are subject to the requirements defined in the ERCOT Protocols.  Each set of SSWG Cases are to be built or updated during the biannual update cycle.\nVarious groups utilize the SSWG Cases for a variety of tasks.   These tasks include, but are not limited to the following:\n\n•\tERCOT and TSPs test the interconnected systems modeled in the cases against the transmission system planning performance requirements set forth by NERC,  ERCOT Planning Guide and their individual TSP planning criteria to assess future system reliability.\n\n•\tROS Working Groups and ERCOT use the SSWG Cases as the basis for other types of calculations and studies including, but not limited to:\n\no\tInternal planning studies and generation interconnection studies\no\tVoltage control and reactive planning studies\no\tBasis for Dynamics Working Group stability studies\no\tERCOT transmission loss factor calculation\no\tBasis for ERCOT operating cases and FERC 715 filing"
  },
  {
    "title": "2.1\tDefinitions",
    "text": "Annual Planning Model\t\tThe future year cases representing summer on-peak conditions\nwith the first year beginning two years beyond the year the cases\nare built.  This is a subset of the SSWG Cases.\n\nIDEV\tA script file recognized by PSS®E used for transporting and applying network model changes.\n\nLLI\tLarge Load Interconnection; The Interim Large Load Interconnection process outlined by ERCOT Market Notice W-A032522-0.\n\nModel On Demand\tModel On Demand application is a Siemens program that serves as a database and case building tool that SSWG uses to create and maintain the SSWG Cases.\n\nMOD Base Case\tThe TP Case loaded into MOD that is incrementally updated by ERCOT to maintain consistency between NMMS and MOD and is used as a starting point for building/updating SSWG Cases.\n\nMOD File Builder\tAn application which converts planning model changes made in the PSS®E application, IDEV,  into a PMCR-ready format, PRJ, which can be uploaded to MOD.\n\nNetwork Operations Model\tThe NMMS database containing the model of the ERCOT\nManagement System\tinterconnection which is the basis for all applications used in reliability and market analysis and system planning.\n\nOff-Cycle Updates\t\t\tModel updates which occurred between a biannual update cycle.\n\nPlanning Model Change Request\tA Planning Model Change Request modifies MOD to model future transmission projects in the SSWG Cases.\n\n\nPlanning Model Design Guidelines\tA manual that describes MOD, MOD File Builder, and naming\n& Expectations \t\t\tconventions for cases.\n\nProfile\tA method for specifying non-topology modeling parameters in the SSWG Cases which are not typically constant over the various seasons and years.  This includes load, generation, and device control information.  Profiles are described more fully in the ERCOT MOD Manual.\n\nROS\tERCOT Reliability and Operating Subcommittee.  SSWG is a working group created by ROS to create the steady-state planning models for ERCOT.  SSWG reports to ROS and takes direction from ROS.\n\nSSWG Cases:\t\t\t\tAll of the steady-state base cases created and maintained by the\nSSWG, as directed by the ROS.\n\nStandard PMCR\tA PMCR for adding planning model elements or modifying planning model attributes in the Network Operations Model in MOD for SSWG Cases that either are not available in the NMMS database or are not properly converted by the Topology Processor.\n\nTopology\t\t\t\tThe arrangement of buses and lines in a network model.\n\nTopology Processer (TP)\tSiemens software application that converts the ERCOT Network Operations network model to a planning bus/branch model.\n\nTP Case\tA bus/branch model created from the Network Operations Model using the Topology Processor application for a specific date.\n\nTransmission In-Service Date:\tThe equipment energization date used in the creation of the TP case and used in MOD to incorporate Project PMCRs that will be included in the MOD case build.\n\nTransmission Project Information \tA report (Excel spreadsheet) that is created triannually to reflect\nTracking\tthe updates related to transmission projects."
  },
  {
    "title": "3.2\tSSWG Case Definitions and Build Schedules",
    "text": "The SSWG Cases are created by SSWG each year and consist of the following:\n\n•\tEight seasonal cases starting with the SPG cases representing on-peak and off-peak conditions for the four seasons of the next year beyond the year the cases are built.\n•\tSix future year cases representing summer on-peak conditions with the first year beginning two years beyond the year the cases are built.\n•\tOne future year case representing high renewable and minimum load conditions.\n•\tOne future year case representing minimum load conditions.\nSSWG Case seasons are defined as follows:\n\nSPG\t\tMarch, April, May\nSUM\t\tJune, July, August, September\nFAL\t\tOctober, November\nWIN\t\tDecember, January, February\n\nThe following table is a guide for case creation.  YR represents the year the case is created.\nSSWG CASE\tNOTES\tTRANSMISSION IN-SERVICE DATE\n(YR+1) SPG1\t2\tApril 1, (YR+1)\n(YR+1) SPG2\t3\tApril 1, (YR+1)\n(YR+1) SUM1\t1\tJuly 1, (YR+1)\n(YR+1) SUM2\t3\tJuly 1, (YR+1)\n(YR+1) FAL1\t2\tOctober 1, (YR+1)\n(YR+1) FAL2\t3\tOctober 1, (YR+1)\n(YR+2) WIN1\t1\tJanuary 1, (YR+2)\n(YR+2) WIN2\t3\tJanuary 1, (YR+2)\n(YR+2) SUM1\t1\tJuly 1, (YR+2)\n(YR+3) SUM1\t1\tJuly 1, (YR+3)\n(YR+4) MIN\t4\tJanuary 1, (YR+4)\n(YR+4) HRML\t5\tJanuary 1, (YR+4)\n(YR+4) SUM1\t1\tJuly 1, (YR+4)\n(YR+5) SUM1\t1\tJuly 1, (YR+5)\n(YR+6) SUM1\t1\tJuly 1, (YR+6)\n(YR+7) SUM1\t1\tJuly 1, (YR+7)\n\n\nNotes:\n1.\tCases to represent the maximum expected load during the season.\n2.\tCases to represent maximum expected load during month of transmission in-service date.\n3.\tCases to represent lowest load on same day as the corresponding seasonal case (not a minimum case). For example, (YR) FAL2 case represents the lowest load on the same day as the (YR) FAL1 case.\n4.\tCase to represent the absolute minimum load expected for the year.\n5.\tCase to represent a high renewable generation dispatch and absolute minimum load expected for the year.\n3.2.1\tUpdates\nThe SSWG Case updates will be made in the MOD environment by changing an existing PMCR or creating a new PMCR.  It should be recognized that impedance or ratings updates made to the Network Operations Model after the TP case was created will have to be submitted as a ‘NOMCR Pending’ or ‘NOMCR Submitted’ PMCR to maintain consistency with the Network Operations Model.  See Planning Guide Section 6.4 for additional information about the TPIT process."
  },
  {
    "title": "3.3\tSSWG Case Build Processes",
    "text": "3.3.1\tOverview\nThe SSWG Cases are based upon the ERCOT Network Operations Model.  Network model data from the ERCOT NMMS system is used to create the TP case.  The TP case, or an incremental update to the previously uploaded TP case, is then imported into MOD and becomes the MOD base case.  ERCOT and the TSPs submit Standard PMCRs and PMCRs into MOD.  Other PMCRs are also submitted into MOD (i.e. ‘NOMCR_PENDING’ and ‘NOMCR_SUBMITTED’ PMCRs) which are aimed at maintaining consistency between NMMS and MOD.  Additionally, ERCOT and the TSPs submit Load, Generation, and Device Control Profiles into MOD.  After being submitted, approved, and accepted, the combination of PMCRs and Profiles are applied to the MOD seed case to create the SSWG Cases.\nThe primary software tools utilized for these processes are MOD, MOD File Builder and PSS®E. MOD is a web based application maintained by ERCOT.  TSPs and ERCOT use MOD to submit projects and profiles for SSWG Cases.  ERCOT compiles these submitted projects and profiles to build the SSWG Cases.  Case modifications can be accomplished in MOD by either uploading PMCRs in MOD, or by manual entry using the MOD interface.  SSWG members should consult the Planning Model Design Guidelines & Expectations manual for specific instructions on MOD.\n3.3.2\tIncremental Update\nUpon commencement of each new SSWG Case creation and each update, the SSWG implements an incremental update to the MOD base case in order to include the latest Network Operations Model data into the SSWG Cases.  This is accomplished by using MOD File Builder to compare the RAW files of topology processed NMMS data with selected data currently existing in MOD.  MOD File Builder is used to create a comparison PMCR that updates the corresponding Planning Model data in MOD to be consistent with the Network Operations Model data.  The comparison PMCR is subsequently submitted into MOD and committed to the MOD base case to perform the incremental MOD base case update.\nThe sample flowchart below identifies the general process:\n\n\n\n3.3.3\tTransmission In-Service Date for the TP Case\nThe TP case will be generated by ERCOT staff using an NMMS Transmission In-Service Date agreed upon by SSWG. The TP case will contain all existing NOMCRs with a Transmission In-Service Date on or before the agreed upon Transmission In-Service Date. Any NOMCR submitted after the TP case download which happens to have a Transmission In-Service Date prior to the agreed upon Transmission In-Service Date will not be included in the TP case.  For that situation, the TSP who owns the NOMCR must submit a PMCR to appropriately include the network model change in the SSWG Cases.\n3.3.4\tEntity Responsibilities\nThe  SSWG Cases are assembled and produced as a collaborative effort by the SSWG.  The responsibilities for providing this data are divided among the various Market Participants (MPs) and ERCOT. These data provision responsibilities may overlap among the various MPs because MPs may designate their representative or MPs may be a member of more than one MP group.  MPs can generally be divided into four groups: TSPs, LSEs, REs, and Market Entities.  ERCOT staff is included as a fifth entity with data provision responsibilities.  The data responsibilities of each group are as follows:\n3.3.4.1\tTSPs\n•\tIt is the responsibility of each TSP to provide accurate modeling information for all ERCOT Transmission Facilities owned or planned by the TSP.  Submission requirements and naming conventions described in the ERCOT Planning Model Design & Expectations manual shall be followed.\n•\tFuture Transmission Facility changes will be submitted as PMCRs. A PMCR phase date should correspond to the transmission in-service date. PMCRs should be submitted as far out into the future as possible. This technique will make the case building process more efficient when transitioning to new case builds.\n•\tTSPs shall submit Profiles of all load data and associated topology for the load entities of which they are designated representatives, as well as, any other load for which it has accepted responsibility for modeling.\n•\tTSPs shall change the load ID to ‘ER’ (or ‘E1’, ‘E2’, etc.) for loads for which it has historically  submitted data but no longer accepts responsibility.  ERCOT will determine the owner of the load and ensure they are part of the ALDR and SSWG processes. See Appendix E for additional details.\n•\tPUN loads and POI busses will be provided by TSPs.\n•\tNOIEs have the option of submitting a generation dispatch or deferring to ERCOT staff.\n•\tProper transmission system voltages will be maintained by submitting accurate data for static and dynamic reactive resources and transformer settings via a Device Control Profile for each case.  Scheduled bus voltages are maintained by the TSPs and submitted via Device Control Profiles as well.  TSPs can suggest different generator reactive limits Qmax and Qmin for ERCOT to submit in the Load Generation Profiles and should submit data to collaborate the need for the change such as historical unit operation and biennial reactive tests.  ERCOT will submit the change and follow-up with the RE and TSP to determine any Resource Registration Data modifications.\n•\tIf the TSPs identify errors with generator data or RE topology, the TSPs will notify ERCOT staff in accordance with the identified NMMS process.  This process entails email notification to the TSP of a Resource Registration Data change in their footprint and posting of updated Resource Registration Data data on the Citrix NMMS_POSTINGS area of the ERCOT Market Information System.\n•\tReview and resolve all inconsistencies identified from the incremental update process for their respective Transmission Facilities.\n•\tThe “MOD Project” is submitted by the TSPs and the MOD Project ID for the project will become the “TPIT number”.  When editing an accepted project, click the “Edit” button from the project list to put project into “Preliminary” state, then “View” the project from project list and use the “Replace” button to upload edited project.  This will preserve the MOD Project ID for TPIT.\n•\tTSPs are responsible for updating TPIT project and phase information in MOD during each tri-annual case build/update for all the applicable fields as shown below.\n\nField Name\tRequired/ Optional\nERCOT Project Number\tRequired\nRTP Project Number\tRequired if in RTP\nRPG Project Number\tRequired for submitted Tier 1, 2, and 3 projects\nProject Title\tRequired\nProject Description\tOptional\nComments/Reasons for Delays/Cancellations/Speedup\tOptional\nTerminal \"from\" Location\tOptional\nTerminal \"to\" Location\tOptional\nTransmission Status\tOptional\nAssociated Projects (project number)\tOptional\nTransmission Owner\tRequired\nTSP/Company Contact\tRequired\nTransmission Owner Project Number\tOptional\nProjected In-Service Date (Month/Yr)\tRequired\nActual In-Service Date (Month/Yr)\tRequired once energized in the field\nCONFIDENTIAL Total Project Estimated Cost\tRequired\nService Level kV\tRequired\nTrans Circuit Miles New\tOptional\nTrans Circuit Miles Rebuilt or Upgraded\tOptional\nAutotransformer Capacity (MVA)\tOptional\nReactive Capability Added\tOptional\nCounty Location for Substation or for a Line\tOptional\nCounty Location for Ending Point for a Line\tOptional\nPlanning Charter Tier\tRequired\nDate Submitted TO ERCOT for RPG Review\tRequired for submitted Tier 1, 2, and 3 projects\nDate RPG Review Completed (Month/Yr)\tRequired for submitted Tier 1, 2, and 3 projects, if RPG review has been completed.\nDate ERCOT BOD Review Completed\t-Required for submitted Tier 1 projects, if ERCOT BOD review completed.\nSSWG Base Case Related Bus Numbers\tRequired\nIs the project reflected in SSWG Base Cases?\tRequired\nPart of Interface (Y/N)\tRequired\nRequested Additional Information\tOptional\nOther (Optional)\tOptional\nPhase Number & MOD Project Number\tRequired\nTechnical Rationale  \tRequired if using a less limiting facility rating or voltage limit\nOther Rationale (Optional) \tOptional\n3.3.4.2\tLSEs\n•\tEntities not having representation on SSWG shall submit their data to ERCOT staff or to the directly connected TSP, if the TSP has agreed to be the agent on SSWG for that entity.\n•\tSee Section 6.5, Annual Load Date Request of the ERCOT Planning Guide.\n3.3.4.3\tResource and Interconnecting Entities\n•\tIt is the responsibility of REs to provide all data required to accurately model their generators, step-up transformers, associated transmission facilities and reactive devices in the SSWG Cases in accordance with Section 6.8, Resource Registration Procedures of the ERCOT Planning Guide.\n•\tInterconnecting Entities are required to submit data for SSWG Cases in accordance with Section 6.9 of the ERCOT Planning Guide.\n•\tIt is the responsibility of REs to supply any applicable load and/or generation data if they are the designated representatives for either a load or generating entity or both.\n3.3.4.4\tERCOT\n•\tIt is the responsibility of ERCOT staff to maintain the ERCOT MOD production environment that allows SSWG members to provide appropriate equipment characteristics and system data as stated in this procedure.\n•\tERCOT staff shall be responsible for creating each MOD incremental update base case.\n•\tERCOT staff shall be responsible for the review and inclusion of all latest available generator models with each biannual case update, including generator step-up transformers and associated RE-owned transmission facilities, RE-owned reactive devices, in the SSWG Cases. ERCOT staff will use a Bus Number range assigned to it and assign equipment IDs per ERCOT’s methodology.  Future units will be modeled in accordance with data provided by REs as required in the Generation Interconnection or Change Request Process.\n•\tERCOT staff shall provide and review all RE topology, ratings, and impedances, and provide technical rationale for any rating or voltage limit increase.\n•\tIf a TSP has operatorship of the breakers for a PUN, ERCOT will provide a zero impedance tie to the TSP specified POI bus.\n•\tIt is the responsibility of ERCOT staff to provide an initial generation dispatch for Pass 0 during the Planning Case creation, but this dispatch does not have to be economic or security constrained.\n•\tIt is the responsibility of ERCOT staff to provide the revised generation dispatch based on the latest topology and loads by submitting the Generation Profile with each biannual case update.  This dispatch will be in accordance with Section 4.3.3 of this document and will be provided at the next Pass after the case reaches an acceptable AC solution and no islands exist not related to an asynchronous tie or normally open equipment.\n•\tERCOT staff shall revise the generation dispatch as needed throughout the Planning Case building processes.\n•\tERCOT staff shall review submitted PMCRs and notify TSPs of any PMCRs which appear to modify topology, ratings, or impedances from the Network Operations Model which do not have a corresponding future project.\n•\tBased on the TSPs NERC responsibilities of providing appropriate equipment characteristics and system data, ERCOT staff shall not reject any PMCR that TSPs ultimately determine should be applied to a SSWG Case after appropriate reviews have occurred.\n•\tERCOT staff shall provide case checking files after each pass of the case building processes.\n•\tERCOT staff shall provide a MOD change request report following posting of finalized cases.\n•\tReview and resolve all inconsistencies identified from the incremental update process for RE data.\n•\tERCOT staff shall provide TPIT spreadsheet from MOD with each case build pass.\n•\tERCOT staff shall be responsible for posting the final TPIT spreadsheet triannually.\n•\tERCOT staff shall provide all updated SSWG Cases with every pass.\n•\tERCOT staff shall revert temporary configurations created by a RAS or CMP in the SSWG  Cases\n\n3.3.5\tProcess Overview for Building the SSWG Cases\n•\tSSWG Case Preparation\no\tExport the TP Case from NMMS.\no\tZero out TP Case load MW/MVAR quantities.\no\tConvert the TP Case to the current PSS®E version.\nIncremental update process:\no\tERCOT produces a comparison file with inconsistencies between the newly produced MOD case with an effective date of the TP pull date and the new TP case.\no\tERCOT shall upload and commit the comparison file to MOD which synchronizes MOD with NMMS.\no\tERCOT shall submit a PMCR to remove temporary configurations created by any RAS or CMP\no\tERCOT shall update all SODGs with the latest information from NMMS.\n\n•\tSSWG Case Build:\no\tReview existing PMCRs.\no\tSubmit/update PMCRs.\no\tSubmit/update Profiles.\no\tLoad generation dispatch.\no\tReview generation voltage schedules and suggest changes.\no\tReview generation reactive curves and suggest changes.\no\tInterim final review and tuning.\no\tSSWG approves cases.\no\tCases finalized by SSWG, the Case Information document, and the change request report are posted on the ERCOT Market Information System (MIS) website.\n\nAny changes required after the SSWG Cases are posted will be made in the MOD environment.  Off-Cycle Updates will be made by posting change files on the ERCOT MIS website per section 6.1 of the ERCOT Planning Guide.\n3.3.6\tTransition from Completed Build to Next Case Build\n•\tImplement the incremental update process biannual to include the latest Network Operation Modeling data.\n•\tProject files representing planned projects and profiles will be retained from the previous case update.\n•\tThis process will continue for both SSWG Case creation and for each biannual update."
  },
  {
    "title": "4.1\tBus, Area, Zone and Owner Data",
    "text": "4.1.1\tBus Data Records\nAll existing and planned transmission (60kV and above) and generator (greater than 10 MW) terminal buses shall be modeled in the SSWG Cases. Each bus record has a bus number, name, base kV, bus type code, area number, zone number, per-unit bus nominal voltage magnitude, bus voltage phase angle, and owner number. Reactive resources shall be modeled in either the fixed shunt table or the switched shunt table and shall not be modeled in any bus record.\n4.1.2\tBus Number Ranges\nThe ERCOT transmission system is modeled within the full PSS®E bus number range (1 through 999,997). The Chairman of the SSWG allocates bus ranges, new or amended, with confirmation from the SSWG members.  Each TSP represents their network in the SSWG Cases within the TSP’s designated bus number range. ERCOT represents Resource Entities (REs) and Private Use Networks (PUNs) in the SSWG Cases within ERCOT’s designated bus number range.  Bus number range assignments are listed in the Bus/Zone Range Table in Appendix A.\n4.1.3\tBus Names\nBus names shall not identify the customers or owners of loads or generation at new buses unless requested by customers.  The twelve character bus name in the planning model shall follow certain technical criteria as stated in the ERCOT Nodal Protocol Section 3.10 and Other Binding Documents.\n4.1.4\tArea Numbers\nTSPs and ERCOT are assigned area names and numbers for modeling purposes.  Area names and number assignments are listed in the Bus/Zone Range Table in Appendix A.  The area number does not refer to a geographic area.\n4.1.5\tZone Number Ranges\nIn PSS®E, each zone data record has a zone number and a zone name identifier. The Chairman of the SSWG allocates zone number ranges, new or amended, with confirmation from SSWG members. Each TSP represents their network in the SSWG Cases using allocated zone number ranges. Zone numbers from within the TSP’s designated zone range are assigned by the TSP.  ERCOT represents Resource Entities (REs) and Private Use Networks (PUNs) in the SSWG Cases using zone ranges allocated to ERCOT.  Zone numbers from within ERCOT’s designated zone range are assigned by ERCOT.  Zone number range assignments are listed in the Bus/Zone Range Table in Appendix A.\n\n\n4.1.6\tOwner IDs\nIn PSS®E, each owner data record has an owner number and an owner name identifier.  Owner IDs are assigned by ERCOT.\n4.1.7\tBus Voltage Limits\nNormal and Emergency Bus Voltage Minimum and Maximum Limits shall reflect voltage limits set forth by the “System Operating Limit Methodology for Planning and Operations Horizon” document, however, Emergency Bus Voltage Limits for generator buses shall reflect minimum generator or high-side of GSU steady-state or ride-through voltage limitations.\n4.1.8\tBus Data Source\nData Element\tSource For Existing  Elements\tSource For Planned Elements\nBus Number\tNMMS\tMOD PMCR\nBus Name\tNMMS \tMOD PMCR\nArea Number/Name\tNMMS\tMOD PMCR\nOwner Number/Name\tNMMS\tMOD PMCR\nBus Code\tNMMS & MOD STD PMCR\tMOD PMCR\nBus Voltage & angle\tNMMS & MOD PMCR\tMOD PMCR\nBus Voltage Limits\tNMMS & MOD PMCR\tMOD PMCR"
  },
  {
    "title": "4.2\tLoad Data",
    "text": "Real and reactive load forecasts within the SSWG Cases are populated with data consistent with, but not necessarily identical to, load data submitted through the ALDR process.  In general, the ALDR contains non-coincident load data while the SSWG Cases contain load data coincident with either the individual TSP projected load levels or the ERCOT system projected load level.  Furthermore, some of the loads defined in the SSWG Cases are not contained within the ALDR (e.g. off-peak, Spring, and Fall loads are not defined in the ALDR).  See Planning Guides Section 6.5 for further information about the ALDR process.\nEach load data record contains a bus number, load identifier, load status, area, zone, real and reactive power components of constant MVA load, real and reactive power components of constant current load, and real and reactive power components of constant admittance load.  In general, loads (MW and MVAR) should be modeled on the high side of transformers serving load at less than 60 kV.  However, special conditions may require more modeling detail such as parallel operation of power transformers from different sources.\nLoad Resources are not modeled in the SSWG Cases but are considered a Responsive Reserve.\n4.2.1\tGuidelines\n(1)\tThe bus number in the load data record must be a bus that exists in the SSWG Case.  The load identifier is a two-character alphanumeric identifier used to differentiate between loads at a bus. All self-serve loads must be identified by “SS”. If there are multiple self-serve loads at the same bus, then the self-serve loads will be identified by S1, S2, S3, etc.  See Section 4.3.1.1.  Partial self-serve load should be modeled as a multiple load with “SS” identifying the self-serve portion. See Appendix E for additional details.\n(2)\tThe load data record zone number must be in the zone range of the TSP submitting the load, or in the zone range of ERCOT for loads associated with PUNs.  Zone numbers for loads do not have to be the same as the bus to which the load is connected.\n(3)\tGenerator auxiliary load should not be modeled at generating station buses. Refer to section 4.3.1.\n(4)\tIn conformance with NERC Reliability Standards and the Planning Guide Section 6.5, entities not having representation on SSWG shall submit their load data to ERCOT or, if the directly connected TDSP has agreed to be the agent on SSWG for that entity, to that TSP.  If load data is not timely submitted on the schedule and in the format defined by the TSP, then ERCOT shall calculate loads based on historical data and insert these loads into the SSWG Cases during annual updates.\n(5)\tMultiple loads from different TSPs at a bus may be used. At this time, each TSP can define a load with a load ID of its choice. Careful coordination, however, is required between TSP representatives to ensure that the multiple loads modeled at the same bus are modeled correctly with unique load IDs. See Appendix E for additional details.\n(6)\tGuidelines for modeling DER  are detailed in the following table. DER shall not be modeled as negative load in any case.\nDER Type\tShould be Embedded in Load Forecasts?\tModeled as Generation by ERCOT?\nDGR\tNo\tYes\nDESR\tNo\tYes\nSODG\tNo\tYes\nUDG1 \tYes\tNo\n1Specific guidelines for modeling UDG involve representing the aggregated total nameplate value for UDG behind each load point in each load distributed generation field, with the ‘Distributed Generation Operator Mode’ field disabled. This is to ensure that only the aggregated total nameplate capability for the UDG is reflected in the models. Enabling the ‘Distributed Generation Operator Mode’ field could risk disproportionate representation of the UDG contribution due to the load models currently aggregating UDG contributions.\n4.2.2\tLoad Data Source\nNMMS determines the bus where the load is connected.  TSPs and ERCOT will assign MW and MVAR values by submitting Load/Generation Profiles through MOD.  New loads or corrections to the location of existing loads will be submitted by PMCR through MOD.\nData Element\tSource For Existing  Elements\tSource For Planned Elements\nBus Number\tNMMS\tMOD PMCR\nBus Name\tNMMS \tMOD PMCR\nArea Number/Name\tNMMS\tMOD PMCR\nOwner Number/Name\tNMMS\tMOD PMCR\nBus Code\tNMMS \tMOD PMCR\nLoad ID\tNMMS\tMOD PMCR\nLoad Zone\tNMMS \tMOD PMCR\nP load (MW)\tMOD PROFILES\tMOD PROFILES\nQ load (Mvar)\tMOD PROFILES\tMOD PROFILES\nScalable Flag\tNMMS/MOD PMCR1\tMOD PMCR\nInterruptible Flag\tNMMS/MOD PMCR2\tMOD PMCR\n1 - For the existing load elements, the scalable flag in SSWG Cases is populated based on the value of “CustomerLoad” attribute “Conforming Load Flag” in NMMS. If the “Conforming Load Flag” attribute is set to TRUE in NMMS, then the Scalable flag is “Checked” in SSWG Cases.\n2 - For the existing load elements, the Interruptible flag in SSWG Cases is populated based on the value of “CustomerLoad” attribute “Interruptible” in NMMS. If the “Interruptible” attribute is set to TRUE  in NMMS, then the Interruptible flag is “Checked” in SSWG Cases."
  },
  {
    "title": "1189\tSIMPLE_Model",
    "text": "4.3.1.2\tGeneration that meets Planning Guide 6.9(2)\nUpon meeting Planning Guide 6.9(2), ERCOT will utilize Resource Registration data provided by IEs/REs in accordance with ERCOT Protocols, Market Guides and the Generation Interconnection Process to model the Resource.  Only net real and reactive generator outputs and ratings should be modeled in SSWG Cases. Net generation is equal to the gross generation minus station auxiliaries and other internal power requirements.  All non-self-serve generation connected at 60 kV and above with at least 10 MW aggregated at the point of interconnect must be explicitly modeled. A generator explicitly modeled must include generator step-up transformer and actual no-load tap position. Generation of less than 10 MW is still required to be modeled, but not explicitly.\nUnit Reactive Limits (leading and lagging) for existing units are obtained from the Resource Registration data.  The Resource Registration data should reflect the most recent generator reactive unit test data conducted by the RE.  Limited Resource Registration data shall be made available to SSWG upon request.\nGenerator reactive limits should be modeled with one value for Qmax and one value for Qmin as described below:\nQmax\n\nQmax is the maximum net lagging MVAr observed at the low side of the generator step up transformer when the unit is operating at its maximum net dependable MW capability. Qmax is calculated from the lagging Resource Registration data MW4 MVar value by subtracting Resource Registration data auxiliary load MVAr.\n\nExample:\n\nResource Registration data lagging MW4 value is 85 MVAr\nResource Registration data auxiliary Load is 5 MVAr\nIn this example, Qmax is 85 – 5 = 80 MVAr\n\nQmin\n\nQmin is the maximum net leading MVAr observed at the low side of the generator step up transformer when the unit is operating at its maximum net dependable MW capability. Qmin is calculated from the leading Resource Registration data MW4 MVar value by subtracting Resource Registration data auxiliary load MVAr.\n\nExample:\n\nResource Registration data leading MW4 value is -55 MVAr\nResource Registration data auxiliary Load is 5 MVAr\nIn this example, Qmin is -55 – 5 = -60 MVAr\n4.3.1.3\tSelf-Serve Generation\nSelf-serve generators serve local load that does not flow through the ERCOT transmission system. Generation dispatch may be submitted by TSPs on a biannual basis for self-serve facilities serving self-serve load modeled in the SSWG Case. If no generation dispatch is submitted by the TSPs, ERCOT will dispatch the units accordingly to meet the self-serve load.  Total self-serve generation MWs shall match total self-serve load MWs.\n4.3.1.4\tDistribution Generation Resources, Distribution Energy Storage Resources, and Settlement Only Distribution Generators\nERCOT will utilize Resource Registration data provided by IEs/REs to model DGR, DESR, and SODG. SODG will be aggregated by fuel type and represented as a simple model and will be assumed to operate at unity power factor with no voltage control.\n4.3.1.5\tCoordination with other ERCOT Working Groups\nAll generator data should be coordinated with the Dynamics Working Group, Operations Working Group, Network Data Support Working Group and System Protection Working Group members to assure that it is correct before submitting the cases. This will insure that all of the cases have the most current steady state and dynamics information.  The following items should be provided to these working groups for data coordination:\n•\tUnit bus number\n•\tUnit ID\n•\tUnit maximum and minimum real power capabilities\n•\tUnit maximum and minimum reactive power capabilities\n•\tUnit MVA base\n•\tResistive and reactive machine impedances\n•\tResistive and reactive generator step-up transformer impedances\n•\tReactive devices modeled on the Generator side\n4.3.2\tLoad and Generation Balance\nBefore the generation schedule can be determined, the expected ERCOT load and losses (demand) must be determined. Each MW of demand needs to be accounted for by a MW of generation.\n4.3.3\tGeneration Dispatch Methodology for Planning Purposes\nIn order to simulate the future market, the following methodology for generation dispatch has been adopted for building the  Steady State Cases, with the exception of the HRML case. The HRML case build process is described separately below. Generation dispatch, as described below, is for planning and may not necessarily reflect the actual real-time dispatch.\nExisting and planned units owned by Non-Opt-In Entities (NOIE) are dispatched according to the NOIE dispatch spreadsheets submitted to ERCOT on a biannual basis; unless a NOIE requests that their units are to be dispatched according to the order that is described below or do not submit a NOIE dispatch.\nPrivate network generation is also dispatched independently. The units are dispatched to meet their load modeled in the case. The import/export contributions of the DC Ties will be set based on historical data to the extent that the contributions are consistent with those indicated in the most recent Capacity, Demand and Reserves (CDR) Report.  Likewise, wind units are dispatched in accordance with Appendix B, Method for Calculating Wind Generation Levels in SSWG Cases, to extent that the dispatch is consistent with the regional contributions indicated in the CDR Report. Solar units are dispatched at a level consistent with the CDR Report. Battery Energy Storage units are dispatched at a level consistent with the CDR Report for On-Peak Cases.\nUnits that are solely for black start purposes are to be modeled in the SSWG Cases; however, these units should not be dispatched.  Black Start units are designated with a unit ID of “BS”.\nAll other transmission level units are dispatched using an economic-simulation software package. Units will be dispatched to minimize production costs taking into account unit start-up times and cost and heat rates while adhering to the following guidelines for each set of cases: (YR is the year the case is created)\n\nSSWG CASE\tNOTES\tTRANSMISSION IN-SERVICE DATE\n(YR+1) SPG1\t1\tApril 1, (YR+1)\n(YR+1) SPG2\t1\tApril 1, (YR+1)\n(YR+1) SUM1\t1\tJuly 1, (YR+1)\n(YR+1) SUM2\t1\tJuly 1, (YR+1)\n(YR+1) FAL1\t1\tOctober 1, (YR+1)\n(YR+1) FAL2\t1\tOctober 1, (YR+1)\n(YR+2) WIN1\t1\tJanuary 1, (YR+2)\n(YR+2) WIN2\t1\tJanuary 1, (YR+2)\n(YR+2) SUM1\t2\tJuly 1, (YR+2)\n(YR+3) SUM1\t2\tJuly 1, (YR+3)\n(YR+4) MIN\t3\tJanuary 1, (YR+4)\n(YR+4) HRML\t4\tJanuary 1, (YR+4)\n(YR+4) SUM1\t2\tJuly 1, (YR+4)\n(YR+5) SUM1\t2\tJuly 1, (YR+5)\n(YR+6) SUM1\t2\tJuly 1, (YR+6)\n(YR+7) SUM1\t2\tJuly 1, (YR+7)\nNotes:\n1.\tThe SSWG Cases that are Security Constrained Economically Dispatched (SCED) using NERC and ERCOT contingencies for which non-consequential load loss is generally not allowed while monitoring Rate 1 (pre-contingency) and Rate 2 (post-contingency) for all transmission lines greater than 60 kV and transformers with the low side greater than 60 kV.\n2.\tThe SSWG Cases that are economically dispatched with an attempt to prevent Rate 1 overloads for all transmission lines greater than 60 kV and transformers with the low side greater than 60 kV.\n3.\tNot Economically Dispatched\n4.\tThe HRML case build process is as follows:\na.\tTopology\ni.\tUse the topology as of January 1, YR+4\nb.\tLoad\ni.\tLoad shall be set at absolute minimum load expected for the year (the same value utilized by the MIN case)\nc.\tRespect existing N-0 GTC limits\ni.\tModel and constrain on the GTC interfaces with an N-0 limit that is not 9999\nd.\tDispatch the case\ni.\tDispatch nuclear units at full capacity, and NOIE and PUN units at the output in the NOIE/PUN dispatch sheet\nii.\tTurn DC ties off\niii.\tDetermine reserve requirements from ancillary services and dispatch conventional generation on a lowest cost basis at PMIN if needed to meet reserve requirements.\n1.\tUse the average of the last January reserves for:\na.\tResponsive Reserve Service – Primary Frequency Response – to come from online headroom\nb.\tRegulation Up – to come from online headroom\nc.\tRegulation Down – to come from renewables\nd.\tNon-Spin – to come from online headroom\niv.\tDispatch additional conventional generation on a lowest cost basis at PMIN to meet the ERCOT critical inertia requirements\n1.\tThe minimum inertia level to meet is 121 GWs\n2.\tIf the requirements are already met by meeting AS reserve – do not dispatch additional conventional units\nv.\tCalculate the remaining load to be served (MIN load – sum of nuclear/PUN/reserve PGEN)\nvi.\tDispatch renewable units\n1.\tCollect historical hourly wind and solar data of the past 18 months\na.\tMonthly report on uncurtailed generation estimate data is posted on the WMWG meeting page each month\nhttps://www.ercot.com/committees/wms/wmwg\n2.\tRemove hours where uncurtailed wind or solar capacity output is less than 50%\n3.\tSum the hourly uncurtailed wind and solar capacity output\n4.\tFind the penetration of the sum of the hourly uncurtailed wind and solar capacity output to system load during the hour (sum/load)\n5.\tRank the hours by the penetration percentage from the previous step from highest to lowest and select the top twenty hours\n6.\tFind the average estimated uncurtailed renewable output (wind output + solar output respectively) from the top twenty hours\n7.\tCalculate the average ERCOT load in the top 20 hours\n8.\tTake the average estimated uncurtailed renewable output and divide it by the average ERCOT load in the top 20 hours to get the average uncurtailed renewable penetration of the top 20 hours for wind and solar respectively\n9.\tMultiply the uncurtailed renewable penetration value by the total load in the MIN case to determine the total number of renewable MW in the case\n10.\tDetermine the average uncurtailed wind capacity factor and solar capacity factor for the top 20 hours\n11.\tDetermine the ratio between the average uncurtailed wind and solar capacity factors, then distribute the total renewable MW by this ratio\n12.\tFor the selected top 20 hours, find the average uncurtailed capacity factors for each wind region and find the ratios between them\n13.\tAssign the total wind MW to each region based on these ratios\n14.\tIf the total amount of renewable generation to be dispatched is greater than the remaining load to be served, reduce the total number of Renewable MW to be dispatched to equal the remaining load to be served and use the same steps as above to determine the ratio of wind to solar generation\nvii.\tIf there remains load to be served ((MIN load – sum of nuclear/PUN/reserve PGEN/renewables) > 0), dispatch conventional units on a least cost basis to serve the remaining load\nviii.\tIf any GTCs are violated, adjust the dispatch by moving units with the highest shift factor on the GTC. Overall renewable output should be preserved and if renewables are dispatched downwards to meet GTC limits, then the capacity should be allocated to another region.\nix.\tThe Panhandle wind region should remain above 70% capacity factor.\nx.\tIf the case cannot be solved at given renewable output, adjust generation as needed.\nDGR and DESR shall be committed and dispatched using the same methodology as transmission-connected Resources of the same type. SODG shall be committed and dispatched based on their resource type as noted in the following table.\nSODG Resource Type\tCommitment / Dispatch\nBattery\tOffline\nSolar\tConsistent with CDR solar percent capacity contribution\nNatural Gas\tOffline\nDiesel\tOffline\nWind\tConsistent with CDR wind percent capacity contribution\nLandfill Gas\tOffline\nHydro\tOffline\nOther Inverter-Based Resources\tOffline\nOther Synchronous Generation\tOffline\n\nSSWG members shall be able to review and suggest changes to the generation dispatch based on historical information.\nIn all cases spinning reserve is maintained according to ERCOT Nodal Operating Guides, Section 2.3.1.1, to the extent that the extraordinary dispatch conditions in Section 4.3.3.1 Item 1 of this guide are not deployed.  Specifically, spinning reserve is maintained such that 50% of the Responsive Reserve Service obligation is made up of generation resources with the other 50% of Responsive Reserve Service obligation coming from Load Resources.  The dispatch may be modified in the seasonal SSWG Cases if necessary to maintain voltages at acceptable levels.\nNew transmission level Generation Resources will be included in the SSWG Cases on a biannual basis according to the procedures defined in Planning Guide, Section 6.9, addition of Proposed Generation Resources to the Planning Models.\nNew DGRs, DESRs, and SODGs will be included in the SSWG Cases on a biannual basis during the incremental updates with operational data from NMMS.\n4.3.3.1 \tExtraordinary Dispatch Conditions\nOn occasion, the total load plus the spinning reserve indicated above can exceed the amount of available generation due to load forecasts.  SSWG Cases typically model load at individual coincident TSP peaks instead of at the ERCOT coincident system peak.  When such a condition is encountered in future cases, ERCOT may increase generation resources by taking the indicated action, or adding generation, in the following order:\n\n1.\tIgnore spinning reserve.\n2.\tIncrease NOIE generation with prior NOIE consent.\n3.\tDC ties dispatched to increase transfers into ERCOT to the full capacity of the DC ties.\n4.\tDispatch SODG natural gas and diesel units up to their full capacity.\n5.\tDispatch units that have changed their status to indefinite mothball within the last 18 months and that have not announced their return to service. The dispatch methodology for this procedure is detailed below.\n6.\tScale transmission level wind generation dispatch up to 50% of capability.\n7.\tAdd units with interconnection agreements, but do not meet all of the requirements for inclusion defined in the Planning Guide.\n8.\tDispatch units that have changed their status to indefinite mothball over 18 months ago and have not announced their return to service. The dispatch methodology for this procedure is detailed below.\n9.\tAdd publicly announced  units without interconnection agreements.\n10.\tDispatch units that are solely for black start.\n11.\tScale wind generation dispatch up to 100% of capability\n12.\tAdd generation resources to the 345 kV transmission system near the sites of existing or retired units.\n\nERCOT shall post the extraordinary dispatch details used in each case to the MIS website.\n4.3.4\tGeneration Guidelines\n(1)\tERCOT will model registered resources and resource equipment.\n(2)\tERCOT will model future transmission level resources and resource equipment in the interconnection process using the “Generation_Interconnection” project type in MOD.  The project name shall contain the ERCOT GINR.\n(3)\tERCOT will model SODGs in using the “Standard PMCR” project type in MOD.\n(4)\tTSPs may model resource and resource equipment not requiring ERCOT registration and not required by the Generation Interconnection process if they desire the resource to be in the SSWG case.\n(5)\tERCOT shall update the PMAX and PMIN values based upon the Resource Registration Data net seasonal sustainable ratings.  The generator identifier is a two-character alphanumeric identifier used to differentiate between generators at a bus. All self-serve generators must be identified by P1. If there are multiple self-serve generators at the same bus, then self-serve generators must be identified by P1, P2, P3, etc. Self-serve economic generators must be identified by “PE”.\n(6)\tRefer to Appendix D for the generator identifiers used in the SSWG cases.\n(7)\tIn extraordinary dispatch scenarios, the following generator zones should be assigned by ERCOT:\n\nExtraordinary Dispatch Step\nZone Number\tZone Name\n4. & 7. Mothballed units that have not announced their return to service.\t1195\tEX_MB\n6. For units with interconnection agreements, but do not meet all of the requirements for inclusion defined in the Planning Guide\t1196\tEX_IA_NOFC\n8. For publicly announced units without interconnect agreements.\t1197\tEX_PUB_NOIA\n12. For generation resources added to the 345 kV transmission system near the sites of existing or retired units.\t1198\tEX_FAKEGEN\n\nMethodology for Dispatching Mothballed Units\nIn order to minimize the effect on transmission plans of the decision to use mothballed units to meet the load requirement, the generation that is needed from mothballed units as a group will be allocated over all the mothballed units on a capacity ratio share basis.  If this technique results in some of the mothballed units being dispatched at a level below their minimum load, an economic ranking will be used to remove the least economic units from consideration for that particular case so that the allocation of the load requirement among the remaining mothballed units will result in all of those units being loaded above their minimum loads.\nFor example, assume that, in some future year, ERCOT has a projected peak demand of 80,000MW and a total installed resource capacity of 82,000MW, with 3000MW of that installed capacity being units that are mothballed and have not indicated they will return.  For this simple example, assume that the mothballed capacity is 20 generating units of equal 150MW size.  Ignoring losses and spinning reserve requirement, the steady-state case would need to include 1000MW of the 3000MW mothballed capacity in order to match the load.   Thus, each of the 20 mothballed units would be set to an output of 50MW in the steady-state case (assuming their minimum load is less than 50MW).\nConsideration of Alternative Dispatch for Studies\nWhile this treatment of mothballed units attempts to generally minimize the effect of the assumption that mothballed units will be used to meet the load requirement in the SSWG Cases (rather than assumed new generation), the planning process should also consider alternative generation dispatches in instances where this treatment of mothballed units could have a direct effect on transmission plans.  Specifically, in instances where having a mothballed unit available would alleviate the need for a transmission project that would be required to meet reliability criteria if the mothballed unit were not to return, the transmission project should not be deferred based on the assumption that the mothballed unit will return to service.\n4.3.4\tVoltage Profile Adjustments\nAfter the generation dispatch has been determined, the expected voltage profile for the system can be applied. The scheduled voltages should reflect actual voltage set points used by the generator operators.\nTSPs should check the voltages at several key locations within the system when modifying generation control voltages and reactive devices.  Voltage profile changes can be accomplished by turning on/turning off capacitors or reactors, and by changing the operations of generators (turning on/turning off/redispatching for VAR control). The cases should ultimately model system voltages that could be reasonably expected to occur.\n4.3.5\tGenerator Data Source\nData Element\tSource For Existing  Elements\tSource For Planned Elements\nBus Number\tNMMS\tMOD PMCR\nBus Name\tNMMS \tMOD PMCR\nMachine ID\tNMMS\tMOD PMCR\nBus Code\tNMMS \tMOD PMCR\nV Schedule\tMOD PROFILES\tMOD PROFILES\nRemote Bus (Voltage Control)\tMOD PMCR\tMOD PROFILES\nRMPCT\tMOD PROFILES\tMOD PROFILES\nPGen (MW)\tDISPATCH - MOD PROFILES\tDISPATCH - MOD PROFILES\nQGen (Mvar)\tDISPATCH - MOD PROFILES\tDISPATCH - MOD PROFILES\nPMax (MW)\tResource Registration Data - NMMS\tResource Registration Data - MOD PROFILES\nPMin (MW)\tResource Registration Data - NMMS\tResource Registration Data - MOD PROFILES\nQMax (Mvar) \tResource Registration Data - NMMS\tResource Registration Data - MOD PROFILES\nQMin (Mvar)2 \tResource Registration Data - NMMS\tResource Registration Data - MOD PROFILES\nMbase (MVA)2 \tResource Registration Data - NMMS\tResource Registration Data - MOD PMCR\nR Source (pu)2\tResource Registration Data - NMMS\tResource Registration Data - MOD PMCR\nX Source (pu)2\tResource Registration Data - NMMS\tResource Registration Data - MOD PMCR\nOwner\tResource Registration Data - NMMS\tResource Registration Data - MOD PMCR\nGenerator Step-up Unit (GSU) ID\tNMMS\tMOD PMCR\nGSU Tap positions2\tResource Registration Data - NMMS\tResource Registration Data - MOD PMCR\nGSU Tap Controls2\tResource Registration Data - NMMS\tResource Registration Data - MOD PMCR\nGSU Specified R 2\tResource Registration Data - NMMS\tResource Registration Data - MOD PMCR\nGSU Specified X 2\tResource Registration Data - NMMS\tResource Registration Data - MOD PMCR\nRate 1 / Rate 2/ Rate 3 / Rate 4 / Rate 5\tResource Registration Data - NMMS\tResource Registration Data - MOD PMCR\n\nData Element\tSource For Existing  Elements\tSource For Planned Elements\nGenerator Reactive Devices Control Mode2\tResource Registration Data - NMMS\tResource Registration Data - MOD PMCR\nGenerator Reactive Devices Vhi (pu)2\tResource Registration Data - MOD PROFILES\tResource Registration Data - MOD PROFILES\nGenerator Reactive Devices Vlo (pu)2\tResource Registration Data - MOD PROFILES\tResource Registration Data - MOD PROFILES\nGenerator Reactive Devices Binit (Mvar)\tMOD PROFILES\tMOD PROFILES\nGenerator Reactive Devices Bsteps (Mvar)2\tResource Registration Data - NMMS\tResource Registration Data - MOD PMCR\nWind Machine Control Mode\tNMMS- / MOD PMCR\tMOD PMCR\nWind Machine Power Factor\tNMMS/MOD PMCR\tMOD PMCR\nDER Model Data\tNMMS/MOD PMCR\tN/A"
  },
  {
    "title": "4.4\tBranch Data",
    "text": "4.4.1\tUse of Branch Record Data Fields\nAll existing and planned transmission lines (60 kV and above) shall be modeled in the SSWG Cases.\n4.4.1.1\tBus Specifications\nThe end points of each branch in the SSWG Cases are specified by “from” and “to” bus numbers.  In most cases the end point buses are in the same TSP area.  However, when the “from” and “to” buses used to specify a branch are in different TSP areas, the branch is considered to be a tie line (See Section 4.4.3, Coordination of Tie Lines). Branch data includes exactly two buses. The end points of Multi-Section Lines (MSL) are defined by two buses specified in a branch data record (See Section 4.4.2). There are other components that are modeled with more than two buses, such as transformers with tertiary that may be represented by three-bus models.\n4.4.1.2\tBranch Circuit Identifier\nCircuit identifiers are limited to two alphanumeric characters.  Each TSP will determine its own naming convention for circuit identifiers.  ERCOT will determine its own naming convention for branches owned by REs and PUNs with careful coordination with connected TSPs.  These identifiers are typically numeric values (e.g. 1 or 2) that indicate the number of branches between two common buses, but many exceptions exist.\n4.4.1.3\tBranch Impedance and Admittance Data\nThe branch resistance, reactance, and admittance data contained in the SSWG Cases are expressed in per-unit quantities that are calculated from a base impedance. The base impedance for transmission lines is calculated from the system base MVA and the base voltage of the transmission branch of interest.  The system base MVA used in the SSWG Cases is 100 MVA (S = 100 MVA).  The base voltage for a transmission line branch is the nominal line-to-line voltage of that particular transmission branch (See Transformer Data for Calculation of Transformer Impedances). Therefore the base impedance used for calculating transmission branch impedances is:\n\nOhms\nThis base impedance is then used to convert the physical quantities of the transmission line into per-unit values to be used in the SSWG Cases.\n4.4.1.3.1\tResistance\nOnce the total transmission line resistance is known and expressed in ohms, then this value is divided by the base impedance to obtain the per-unit resistance to be used in the SSWG Cases.  This calculation is as follows:\n\n4.4.1.3.2\tReactance\nOnce the total transmission line reactance is known and expressed in ohms, then this value is divided by the base impedance to obtain the per-unit reactance to be used in the SSWG Cases.  This calculation is as follows:\n\n4.4.1.3.3\tAdmittance\nBranch admittance is expressed as total branch charging susceptance in per unit on the 100 MVA system base.  The total branch charging is expressed in MVARs and divided by the system base MVA to get per unit charging.  The equation used to accomplish this depends on the starting point. Typically the charging of a transmission line is known in KVARs.  Given the total transmission line charging expressed in KVARs, the equation to calculate the total branch charging susceptance in per unit on the system base is as follows:\n\n\nOr, given the total capacitive reactance to neutral expressed in ohms  , the equation to calculate the total branch charging susceptance in per unit on the system base is as follows:\n\n\n\n\n4.4.1.4\tFacility Ratings\nSSWG Cases contain fields for five ratings for each branch record, including zero impedance branches.  The ratings associated with these five fields are commonly referred to as Rate 1, Rate 2, Rate 3, Rate 4, and Rate 5.  Each TSP has their own methodology for calculating these ratings and shall be made available to others within ERCOT upon request. Following are the SSWG Case facility ratings corresponding to the ratings defined in Nodal Protocol 2.1:\n\nPlanning Case Rating Definitions\tCorresponding Nodal Protocol Section 2.1 Definitions\nRate 1\tNormal Rating\nRate 2\tEmergency Rating\nRate 3\t 15-Minute Rating\nRate 4\tTransformer 2-Hour/Branch Conductor Rating\nRate 5\tRelay Loadability Rating\n\nBy definition, Rate 5 ≥ Rate 3 ≥ Rate 2 ≥ Rate 1 and Rate 4 ≥ Rate 2 ≥ Rate 1.\n\nWhen performing security studies, ERCOT will default to Rate 2, unless the TSP has previously indicated in writing that other ratings (e.g., Rate 1) should be used.  If problems exist using Rate 2 and Rate 2 is significantly different from Rate 4, then ERCOT will contact the TSP. There may also be 8888 or 9999 ratings in the SSWG Cases. The 8888 rating represents items such as change of ownership at a substation facility, a radial Point Of Interconnect to a customer, normally open facilities inside a substation used for load transfer and other similar situations that are not an integral part of the transmission grid itself. The 8888 ratings are used by the facility owner to indicate they have reviewed the rating. The 9999 ratings are a default value assigned to facilities by the NMMS system as part of the base case preparation; they apply to similar situations as the 8888 ratings and are not an integral part of the transmission grid itself. For Rate 5, the default value for an element that is not protected by a relay loadability rating is 88888, and the default value for an element that will be protected by a relay loadability rating which hasn’t been determined yet is 99999.\n4.4.1.4.1\tMost Limiting Series Element\nFacility ratings shall not exceed the most limiting applicable equipment rating of the individual equipment that comprises the facility. If the continuous or two (2) hour ratings of any series elements at the station terminals is less than the associated transmission line’s continuous or two (2) hour rating, then the most limiting elements’ rating data will be used as the Rate 1 and/or Rate 2 rating for the transmission line.  The scope of equipment addressed shall include, but not be limited to, conductors, transformers, relay protective devices, terminal equipment, and series and shunt compensation devices.\n4.4.1.5\tShunt Admittance\nBranch Data records include four fields for complex admittance for line shunts.  These records are rarely used in the SSWG Cases.\n4.4.1.6\tStatus\nBranch data records include a field for branch status.  Entities are allowed to submit branch data with an out-of-service status for equipment normally out of service.\n4.4.1.7\tLine Length and Ownership\n4.4.1.7.1\tLine Length\nThis data will be provided in miles.\n4.4.1.7.2\tOwnership\nOwner IDs are assigned by ERCOT.  The PSS®E line data record allows the specification of up to four owners for each branch including percent ownership. The percent ownership of each line should sum up to 100%.  Facilities owned by Generators will be assigned a non-TSP ownership ID in the SSWG Cases.\n\nOSRs are ratings submitted by jointly owned facility Owners for their specific ratings  to ERCOT Network Operational Models.\n4.4.1.7.3\tPractices for Verification\nTransmission line length for existing lines should be verified from field data and actual values entered into the power flow model.  A simple check can be utilized to verify certain modeling parameters for overhead lines.  The following equation is an approximation that applies to transmission lines that are completely overhead or assuming    MVA then\n\n\n\n\n\n4.4.2\tMulti-Section Line Grouping\nA multi-section line is defined as a grouping of several previously defined branches into one long circuit having several sub-sections or segments.\n\nExample: Two circuits exist (Figure 1) which originate at the same substation (4001) and terminate at the same substation (4742).  Each circuit has a tap to Substation A and a tap to Substation B.  If a fault occurs or maintenance requires an outage of Circuit 09, the circuit would be out-of-service between bus 4001 and bus 4742 including the taps to buses 4099 and 4672.  The loads normally served by these taps would be served by means of low-side rollover to buses 4100 and 4671 on Circuit 21.  This is the type of situation for which multi-section lines are used to accurately model load flows.\n\n\nFigure 1.  Example of circuits needing to use multi-section line modeling.\n\nFigure 2 represents a power-flow data model of the circuits in Figure 1.  Branch data record would have included the following:\n4001,4099,09,…\n4099,4672,09,…\n4672,4742,09,…\n4001,4100,21,…\n4100,4671,21,…\n4671,4742,21,…\nalong with the necessary bus, load, and shunt data.  To identify these two circuits as multi-section lines, entries must be made in the raw data input file.  The multi-section line data record format is as follows:\n\n\nI,J,ID,DUM1,DUM2, … DUM9  where :\n\nI\t“From bus” number.\nJ\t“To bus” number.\nID\tTwo characters multi-section line grouping identifier. The first character must be an ampersand (“&”).  ID = ‘&1’ by default.\nDUMi\tBus numbers, or extended bus name enclosed in single quotes, of the “dummy buses” connected by the branches that comprise this multi-section line grouping. No defaults allowed.\n\nUp to 10 line sections (and 9 dummy buses) may be defined in each multi-section line grouping.  A branch may be a line section of at most one multi-section line grouping.\n\nEach dummy bus must have exactly two branches connected to it, both of which must be members of the same multi-section line grouping.\n\nThe status of line sections and type codes of dummy buses are set such that the multi-section line is treated as a single element.\n\n\nFigure 2. Power-flow model of example circuits.\n\nFor our example, the following would be entered as multi-section line data records:\n4001, 4742, &1, 4099, 4672\n4001, 4742, &2, 4100, 4671\nMulti-section lines give a great amount of flexibility in performing contingency studies on SSWG Cases.  When set up correctly, where automatic low-side load rollover occurs, hundreds of contingencies can be analyzed and reported within minutes.\n\n4.4.3\tCoordination of Tie Lines\nA tie line is defined as any transmission circuit with multiple owners represented within the context of the transmission circuit’s associated facility.  As used here, a transmission circuit’s associated facility includes all terminal buses as well as the transmission branch, transformer, bus section, or another electrical component connecting systems together.  For a tie line, each of the interconnected entities (TSP/TSP or TSP/RE) owns one or more elements of the tie line’s associated facility.\n\nCareful coordination and discussion is required among SSWG members to verify all modeled tie line data.  Even in situations where no new tie lines are added to a network model, there could be many tie line changes.  Construction timing for future points of interconnection or modified existing points of interconnection can change.  As a result, a tie line may need to be deleted from some cases and added to others (e.g. deleted from spring cases and added to summer cases).  Additionally, a new substation installed in the middle of an existing tie line can redefine the tie line’s bus numbers, mileages, impedances, ratings, or ownership.\n\nTie line models also affect a number of important ERCOT calculations and therefore must accurately reflect real-world conditions.  Missing, redundant, or erroneous tie line models can produce unrealistic indications of stability and/or voltage limits.  Inaccurate impedances, ratings, transformer adjustment data, status information, mileages, or ownership data can all have a profound effect on system studies.  Therefore, it is imperative that neighboring entities exercise care in coordinating tie line data.\nRatings for tie lines should be mutually agreed upon by all involved entities and should comply with NERC Reliability Standards.\n\nIt is imperative for neighboring entities to coordinate tie line data in order to allow Planning Case work activities to proceed unimpeded. Entities should exchange tie-line data at least two weeks before the data is due to ERCOT. Coordination of tie line data includes timely agreement between entities on the following for each tie line:\n•\tIn-service/ out-service dates for ties\n•\tFrom bus number\n•\tTo bus number\n•\tCircuit identifier\n•\tImpedance and charging data\n•\tRatings\n•\tTransformer adjustment (LTC) data\n•\tStatus of branch\n•\tCircuit miles\n•\tOwnership (up to four owners)\n•\tEntity responsible for submitting data\n\nOSRs can be submitted separately into NMMS/MAGE but for PMCRs in MOD only one set of ratings can be submitted.  Impedance and length are only allowed to have one submission, the majority owner of the tie line should submit this data to NMMS/MAGE and MOD and ensure that they are accounting for any other modeling information for connecting entities.\n\n\n4.4.4\tMetering Point\nEach tie line or branch has a designated metering point and this designation may also be coordinated between neighboring TSP areas.  The location of the metering point determines which TSP area will account for losses on the tie branch.  PSS®E software allocates branch losses to the TSP area of the un-metered bus.  For example, if the metering point is located at the “to” bus then branch losses will be allocated to the TSP area of the “from” bus.  The first bus specified in the branch record is the default location of the metering point unless the second bus is entered as a negative number. These are the first and second data fields in the branch record.\n4.4.5\tBranch Data Source\nData Element\tSource For Existing  Elements\tSource For Planned Elements\nFrom Bus Number\tNMMS\tMOD PMCR\nFrom Bus Name\tNMMS \tMOD PMCR\nTo Bus Number\tNMMS\tMOD PMCR\nTo Bus Name\tNMMS \tMOD PMCR\nID\tNMMS\tMOD PMCR\nResistance R (pu) \tNMMS\tMOD PMCR\nReactance X (pu)4\tNMMS\tMOD PMCR\nCharging Susceptance (pu) \tNMMS\tMOD PMCR\nBranch Status\tNMMS\tMOD PMCR\nRate 1/Rate 2/ Rate 3 / Rate 4 / Rate 5 (MVA)\tNMMS\tMOD PMCR\nLine Length (Miles)\tNMMS\tMOD PMCR\nOwner \tNMMS\tMOD PMCR\nRE or PUN Owned Branch data\tResource Registration Data - NMMS\tResource Registration Data - MOD PMCR\nMulti-Section Line\tNMMS\tMOD PMCR"
  },
  {
    "title": "4.5\tTransformer Data",
    "text": "4.5.1\tUse of Transformer Record Data Fields\nAll existing and planned transformers are to be represented in the SSWG Cases.  Transformer data records specify all the data necessary to model transformers in power flow calculations.  Both two winding transformers and three winding transformers can be specified in the SSWG Cases.\n4.5.1.1\tBus Specifications\nThe end points of each transformer in the SSWG Cases are specified by “winding 1” and “winding 2” bus numbers.  In some cases, the “winding 1” and “winding 2” buses used to specify a transformer are in two different TSP areas, making the transformer a tie line (See Section 4.4.3, Coordination of Tie Lines). Three winding transformers (transformers with a tertiary winding) can be represented by specifying a “winding 3” bus number in the data to represent the tertiary winding.\n4.5.1.2\tTransformer Circuit Identifier\nCircuit identifiers are limited to two alphanumeric characters. Each TSP will determine its own naming convention for circuit identifiers. Actual transformer identifiers may be used for circuit identifiers for transformers, however, typically, circuit identifiers are used to indicate which transformer is being defined when more than one transformer is modeled between two common buses. TSP’s can identify autotransformers with the letter A as the first character of the ID field.  Generator Step-Up transformers can be identified with the letter G.  Phase-shifting transformers can be identified with the letter P.\n4.5.1.3\tImpedance and Admittance Data\nThe resistance and reactance data for transformers in the SSWG Cases can be specified in one of three ways: (1) in per-unit on 100 MVA system base (default), (2) in per-unit on winding base MVA and winding bus base voltage, (3) in transformer load loss in watts and impedance magnitude in per-unit on winding base MVA and winding bus base voltage.  Transformer resistance and reactance data supplied from the Topology Processor are specified in per-unit on 100 MVA system base.\n4.5.1.3.1\tResistance\nTransformer test records should be used to calculate the resistance associated with a transformer record. Where transformer test records are unavailable, the resistance should be entered as either a value similar to a comparable transformer or zero.\n4.5.1.3.2\tReactance\nTransformer test records or transformer nameplate impedance should be used to calculate the reactance associated with a transformer record. Where the transformer resistance component is known, the transformer reactance is calculated on the same base using the known data and the reactance component is determined using the Pythagorean Theorem. Where the transformer resistance is assumed to be zero, the calculated transformer reactance can be assumed to be equal to the transformer impedance.\n4.5.1.3.3\tSusceptance\nFor power-flow modeling purposes, the transformer susceptance is always assumed to be zero.\n\n\n4.5.1.4\tTransformer Ratings\nThe ratings used for transformer are defined the same as the ratings used for branches described in Section 4.4.1.4.\n4.5.1.5\tStatus\nTransformer data records include a field for status.  Entities are allowed to submit transformer data with an out-of-service status for equipment normally out of service.\n4.5.1.6\tOwnership\nUp to four owners and corresponding percent ownership can be specified for each transformer in the SSWG Cases. Owner IDs and corresponding percent ownership should be included for all transformers. The sum of all percent ownerships should equal 100% for every transformer.\n4.5.1.7\tAngle\nIn PSS®E, the phase shift across a two-winding transformer is specified by an angle referenced to the winding defined as “winding 1” by the combined logic of the “From Bus Number”, “To Bus Number” and “Winding 1 Side” (From or To logic) fields.  The phase shift angle is positive when the voltage of the bus corresponding to the referenced winding leads the voltage of the bus connected to the opposite winding.\n\nThe phase shift(s) associated with a three-winding transformer is(are) accounted for by the specification of an angle for each of the three windings.  The phase shift angle across a winding is positive when the voltage of the corresponding bus leads the voltage of the star point bus.\n\nThe transformer phase shift angle is measured in degrees for both two-winding and three-winding transformers.\n4.5.1.8\tTap Data\nAll transformer tap characteristics should be appropriately modeled.  Such tap characteristics include no-load tap settings and load tap changing (LTC) properties and associated control settings.\n4.5.1.8.1\tRatio\nThe ratio is defined as the transformer off nominal turns ratio and is entered as a non-zero value, typically in per unit. Where the base kV contained in the bus data records for the buses connected to transformer terminals are equal to the rated voltage of the transformer windings connected to those terminals, the transformer off-nominal ratio is equal to 1.00. When the transformer has no-load taps, the transformer off-nominal ratio can be something other than 1, but is usually in the range of 0.95 to 1.05. The effects of load tap changing (LTC) transformer taps are also handled in the transformer data record.\n4.5.1.8.2\tControl Mode\nThis field enables or disables automatic transformer tap adjustment. Setting this field to a value other than zero (“None” within PSS®E) enables automatic adjustment of the LTC or phase shifter as specified by the adjustment data values during power-flow solution activities. Setting this field to zero prohibits automatic adjustment of this transformer during the power-flow solution activities.\n4.5.1.8.3\tControlled Bus\nThe bus number of the bus whose voltage is controlled by the transformer LTC and the transformer turns ratio adjustment option of the power-flow solution activities. This record should be non-zero only for voltage controlling transformers.\n4.5.1.8.4\tTransformer Adjustment Limits\nThese two fields specify the upper and lower limits of the transformer’s turns ratio adjustment or phase shifter’s angle adjustment.  For transformers with automatic tap changer adjustments, these fields are typically populated with values in the range of 0.80 to 1.20 per-unit.  For phase-shifting transformers, these fields may be populated with phase angle adjustment ranges up to +/- 180 degrees, but are typically modeled with values in the range of +30 to -30 degrees.\n4.5.1.8.4.1\tUpper Limit (Rmax)\nThis field defines the maximum upper limit of the off-nominal ratio for voltage or reactive controlling transformers and is typically entered as a per-unit value. The limit should take into account the no-load tap setting of the transformer, if applicable. For a phase shifting transformer, the value is entered in degrees.\n4.5.1.8.4.2\tLower Limit (Rmin)\nSimilar to the upper limit, this field defines the lower limit of the off-nominal ratio or phase shift angle for the transformer defined.\n\n4.5.1.8.5\tVoltage or Power-Flow Limits\nThese two fields specify the upper and lower voltage limits at the controlled bus or for the real or reactive load flow through the transformer at the tapped side bus before automatic LTC adjustment will be initiated by the power-flow program. As long as bus voltage, or real power flow for phase shifting transformers, is between the two limits, no LTC adjustment will take place during the power-flow solution activities.\n4.5.1.8.5.1\tUpper Limit (Vmax)\nThis field specifies the upper limit for bus voltage in per unit at the controlled bus or for the reactive load flow in MVAR at the tapped side bus. For a phase shifting transformer, this field specifies the upper limit for the real power load flow in MW. Direction for power flow across the phase shifting transformer is referenced from the bus side defined as the “Winding 1” bus.  Negative upper (and lower) limit values for phase shifting transformers imply power flow from the “Winding 2” bus to the “Winding 1” bus.\n4.5.1.8.5.2\tLower Limit (Vmin)\nSimilar to the upper limit, this field specifies the lower limit for the bus voltage or the real or reactive load flow for the transformer defined.\n4.5.1.8.6\tTap Positions Step\nTransformer test records or nameplate data should be used to identify the number of tap positions available for a transformer’s LTC, along with the corresponding maximum and minimum turns ratio adjustment capabilities (i.e. Rmax and Rmin).  The transformer’s turns ratio step increment for a LTC can be calculated based upon data present in the “Tap Positions”, “Rmax”, and “Rmin” fields of the transformer’s PSS®E model.  A common range for a LTC turns ratio step increment is +/- 10 % over 33 tap positions (32 steps), which corresponds to 5/8% or 0.00625 per unit voltage increment per tap step.\n4.5.1.8.7\tTable\nThe number of a transformer impedance correction table is specified by this field if the transformer's impedance is to be a function of either the off-nominal turns ratio or phase shift angle. SSWG Cases normally don’t use these tables and this field is set to zero by default.\n4.5.1.9\tMagnetizing Admittance\nMagnetizing admittance data is not required for SSWG Cases and the values for each of these two fields should be zero.\n4.5.1.10\tLoad Drop Compensation\nThese two fields define the real and reactive impedance compensation components for voltage controlling transformers. They are ignored for MW and MVAR flow controlling transformers. SSWG Cases normally don’t use these fields and they are set to zero by default.\n4.5.1.10.1\tResistive Component\nThe resistive component of load drop compensation entered in per unit is based on the resistance between the location of the LTC and the point in the system at which voltage is to be regulated.\n4.5.1.10.2\tReactive Component\nSimilar to the resistive component of load drop compensation, this value is entered in per unit and is based on the reactance between the location of the LTC and the point in the system at which voltage is to be regulated.\n4.5.2\tTransformer Data Source\nData Element\tSource For Existing  Elements\tSource For Planned Elements\nFrom Bus Number\tNMMS\tMOD PMCR\nFrom Bus Name\tNMMS \tMOD PMCR\nTo Bus Number\tNMMS\tMOD PMCR\nTo Bus Name\tNMMS \tMOD PMCR\nLast Bus Number\tNMMS\tMOD PMCR\nLast Bus Name\tNMMS \tMOD PMCR\nID\tNMMS\tMOD PMCR\nTransformer Name\tNMMS\tMOD PMCR\nResistance R (pu) \tNMMS\tMOD PMCR\nReactance X (pu)6\tNMMS \tMOD PMCR\nSusceptance\tNMMS or N/A\tMOD PMCR or N/A\nRate 1/Rate 2/ Rate 3 / Rate 4 / Rate 5\tNMMS \tMOD PMCR\nStatus\tNMMS/ MOD STD PMCR\tMOD PMCR\nOwner\tNMMS\tMOD PMCR\nAngle (phase-shift)\tNMMS\tMOD PMCR\nTap Ratio\tMOD PROFILES\tMOD PROFILES\nControl Mode\tNMMS\tMOD PMCR\nControlled Bus\tNMMS\tMOD PMCR\nTransformer Adjustment Limits\tNMMS\tMOD PMCR\nVoltage or Power-flow Limits\tMOD PROFILES\tMOD PROFILES\nTransformer Tap Step\tNMMS\tMOD PMCR"
  },
  {
    "title": "4.6\tStatic Reactive Devices",
    "text": "All existing and planned static reactors and capacitors that are used to control voltage at the transmission level are to be modeled in the SSWG Cases to simulate actual transmission operation. There are two distinct static reactive devices currently represented in the SSWG Cases: shunt devices and series devices.\n4.6.1\tShunt Devices\n4.6.1.1\tSwitched Shunt Devices\nA shunt capacitor or reactor located in a station for the purpose of controlling the transmission voltage can be represented in the SSWG Cases as a switched shunt device to accurately simulate operating conditions.  Care should be exercised when specifying the size of cap banks. Be sure that the rated size of the bank is for 1.0 per unit voltage.  Care should be taken to ensure that distribution level capacitors are not modeled in such a way as to be counted twice.\nWhen a switched capacitor or reactor is submitted as the switched shunt data record, there are three modes that it can operate in: fixed, discrete, or continuous.  Switched capacitors are to be modeled in the mode in which they are operated.\nA switched shunt can be represented as up to eight blocks of admittance, each one consisting of up to nine steps of the specified block admittance. The switched shunt device can be a mixture of reactors and capacitors.  The reactor blocks are specified first in the data record (in the order in which they are switched on), followed by the capacitor blocks (in the order in which they are switched on). The complex admittance (p.u.), the desired upper limit voltage (p.u.), desired lower limit voltage (p.u.), and the bus number of the bus whose voltage is regulated must be defined to accurately simulate the switched shunt device. A positive reactive component of admittance represents a shunt capacitor and a negative reactive component represents a shunt reactor.\n4.6.1.2\tFixed Shunt Devices\nA shunt capacitor or reactor located in a station for the purpose of controlling the transmission voltage can be represented in the SSWG Cases as a fixed shunt device to accurately simulate operating conditions.  Care should be exercised when specifying the size of cap banks. Be sure that the rated size of the bank is for 1.0 per unit voltage.  Care should be taken to ensure that distribution level capacitors are not modeled in such a way as to be counted twice.\n\nMultiple fixed shunts can be modeled at a bus, each with a unique ID.  These fixed shunts have a status that can be set to on or off.\n\nA positive reactive component of admittance represents a shunt capacitor and a negative reactive component represents a shunt reactor.\n\n4.6.1.3\tDummy Bus Shunt\nIf a switchable or fixed capacitor or reactor were connected to a transmission line instead of a station bus, an outage of the transmission line would also cause the capacitor or reactor to be taken out of service (see Figure 3).  For these instances, the most accurate model is the switched shunt modeled at a dummy bus connected by a zero impedance branch to the real station bus.  This dummy bus must have exactly two branches connected to it, both of which must be members of the same multi-section line grouping.  The status of the line section is that the multi-section line is treated as a single element.  A shunt capacitor or reactor connected to a line but modeled as a shunt within a station will result in power-flow calculations for contingencies that differ from real operating conditions.\n\n\n\nFigure 3. Example one-line of line connected capacitor bank\n\n4.6.2\tSeries Devices\nSeries capacitors and reactors will be modeled as a series branch with the appropriate impedance. If a parallel bypass exists, it should be modeled as a zero impedance branch with the appropriate branch status indicating whether it is normally open or normally closed.\n4.6.3\tStatic Reactive Device Data Source\nData Element\tSource For Existing  Elements\tSource For Planned Elements\nSwitched Shunt: Control Mode\tNMMS\tMOD PMCR/PROFILES\nSwitched Shunt: Voltage Limits\tMOD PROFILES/NMMS\tMOD PMCR/PROFILES\nSwitched Shunt: Controlled Bus\tNMMS\tMOD PMCR/PROFILES\nSwitched Shunt: B init\tMOD PROFILES/NMMS\tMOD PROFILES\nSwitched Shunt: B steps\tNMMS\tMOD PMCR\nFixed Shunt: ID\tNMMS\tMOD PMCR\nFixed Shunt: Status\tNMMS\tMOD PMCR\nFixed Shunt: B-Shunt\tNMMS\tMOD PMCR\nSeries Device\tNMMS\tMOD PMCR"
  },
  {
    "title": "4.7\tDynamic Control Devices",
    "text": "All existing and planned FACTS devices shall be modeled in the SSWG Cases. There are a multitude of FACTS (Flexible AC Transmission System) devices currently available, comprising shunt devices, such as Static VAR Compensator (SVC), Static Compensator (STATCOM), series devices such as the Static Synchronous Series Compensator (SSSC), combined devices such as the Unified Power Flow Controller (UPFC) and the Interline Power Flow Controllers (IPFC). These devices are being studied and installed for their fast and accurate control of the transmission system voltages, currents, impedance and power flow. They are intended to improve power system performance without the need for generator rescheduling or topology changes. These devices are available because of the fast development of power electronic devices.\n\nPSS®E has the capability to model several different FACTS devices and their documentation is the best source for specific applications.\n\nFACT Device – Data SourceData Element\tSource For Existing  Elements\tSource For Planned Elements\nDevice Number\tMOD STD PMCR \tMOD PMCR\nSending Bus Number\tMOD STD PMCR \tMOD PMCR\nTerminal End Bus Number\tMOD STD PMCR \tMOD PMCR\nControl Mode\tMOD PROFILES\tMOD PROFILES\nP Setpoint (MW)\tMOD PROFILES\tMOD PROFILES\nQ Setpoint (Mvar)\tMOD PROFILES\tMOD PROFILES\nV Send Setpoint\tMOD PROFILES\tMOD PROFILES\nShunt Max (MVA)\tMOD STD PMCR \tMOD PMCR\nRMPCT (%)\tMOD STD PMCR \tMOD PMCR\nV Term Max (pu)\tMOD STD PMCR \tMOD PMCR\nV Term Min (pu)\tMOD STD PMCR \tMOD PMCR\nV Series Max (pu)\tMOD STD PMCR \tMOD PMCR\nI Series Max (MVA)\tMOD STD PMCR \tMOD PMCR\nOwner\tMOD STD PMCR \tMOD PMCR\nNOTE: The above list is an example of typical FACTs device parameters and does not include all possible types of FACTs devices."
  },
  {
    "title": "4.8\tHVDC Devices",
    "text": "HVDC Devices allow a specified real power flow to be imposed on the DC link.  For base case operation, this should be set to the desired interchange across the DC tie.  Capacitors, filter banks and reactors should be modeled explicitly and switched in or out of service based on normal DC tie operation.  The HVDC model itself normally calculates reactive power consumption.\n\nHVDC ties with external interconnections may be modeled by the use of either the Two Terminal DC Transmission Line Data or Voltage Source Converter DC Line Data.\n4.8.1\tTwo Terminal DC Transmission Line Data\nConventional HVDC ties should be modeled using Two Terminal DC Transmission Line Data.  The Two Terminal DC Transmission Line Data model represents the HVDC terminal equipment, including any converter transformers, thyristors, and the DC link.  The model will calculate voltages, converter transformer taps, losses, and VA requirements, based upon the power transfer over the HVDC facility, and the terminal AC bus voltages. See PSS®E Manual for more information.\n\n4.8.2\tVoltage Source Converter (VSC) DC Line Data\nVoltage Source Converter DC line data can be used to model DC ties that use the voltage source converter technology. See PSS®E Manual for more information.\n4.8.3\tHVDC Two Terminal Data Source\nData Element\tSource For Existing  Elements\tSource For Planned Elements\nLine number\tMOD STD PMCR & PROFILES\tMOD PMCR & PROFILES\nControlled Mode\tMOD STD PMCR & PROFILES\tMOD PMCR & PROFILES\nLine Resistance (Ohms)\tMOD STD PMCR\tMOD PMCR\nDemand Setting (MW or Amps)\tMOD PROFILES\tMOD PROFILES\nV schedule (kV)\tMOD PROFILES\tMOD PROFILES\nVcmod (kV)\tMOD PROFILES\tMOD PROFILES\nDelti (pu)\tMOD PROFILES\tMOD PROFILES\nDcvmin (kV)\tMOD PROFILES\tMOD PROFILES\nMetered (Rect/Invr)\tMOD STD PMCR\tMOD PMCR"
  },
  {
    "title": "5.2\tContingency Database",
    "text": "The ERCOT contingency database is a compilation of contingency definitions as submitted by the TSPs.  The exchange of information for the contingency database will only be communicated using an Excel spreadsheet with the columns as listed in the table below.  The table identifies the columns which the TSPs and ERCOT are responsible for populating.  ERCOT does not create or manually update the information submitted by the TSPs.  In an effort to produce a contingency list with complete and accurate data, ERCOT will run topology and data entry checks on submitted information to highlight submission errors that the TSPs will need to correct within a given timeline.  A review of the contingency database will be conducted with each SSWG case build.  ERCOT will accept updates to the contingency list outside of this review process as requested by the TSPs.  This section covers the approved format for submitting contingency definitions, the review process, and the validation rules ERCOT will implement to verify submissions.\n\n\nERCOT Contingency Database Columns\n\nColumn Name\tTSP Responsibility\tERCOT Responsibility\tDefault Value\tValidation Rule\nItem\t\t\t\t\tMust be a numeric value\nDatabaseID\t\t\t\t\tMust be an alphanumeric with a 12 character maximum\nTOContingencyID\t\t\t\t\tMay not be null\nContingencyAction\t\t\t\tOpen\tMust be either open or close\nFromBusNumber_i\t\t\t\t0\tMust be a numeric value\nToBusNumber_j\t\t\t\t0\tMust be a numeric value\nToBusNumber_k\t\t\t\t0\tMust be a numeric value\nCircuitID\t\t\t\t\tMust be an alphanumeric with a two character maximum, and must be null if the element identifier for the outage is a bus or switched_shunt\nElementIdentifier\t\t\t\t\tMust be either a bus, transformer, branch, fixed_bus_shunt, switched_shunt or gen\nSubmitter\t\t\t\t\tMust match current submitter name in database\nStartDate\t\t\t\t1/1/2000\tMust be a valid date\nStopDate\t\t\t\t12/31/2099\tMust be a valid date\nDateCreated\t\t\t\t\tMust be a valid date\nUpdatedDate\t\t\t\t\tMust be a valid date\nMulti-SectionLine\t\t\t\tNo\tMust be either yes or no\nNERCCategory\t\t\t\t\tMust be NERC Category, ‘.’, and the type of Event; example P4.3*\nERCOTCategory\t\t\t\t\tMust be N/A, ERCOT_1, ERCOT_NonBES, ERCOT_CCT, ERCOT_98\nBES Level\t\t\t\t\tBulk Electric System (BES) level references include extra-high voltage (EHV) Facilities defined as greater than 300kV and high voltage (HV) Facilities defined as the 300kV and lower voltage Systems.\nTDSPComments\t\t\t\t\tMay be null\nERCOTComment\t\t\t\t\tMay be null\nContingencyName\t\t\t\t\tMust be consistent within a contingency definition\n\n* In addition, the steady state contingencies as described by the NERC TPL-001-5.1 Table 1, consist of definitions which may have multiple category classifications.  In this case, each category must be separated by a ‘/’.\nThe procedure to update the contingency database is as follows: ERCOT will send out the current contingency list to SSWG members with invalid entries highlighted.\n1.\tTSPs will submit a complete list of contingency definitions with the necessary changes and additions within an agreed upon timeline and format for ERCOT to import into the existing database.\n2.\tUpon import, ERCOT will overwrite the previous list of definitions submitted by the TSP.\n3.\tERCOT will verify that the changes were imported into the database and provide the TSPs with a change log which will list the contingency definitions that were updated, deleted or created.\n4.\tSteps 1 to 4 will be repeated for each pass of the contingency update process.\n5.\tWhen the contingency list is finalized, ERCOT will post the list on the MIS website along with the contingency files created for use with MUST, PSS®E, PowerWorld, UPLAN and VSAT.  Definitions which are flagged as being invalid will NOT be included in the contingency file.\n6.\tThe planning or extreme event rationale will be provided in supporting documentation from TSPs upon request.\n\nA TSP may only submit changes for their company and rows with null values in either the Submitter or TOContingencyID columns will be ignored.  The default value listed in the table will be used upon import if the provided value is either invalid or missing.  Topology and data entry checks will be completed on the imported rows to highlight invalid contingency definitions.\n\nERCOT will utilize the latest available SSWG Cases to verify that the devices listed in the contingency definition exist in the SSWG Cases.  Additional columns will be added to the spreadsheet which will correspond to the filename of the SSWG Case used to validate the submissions.  The start and stop dates of the contingency definitions will be used to determine which SSWG Cases they need to be compared against.  Any inconsistencies between the case and contingency definition will be communicated in these columns.  A contingency definition will be highlighted as invalid and an error message will be printed if it fails any of the following data entry or topology checks.\n\nNERC contingencies not covered by automatic contingency processing capabilities of the various power-flow applications, which the TSP deems to have an impact on the power-flow solution, shall be submitted.\n\nNERC contingencies must either be submitted in entirety by each TSP or as a minimum, those planning event and extreme event NERC contingency categories that would produce the more severe system results or impacts. The rationale for the contingencies selected for evaluation shall be available as supporting information upon request.\n\nIn addition to the aforementioned NERC defined contingencies, TSPs shall also submit:\n•\tA common tower outage as defined in Section 4.1.1.1 of the ERCOT Planning Guides.  These contingency scenarios will be categorized in the ERCOT contingency database as ERCOT_1.\n•\tA common tower outage as defined in Section 4.1.1.1 of the ERCOT Planning Guides where both circuits must be taken out of servce for a maintenance outage. These contingency scenarios will be categorized in the ERCOT contingency database as ERCOT_98.\n•\tSingle and multiple element contingencies, not covered by automatic contingency processing capabilities of the various power-flow applications and not fitting the definition of ERCOT_1, for transmission facilities between 60 kV and 100 kV that produce the most severe system results or impacts.  These will be categorized in the ERCOT contingency database as ERCOT_NonBES.\n\nERCOT shall submit:\n•\tLoss of an entire combined cycle plant are to be categorized as ERCOT_CCT.\n\nContingency definitions shall take into account the effects of existing and planned protection systems, including any backup or redundant systems.\n\n\nGeneral Data Entry Checks\n\nError Message\tReason for Failing Data Validation\nDuplicate\tThe device is listed more than once in the contingency definition.\nNeeds Consistent Name\tFor each unique TOContingencyID, only one ContingencyName can be used.\nInvalid Date Selection\tEither the start and/or stop dates for a single contingency definition are inconsistent or the start date occurs after the stop date.  In the case where a single contingency definition has inconsistent start dates, use the one that occurs furthest in the future since the contingency definition will not be valid until all devices listed in the contingency are present in the base case.  The start date is used to determine when the contingency definition becomes valid—it is not the energization date for the device listed on that row.\nInvalid Bus Selection\tThe same bus number is used twice in the same row, or a needed bus number is missing.\nInvalid Element Identifier\tElement Identifier is invalid. The only acceptable values are Bus, Branch, Gen, Transformer, Fixed_Bus_Shunt, or Switched_Shunt\nNERC Category Missing\tThe new NERC Category is missing.  The only acceptable values are ‘NERC Category’‘.’‘Event’ defined in TPL-001 Table 1.  Multiple Category contingencies are must be separated by ‘/’.  For example: P2.2/P4.3/P5.2\nERCOT Category Missing\tThe ERCOT Category is missing.  The only acceptable values are ERCOT_1, ERCOT_NonBES, ERCOT_CCT, ERCOT_98, or N/A.\n\nTopology Checks\n\nError Message\tReason for Failing Data Validation\nFromBus_i Missing, ToBus_j Missing, ToBus_k Missing\tA bus with the corresponding bus number cannot be found in the base case.\nBranch Missing\tA branch with the submitted combination of bus numbers and circuit ID cannot be found in the base case.\nSystem Switching Device Missing\tA system switching device with the submitted combination of bus numbers and circuit ID cannot be found in the base case.\nTransformer Missing\tA transformer with the submitted combination of bus numbers and circuit ID cannot be found in the base case.\nGenerator Missing\tA generator with the submitted combination of bus numbers and circuit ID cannot be found in the base case.\nShunt Missing\tA shunt with the submitted combination of bus numbers and circuit ID cannot be found in the base case."
  },
  {
    "title": "5.3\tReview of NMMS and Topology Processor Compatibility with PSS®E",
    "text": "From time to time, updated versions of PSS®E may require modifications to the methods of extracting necessary power-flow data from NMMS.  For every PSS®E version change, the following evaluation process shall be followed:\n\n1.\tUse PSS®E documentation such as release notes and compatibility references to identify new fields and record formats added to a new version of PSS®E.\n2.\tSSWG determines which, if any, of the new fields or records need to be implemented in NMMS and Topology Processor.\na.\tDetermine how to use MOD to implement most needed fields immediately\n3.\tERCOT determines approximate implementation method, initial impact analysis and cost of implementation for each new field and/or record determined by the SSWG to be necessary for implementation.\na.\tDetermine method to arbitrate disagreement on proposed recommendation\n4.\tPresent to ROS new fields and/or records that have been jointly determined to be needed, with approximate implementation method, initial impact analysis and cost of implementation.\n5.\tUpon ROS approval, prepare Project initiation to create and add projects to PPL.\n6.\tUpon addition to PPL above cut line, prepare requirements documents to describe data type addition/changes to NMMS and Topology Processor output desired for example input."
  },
  {
    "title": "5.4\tPlanning Data Dictionary",
    "text": "The Planning Data Dictionary is used by ERCOT to show correlation between SSWG Case bus numbers and TSP area SCADA names.  Additionally, the Planning Data Dictionary without the SCADA names is included as part of ERCOT’s FERC 715 filing.\n\nThe exchange of information for the Planning Data Dictionary will only be communicated using an Excel spreadsheet with the columns as listed in the table below.  The table identifies the columns which the TSPs and ERCOT are responsible for populating.  ERCOT does not create or manually update the information submitted by the TSPs.  The Planning Data Dictionary will be updated with each SSWG Case build.\n\nThe format will be as follows (see next page):\n\nColumn Name\tTSP Responsibility\tERCOT Responsibility\tDescription\nTSP\t\t\t\tShortened version of SSWG Area\nSSWG BUS NUMBER\t\t\t\tExtracted from the SSWG Steady State Cases\nSSWG BUS DATE IN\t\t\t\tFrom the SSWG Steady State Cases, this is populated by searching for the earliest SSWG Steady State Case that the bus exists.  If the bus exists throughout all of the existing Steady State Cases, the field is left blank under the assumption that it already exists in the NMMS.\nSSWG BUS DATE OUT\t\t\tFrom the SSWG Steady State Cases, this is populated by searching for the latest SSWG Steady State Case that the bus exists.  If the bus exists throughout all of the existing SSWG Steady State Cases, the field is left blank under the assumption that it exists beyond the current planning scope.\nSSWG BUS NAME\t\t\tThis is required by FERC for FERC 715 pt. 2 report and is extracted from the SSWG Steady State Cases.\nSSWG BASE KV\t\t\tThis is required by FERC for FERC 715 pt. 2 report and is extracted from the SSWG Steady State Cases\nSSWG BUS TYPE\t\t\tExtracted from the SSWG Steady State Cases\nSSWG AREA\t\t\tExtracted from the SSWG Steady State Cases\nNMMS BUS NUMBER\t\t\tExtracted from NMMS\nNMMS BUS NAME\t\t\tExtracted from NMMS\nNMMS STATION CODE\t\t\tExtracted from NMMS\nNMMS STATION NAME\t\t\tExtracted from NMMS\nNMMS BASE KV\t\t\tExtracted from NMMS\nNMMS TSP\t\t\t\tExtracted from NMMS\nNMMS WEATHER ZONE\t\t\t\tExtracted from NMMS.  Field is populated via mapping sheet for future buses and are italicized.\nNMMS SETTLEMENT ZONE\t\t\tExtracted from NMMS.  Field is populated via mapping sheet for future buses and are italicized.\nEIA CODE\t\t\tEIA Codes for bus within Stations associated with a generating unit.  This is required for the FERC 715 pt. 2 report.\nPLANNING BUS LONG NAME\t\t\t\tThe Planning Bus Long Name is provided by the TSP\n(“Substation Name or Switchyard Name’)\nPLANNING BUS COUNTY\t\t\t\tThe Planning Bus County is provided by the TSP\nTSP COMMENTS\t\t\t\tSection for TSP to provide comments on individual buses.\nERCOT COMMENTS\t\t\tInformation for changes of bus properties throughout all SSWG Steady State Cases.  This information will point to changes in SSWG BUS NAME, SSWG BASE KV and SSWG BUS TYPE."
  },
  {
    "title": "6\tAPPENDICES",
    "text": "Appendix A\nBus/Substation/Zone Range, FACTS Device Range, and Zone Description Tables\n\nBUS & SUBSTATION RANGE\tDSP, OTHER ENTITY, or SUBSYSTEM\tACRONYM\tMODELING ENTITY\tPSS®E AREA NO\tZONE RANGE\n\n1 - 799\tBRAZOS ELECTRIC POWER COOPERATIVE\tTBREC\tTBREC\t11\t11,13-73\n33000 - 36999\n800 - 899\tGARLAND, CITY OF\tTGAR\tTGAR\t20\t4\n900 - 934\tDENTON MUNICIPAL UTILITIES, CITY OF\tTDME\tTDME\t19\t3\n59000 - 59049\n935 - 955\tGREENVILLE ELECTRIC UTILITY SYSTEM\tTGEUS\tTGEUS\t21\t5\n956 - 999\tTEXAS MUNICIPAL POWER AGENCY\tTTMPA\tTTMPA\t12\t6\n9500 - 9699\n1000 - 4999\tONCOR\tTONCOR\tTONCOR\t1\t100 - 175\n10000 - 31999\n5000 - 5499\tCPS ENERGY \tTCPSE\tTCPSE\t5\t350 - 370\n50000 - 54999\n\n5500 - 5899\tSOUTH TEXAS ELECTRIC COOPERATIVE\tTSTEC\tTSTEC\t13\t870 - 890\n55000 - 58999\nIn  TSTEC\tSAN BERNARD ELECTRIC COOPERATIVE\tTSBEC\tTSTEC\n5910 - 5919\tSOUTH TEXAS POWER PLANT\tTCNPE\tTCNPE\t10\t310\n5920 - 5929\tEAST HIGH VOLTAGE DC TIE\t \tTAEPTC\t16\t200\n5930 - 5989\tPUBLIC UTILITY BOARD OF BROWNSVILLE\tTBPUB\tTBPUB\t15\t800\n59300 - 59899\n6000 - 6699\tAMERICAN ELECTRIC POWER- TNC\tTAEPTN\tTAEPTN\t6\t402 - 479\n60000 - 67999\n69000 - 69999\nIn TAEPTN\tCOLEMAN COUNTY ELECTRIC COOP\tTCOLMN\tTGSEC\t25\t181\nIn TAEPTN\tCONCHO VALLEY ELECTRIC COOPERATIVE\tTCVEC2\tTGSEC\t25\t182\nIn TAEPTN\tLIGHTHOUSE ELECTRIC COOPERATIVE\tTLHEC\tTGSEC\t25\t183\nIn TAEPTN\tRIO GRANDE ELECTRIC COOPERATIVE\tTRGEC1\tAEPTN\nIn TAEPTN\tSOUTHWEST TEXAS ELECTRIC COOPERATIVE\tTSWEC1\tTGSEC\t25\t185\nIn TAEPTN\tTAYLOR ELECTRIC COOPERATIVE\tTECX\tTGSEC\t25\t186\n6096 - 6096\tNORTH HIGH VOLTAGE DC\t \tAEPTN\t14\t394\n6700 - 6749\tEAST TEXAS ELECTRIC COOPERATIVE\tXETEC\tETECTSP \t3\t177\n6750 - 6765\tLAMAR ELECTRIC COOPERATIVE\tTLAHOU\tTLAMAR\t32\t187\n6790 – 6999\tRAYBURN COUNTRY ELECTRIC COOPERATIVE\tTRAYBN\tTRAYBN\t2\t178\n7900 - 7999\nIn TRAYBN\tGRAYSON COUNTY ELECTRIC COOPERATIVE\tTGEC\tTRAYBN\t2\t178\nIn TRAYBN\tFARMERS ELECTRIC COOPERATIVE\tTFECE\tTRAYBN\t2\t178\nIn TRAYBN\tTRINITY VALLEY ELECTRIC COOPERATIVE\tTTRINY\tTRAYBN\t2\t178\nIn TRAYBN\tFANNIN COUNTY ELECTRIC COOPERATIVE\tTFCEC\tTRAYBN\t2\t178\n7000 – 7899\tLCRA TRANSMISSION SERVICES CORPORATION\tTLCRA\tTLCRA\t7\t500 - 589\n71000 - 78999\nIn  TLCRA\tBANDERA ELECTRIC COOPERATIVE\tTBDEC\tTLCRA\nIn  TLCRA\tBLUEBONNET ELECTRIC COOPERATIVE\tTBBEC\tTLCRA\nIn  TLCRA\tCENTRAL TEXAS ELECTRIC COOPERATIVE\tTCTEC\tTLCRA\nIn  TLCRA\tGUADALUPE VALLEY ELECTRIC COOPERATIVE\tTGVEC\tTLCRA\nIn  TLCRA\tNEW BRAUNFELS UTILITIES\tTNBRUT\tTLCRA\n8000 – 8999\tAMERICAN ELECTRIC POWER - TCC\tTAEPTC\tTAEPTC\t8\t610 - 662\n80000 - 89999\nIn TAEPTC\tLA COMISIÓN FEDERAL DE ELECTRICIDAD\tCFE\tTAEPTC\t24\t612\nIn TAEPTC\tRIO GRANDE ELECTRIC COOPERATIVE\tTRGEC2\tTRGEC2\n9000 – 9399\tAUSTIN ENERGY\tTAEN\tTAEN\t9\t691 - 712\n90000 - 93999\n9400 - 9490\tGOLDENSPREAD ELECTRIC COOP\tTGSEC\tTGSEC\t25\t179 - 186\n9491 - 9499\tGOLDSMITH, CITY OF\tTGOLDS\tTGOLDS\t26\t190\n9700 – 9999\tELECTRIC RELIABILITY COUNCIL OF TEXAS\tTERCOT\tTERCOT\t900 - 999\t900 - 1199\n94000 – 99999\n100000 - 199999\n600000 - 699999\n700000 - 799999\n32000 - 32049\tCOLLEGE STATION, CITY OF\tTCOLGS\tTCOLGS\t23\t199\n32050 - 32999\tBRYAN, CITY OF\tTBTU\tTBTU\t22\t2\n37000 - 39999\tTEXAS NEW MEXICO POWER COMPANY\tTTNMP\tTTNMP\t17\t220 - 240\n40000 - 49999\tCENTERPOINT\tTCNPE\tTCNPE\t4\t260 - 320\n59100 - 59199\tLUBBOCK POWER & LIGHT\tTLPL\tTLPL\t31\t12\n59900 - 59999\tWIND ENERGY TRANSMISSION TEXAS\tWETT\tWETT\t29\t590 - 609\n68000 - 68999\tLONE STAR TRANSMISSION\tTLSTR\tTLSTR\t27\t670 - 689\n70000 - 70999\tPEDERNALES ELECTRIC COOPERATIVE\tTPDEC0\tTPDEC0\t33\t241-250\n79000 - 79499\tCROSS TEXAS TRANSMISSION\tTCROS\tTCROS\t30\t790 - 799\n79500 - 79699\tSHARYLAND\tTSLND1\tTSLND1\t18\t820 - 829\n79700 - 79999\tTRI-COUNTY ELECTRIC COOPERATIVE\t \t \t28\t2000+\n5900 - 5909\tUNASSIGNED\t \t \t1200\n5990 - 5999\n6766 - 6789\n7900 - 7999\n59000 - 59099\n200000 - 599999\n800000 - 999999\n\n\n\nFACTS Device ID Range Table\n\nFACTS Device ID#\t Ownership claimed by TSP\n4 - 18 \tAmerican Electric Power\n1 - 3\tAustin Energy\n19\n20 - 30\tONCOR\n30 - 34\n35 - 39\tTexas New Mexico Power\n40 - 50\tCenterpoint Energy\n\n\nDescription of Zones in the SSWG Cases\nThe following table provides a description of the zones.  Zone numbers and zone names are subject to change.\n\nZone #\tZone Name\tZone Description"
  },
  {
    "title": "3.1\tGeneral\t7",
    "text": "3.1.1\tSoftware\t7\n3.1.2\tDynamic Models – General\t7\n3.1.3\tStandard Dynamic Models\t8\n3.1.4\tUser-Written Dynamic Models\t8\n3.1.5\tDynamic Model Quality Test Guideline\t9\n3.1.6\tUnit Model Validation\t29\n3.1.7\tMaintenance of Dynamic Models\t31\n3.1.8\tDynamic Data for Existing Equipment\t31\n3.1.9\tDynamic Data for Planned Equipment\t31\n3.1.10\tUnacceptable Dynamic Models\t31"
  },
  {
    "title": "3.2\tDynamic Data for Equipment Owned by Resource Entities (REs)\t32",
    "text": "3.2.1\tDynamic Data Requirements for New Equipment\t32\n3.2.2\tUpdates to Existing Dynamic Data\t34"
  },
  {
    "title": "3.4\tDynamic Data for Equipment Owned by Transmission Service Providers (TSPs) or Other Equipment Owners\t34",
    "text": "3.4.1\tUnder Frequency Firm Load Shedding (UFLS) Relay Data\t34\n3.4.2\tUnder Voltage Load Shedding (UVLS) Relay Data\t35\n3.4.3\tProtective Relay Data\t36\n3.4.4\tLoad Model Data\t36\n3.4.5\tOther Types of Dynamic Data\t37\n3.4.6\tMissing or Problematic Dynamics Data\t37\n3.4.7\tDynamic Data and Stability Book Storage\t38"
  },
  {
    "title": "3.5\tDynamic Models for Distributed Generation\t38",
    "text": "3.5.1 Distribution Generation Resource (DGR) and Distribution Energy Storage Resource (DESR)\t38\n3.5.2 Settlement Only Distribution Generator (SODG)\t38\n3.5.3 Unregistered Distributed Generation (UDG)\t39"
  },
  {
    "title": "4.1\tUpdating Dynamic Data and Flat Starts\t40",
    "text": "4.1.1\tSchedule for Dynamic Data Updates and Flat Start Cases\t40\n4.1.2\tDynamic Data Updates\t41\n4.1.3\tDynamic Data Screening\t41\n4.1.4\tFlat Start Criteria\t41"
  },
  {
    "title": "4.2\tPost Flat Start Activities\t42",
    "text": "4.2.1\tDistribution of Flat Start Results and the Dynamic Data Base\t42\n4.2.2\tStability Book\t42\n4.2.3\tDWG Coordination with the Steady State Working Group\t42\n4.2.4\tDWG Dynamic Contingency Assumptions List\t43\n4.2.5\tDWG Dynamic Contingency Database\t43"
  },
  {
    "title": "4.3\tOther DWG Activities\t44",
    "text": "4.3.1\tEvent Simulation\t44\n4.3.2\tProcedure Manual Revision Guidelines\t44"
  },
  {
    "title": "",
    "text": "ERCOT STEADY STATE WORKING GROUP\nPROCEDURE MANUAL\n\n\n\nROS Approved: July 11, 2024\n\nTable of Contents"
  },
  {
    "title": "1.1\tERCOT Steady-State Working Group Scope",
    "text": "The ERCOT Steady-State Working Group (SSWG) operates under the direction of the Reliability and Operations Subcommittee. The SSWG is a non-voting working group whose members include representatives from ERCOT Transmission Service Providers (TSPs) and ERCOT staff. The main objective of SSWG is to produce steady state seasonal and future steady-state base cases, and GIC system models. The SSWG meets twice a year to accomplish these tasks, and at other times during the year as needed to resolve any impending power-flow modeling issues or to provide technical support to the ROS. The SSWG responsibilities are further described as follows:\n•\tDevelop a set of SSWG Cases annually.\n\n•\tUpdate the SSWG Cases on a biannual basis.\n\n•\tMaintain and update the Transmission Project Information Tracking (TPIT) report, which reflects data used for SSWG Case development and updates. Update the TPIT report on a triannual basis.\n\n•\tMaintain and update the Planning Data Dictionary to reflect current and future year bus and county information.\n\n•\tReview and update, as necessary (at least every five years), the SSWG Procedural Manual to reflect current planning practices and the latest steady-state modeling methodologies.\n\n•\tPrepare data for and review seasonal transmission loss factor calculations by January 1st of each year.\n\n•\tDevelop steady state and geomagnetic disturbance model processes for compliance with NERC Reliability Standards for Transmission Planner and Planning Authority/Coordinator.\n\n•\tCoordinate tie-line modeling data with adjacent Transmission Planners via the case-building process.\n\n•\tReview and update the contingency definition files used for planning.\n\n•\tAddress issues as directed by the ROS.\n\n•\tAnnually review status of the Network Model Management System (NMMS) and Topology Processor software regarding new planning data needs.\n\n•\tDevelop GIC system models every 5 years in compliance with NERC TPL-007.\n\n•\tMaintain GIC data in alignment with SSWG cases.\n\n•\tCommunicate information related to updates to the GIC system models during model builds via the GIC listserv.\n\n•\tReview and update the GIC Procedure Manual (at least every five years)."
  },
  {
    "title": "2\tDEFINITIONS AND ACRONYMS",
    "text": "In the event of a conflict between any definitions or acronyms included in this manual and any definitions or acronyms established in the ERCOT Nodal Protocols and Planning Guide, the definitions and acronyms established in the ERCOT Nodal Protocols and Planning Guide take precedence."
  },
  {
    "title": "2.2\tAcronyms",
    "text": "ALDR\tAnnual Load Data Request\n\n\nCLR\tControllable Load Resource\n\nCMP\tConstraint Management Plan\n\nDER\tDistributed Energy Resources\n\nDESR\tDistribution Energy Storage Resource\n\nDGR\tDistribution Generation Resource\n\nDSP\tDistribution Service Provider\n\nEPS\tERCOT Polled Settlement (metering)\n\nERCOT\tElectric Reliability Council of Texas\n\nFERC\tFederal Energy Regulatory Commission\n\nGINR\tGeneration Interconnection Request number\n\nHRML\tHigh Renewable/Minimum Load\n\nIMM\tInformation Model Manager\n\nLFL\tLarge Flexible Load\n\nLSE\tLoad Serving Entity\n\nMLSE\tMost Limiting Series Element\n\nMOD\tModel on Demand\n\nNCLR\tNon-Controllable Load Resource\n\nNDCRC\tNet Dependable Capability and Reactive Capability\n\nNERC\tNorth American Electric Reliability Corporation\n\nNMMS\tNetwork Model Management System\n\nNOIE\tNon Opt In Entity\n\nNOMCR\tNetwork Operations Model Change Request\n\nOSR                            Owner’s Share Ratings\n\nPLWG\tPlanning Working Group\n\nPMCR\tPlanning Model Change Request\n\nPPL\tProject Priority List\n\nPSS®E\tPower System Simulator for Engineering\n\nPUN\tPrivate Use Network\n\nPOI\tPoint of Interconnection\n\nRAWD\tPSS®E Raw Data format\n\nRAS\tRemedial Action SchemeRE\tResource Entity\n\nROS\tReliability and Operating Subcommittee\n\nSCADA\tSupervisory Control And Data Acquisition\n\nSCR\tSystem Change Request\n\nSODG\tSettlement Only Distribution Generator\n\nSS\tSteady State Cases\n\nSSWG\tSteady-State Working Group\n\nTPIT\tTransmission Project Information Tracking\n\nTSP \tTransmission Service Provider\n\nTO\tTransmission Owner\n\nUDG\tUnregistered Distributed Generation\n\nWGR\tWind Generation Resource\n\nWMWG\tWholesale Market Working Group"
  },
  {
    "title": "3.1\tGeneral",
    "text": "The SSWG and ERCOT create the SSWG Cases annually and update them biannually at fixed intervals throughout each year.  This section describes the creation and update process and schedule to create and update SSWG Cases ."
  },
  {
    "title": "4.3\tGenerator Data",
    "text": "4.3.1\tAcquisition of Generator Data\n4.3.1.1\tGeneration that meets Planning Guide 6.9(1)\nERCOT will utilize the latest data provided by the IEs/REs in the Security Screening Study, or Full Interconnection Study if started, to model the Resource using the simple model.\n\nUnit Reactive Limits should be modeled at a 95% power factor of the PMAX.  Generator ID prefixes will be designated as specified in Appendix D.\n\nEach simple modeled generator will be modeled in the following Zone:\n\nZone Number\tZone Name"
  },
  {
    "title": "4.9\tModeling of Resource and Transmission Outages",
    "text": "TSPs are responsible for entering known outages of equipment for which they are the modeling entity as normally open equipment in the applicable SSWG Case(s) in accordance with the accepted technical rationale.  ERCOT is responsible for submitting outages for resource and resource owned equipment using the Outage Scheduler to determine outages with duration of at least six months and will model the status in the applicable SSWG Case(s) in accordance with its transmission in-service date."
  },
  {
    "title": "5.1\tTransmission Loss Factor Calculations",
    "text": "The transmission loss factors must be calculated according to Protocol Section 13. The loss factors are calculated using the seasonal SSWG Cases. The values are entered in the ERCOT settlements system to account for losses on the transmission system. Separate calculations are performed for the eight seasonal SSWG Cases: spring, summer, fall, and winter with an on and off peak for each season.\n\nThe Non Opt In Entities (NOIE) that provide metering of their system load to the ERCOT settlement system by a set of ERCOT Polled Settlements Meters (EPS) that ‘ring’ their transmission system as defined in Protocol 13.4.1 have additional calculations performed for their transmission loss factors.\n\nThe NOIE that send extra data to ERCOT for the loss calculations have EPS settlement meters on all of their transmission lines that connect or “tie” their system to the rest of the ERCOT transmission network. For the ERCOT settlement process ERCOT calculates their load as the net of inflows minus the outflows from these EPS meters. However calculations must be performed to subtract out the losses on the transmission lines that are ‘inside’ their EPS meters. If this was not done then these NOIE loads would be too high relative to the other loads where EPS meters are at each delivery point. Other NOIE send EPS metering data from each delivery point so their load can be calculated by summing the individual points. Therefore the extra calculations are not necessary.\n\nThe process for creating the loss factors is outlined below.\n\n1.\tSend out a request to SSWG for any case updates, changes to NOIE bus ranges, and latest self serve data. NOIE’s that have a ‘ring’ of EPS meters must validate the PSS®E Metered End data in each of the cases. The PSS®E Metered End for a transmission facility that is not inside the ‘ring’ of EPS meters should be Metered ‘to’ the remote bus, and not Metered ‘to’ bus where the EPS meter is located.\n2.\tERCOT updates the transmission loss factor spreadsheet.\n3.\tSend to SSWG for review and approval\n4.\tSend to ERCOT settlements (Settlement Metering Manager) to be put into the ERCOT settlement system and post at http://www.ercot.com/mktinfo/data_agg/index.html."
  },
  {
    "title": "2253\tZavala County\tZavala County For all TSP Use",
    "text": "Appendix B\nMethodology for Calculating Wind Generation levels in the SSWG Cases\n\nGoal – Use available forecast data to set the dispatch for wind generation in the new SSWG Cases.\n\nSection 3.2.6.2.2 of the Nodal Procotols\n\nWINDPEAKPCT s, r\t%\tSeasonal Peak Average Wind Capacity as a Percent of Installed Capacity—The average wind capacity available for the summer and winter Peak Load Seasons s and region r, divided by the installed capacity for region r, expressed as a percentage. The Seasonal Peak Average, derived from Settlement data, is first calculated as the average capacity during the 20 highest system-wide peak Load hours for a given year’s summer and winter Peak Load Seasons. The final value is the average of the previous ten eligible years of Seasonal Peak Average values. Eligible years include 2009 through the most recent year for which COP data is available for the summer and winter Peak Load Seasons.  If the number of eligible years is less than ten, the average shall be based on the number of eligible years available.  This calculation is limited to WGRs that have been in operation as of January 1 for each year of the period used for the calculation.\nWINDCAP s, i, r\tMW\tExisting WGR Capacity—The capacity available for all existing WGRs for the summer and winter Peak Load Seasons s, year i, and region r, multiplied by WINDPEAKPCT for summer and winter Peak Load Seasons s and region r.\n\n\n\n\nAppendix C\nMexico’s Transmission System in ERCOT SSWG Cases\n\nThis appendix provides an explanation of the modeling that represents Mexico’s Comisión Federal de Electridad (CFE) system in SSWG cases. A drawing of the system is at the end of this appendix.  All AEP and CFE facilities (bus, lines, etc.) tied to the CFE grid will be assigned to area 24 and zone 612.  The AEP facilities will retain the owner 9 and CFE will be assigned owner 300.\n\nThe following generation modeled in the power flow and short circuit cases are system equivalents of the CFE system and are located in Mexico. These units are not in ERCOT and should only be used for specialized studies. These units should not be included when performing transfer studies in ERCOT unless one is studying a transfer to or from CFE. The generation capability is not counted in ERCOT reports. These units are online in the cases to offset the real and reactive losses that are caused by the other CFE transmission facilities and reactive flow across the Laredo VFT and Railroad HVDC ties that are modeled in the SSWG cases.  Lines in CFE will not be included in the ERCOT contingency list.\n\nGeneration Station Name\tBus Number\tBus Voltage\nCIDINDUS-138 (System Equivalent)\t86104\t138kV\nCIDINDUS-230 (Swing Bus/Equivalent)\t86105\t230kV\nCUF-230 (System Equivalent)\t86106\t230kV\nCUF-138 (System Equivalent)\t86107\t138kV\n\nThe following are the transmission lines between Mexico and the United States.  All of the tie lines between CFE and ERCOT are operated normally open with the exception of the asynchronous ties at Laredo and Railroad.\n\nMexico\tUnited States\nBus Name\tBus Number\tBus Voltage\tBus Name\tBus Number\tBus Voltage\nFalcon\t86111\t138\tFalcon\t8395\t138\nPiedras Negras\t86110\t138\tLaredo VFT\t80168\t230\nCiudad Industrial\t86105\t230\tLaredo VFT\t80169\t138\nCiudad Industrial\t86104\t138\tRailroad\t79604\t138\nCumbres\t86107\t138\tFrontera\t86114\t138\nCumbres\t86107\t138\tMilitary Highway\t8339\t138\nMatamoras\t86112\t138\tBrownsville Switching Station\t8332\t69\nMatamoras\t86113\t69\n\n\n\n\n\nAsynchronous Ties\n\nLaredo\n\nThe Variable Frequency Transformer (VFT) in Laredo has a detailed model at busses 80170 (ERCOT Side), 80014 (ERCOT Side), 80169 (CFE Side), and 80165 (CFE Side) with a total transfer capability of 100 MW.  The VFT is tied to the CFE system by a 12.73 mile 230 kV transmission line and a 12.39 mile normally open 138 kV transmission line.  Both lines terminate at the CFE Ciudad Industrial Substation (86103 and 86104) and are breakered at each end.  There is also a normally open 138 kV transmission line between the Laredo Power Plant (8293) and the Laredo VFT (80169) that is utilized for emergency block load transfers between ERCOT and CFE.  The Laredo Power Plant to Laredo VFT 138 kV transmission line is breakered at both ends.\n\nRailroad\n\nThe HVDC tie in Mission has a detailed model at busses 79604 (ERCOT Side) and 88254 (CFE Side) with a total transfer capability of 300 MW.  The Railroad HVDC is tied to the CFE system at Cumbres (86107) by an 11.79 mile 138 kV transmission line and is breakered at each end.  There is also a normally open bus tie that by-passes the HVDC that is utilized for emergency block load transfers between ERCOT and CFE.  The by-pass is breakered at both ends.\n\n\nNormally Open Block Load Ties\n\nBrownsville Switching Station\n\nThe Brownsville Switching Station (8332) is connected to the CFE Matamoras Substation (86113) by a 1.9 mile 69 kV transmission line and is breakered at each end.  The transmission line is operated normally open and is utilized for emergency block load transfers between ERCOT and CFE.\n\nMilitary Highway\n\nThe Military Highway Substation (8339) is connected to the CFE Matamoras Substation (86112) by a 1.44 mile 138 kV transmission line and is breakered at each end.  The transmission line is operated normally open and is utilized for emergency block load transfers between ERCOT and CFE.\n\nFrontera\n\nThe Frontera Power Plant (86114) is connected to the CFE Cumbres Substation (86107) by a 138 kV transmission line.  This transmission line is privately owned and operated by the owners of the Frontera Power Plant and is utilized to move the generation at Frontera Power Plant between the ERCOT and CFE systems.\n\nFalcon\n\nThe Falcon Substation (8395) is connected to the CFE Falcon Substation (86111) by a .3034 mile 138 kV transmission line and is breakered at each end.  The transmission line is operated normally open and is utilized for emergency block load transfers between ERCOT and CFE.\n\n\n\nNormally Open Block Load Ties on Distribution\n\nThere are three normally open ties with CFE that are on the 12.47 kV distribution systems. These ties are at Amistad, Presido and Redford. These ties are only used for emergency block load transfers. Since SSWG does not model radial distribution systems these points are not in the SSWG power flow cases.\n\n\nAppendix D\nGeneration Unit ID Prefixes\n\nThis appendix provides an explanation of the Generator ID prefixes that correspond to modeling in the SSWG Cases.\nTypes of Generation Unit\tUnit ID Prefix\tUnit ID\tComment\tExplanation\n\nSolar\tS\tS1\tTwo units connected to same bus\nAny type of solar technology\nS2\n\nCoal and Lignite\tL\tL1\tThree units connected to same bus\n\nAny type of thermal power plant\nL2\nL3\n\nNatural Gas except Combined Cycle\tN\tN1\tTwo units connected to same bus & 1 unit connected to another bus\n\nAny type of gas unit\nN2\nN1\n\nCombined Cycle\tC\tC1\t \tAny type of combined cycle plant. Self Serve and Self Serve Economic Units will not be represented by this Unit ID prefix\nC2\nC3\nC0\tIt’s always C0 for steam units\n\nWind\tW\tW1\t \tAny type of wind generation\nW2\nW3\nW4\nW5\nW6\nW7\n\nNuclear\tU\tU1\t \tAll nuclear types\nU2\nU3\n\nRenewables\tR\tR1\t \tAll other renewable generation except solar, wind & hydro\nR2\n\nHydro\tH\tH1\t \tHydro\nH2\nH3\nH4\nH5\nH6\n\nOil Fired\tO\tO1\t \tAny type of oil generation\nO2\nO3\nO4\nO5\nO6\nO7\n\nFACTS Device\tF\tF1\t \tAll FACTS devices\nF2\nV\tV1\nV2\n\nEquivalents\tEQ\tEQ\t \tEquivalent units in Mexico and SPP\n\nSelf-Serve\tP1\tP1\tTwo units connected to same bus \tSelf Serve units\nP2\nP1\tOnly one unit\n\nSelf-Serve Economic Units\tPE\tPE\t \tSelf Serve Economic Units\n\nBlack Start Units\tBS\tBS\t \tBlack Start Units\n\nBattery Units\tB\tB1\tTwo units connected to same bus\tAll battery units\nB2\nB1\tOnly one unit\n\nBlock Load Transfer Model\tBL\tBL\t \tModeling equivalent block load transfer\n\nSynchronous Condenser\tSC\tSC\t\tSynchronous Condenser\n\nSettlement Only Distributed Generation \tJ\tJB\tBattery\tSODG unit IDs by resource type\n\n\nJS\tSolar\nJN\tNatural Gas\nJD\tDiesel\nJW\tWind\nJG\tLandfill Gas\nJH\tHydro\nJI\tOther Inverter-Based Resource\nJO\tOther Synchronous Generation\n\n\nAppendix E\n\nLoad ID Prefixes\n\nThis appendix provides an explanation of selected Load ID prefixes with specific meaning that correspond to modeling in the SSWG Cases.\n\nTypes of Loads\tLoad ID Prefix\tLoad ID\tComment\tExplanation\n\nCity Loads\tE\tE1\tTwo loads connected to same bus \tLoads for which a TSP has historically submitted data but no longer accepts responsibility.\nE2\n\nSelf-Serve Loads\tS\tS1\tTwo loads connected to same bus \tSelf-Serve units\nS2\nSS\tOnly one unit\n\nCo-Located Large Loads\tU\tU#\t\tLoads 75 MW or greater, that are going or have gone through the LLI process, co-located with generation facilities and registered as either CLR or NCLR.\nCo-Located Large Loads\tV\tV#\t\tLoads 75 MW or greater, that are going or have gone through the LLI process co-located with generation facilities and not registered as either CLR or NCLR.\n\nLarge Transmission Loads\tX\tX#\t\tLoads 75 MW or greater, that are going or have gone through the LLI process, connected to Transmission and registered as either CLR or NCLR.\nLarge Transmission Loads\tY\tY#\t\tLoads 75 MW or greater, that are going or have gone through the LLI process, connected to Transmission and not registered as either CLR or NCLR.\n\n\nAppendix F\n\nTechnical Rationale for Less limiting Facilities\n\nERCOT and TSPs shall model Facility Ratings and System steady-state voltage limits (voltage-based Facility Ratings) that are equally limiting or more limiting than operational Facility Ratings and voltage limits developed in accordance with the ERCOT System Operating Limit (SOL) Methodology for the Operations Time Horizon, as represented in the MOD Base Case. Facility Ratings and voltage limits include, but are not limited to, bus voltage limits, transformer ratings, line ratings, breaker ratings, and switch ratings.\n\nERCOT or TSPs must provide one of the following technical rationale to model less limiting Facility Ratings or voltage limits in the SSWG Cases:\n\n•\tTransmission Project, for planned transmission projects that would modify transmission facilities. This category generally applies to the following PMCR types:\no\tTier 1, 2, 3, & 4\no\tNo_TPIT\no\tGeneration Interconnection\n•\tData Corrections, for modeling adjustments to correct errors that cannot be corrected in the operational Facility Rating or voltage limit. This category generally applies to the following PMCR type:\no\tStandard_PMCR\n•\tData Updates, for data quality checks and updates for in-service equipment and to reflect as-built Facilities. This category generally applies to the following PMCR types:\no\tNOMCR_Pending\no\tNOMCR_Submitted\n•\tOther, for technical rationale that is not in one of the above categories\n\n\n\n\n\n\n\n\n\n\nDynamics Working Group\nProcedure Manual\n\n\n\n\nRevision 23\n\n\n\n\nROS Approved: May 1, 2025\n\n\nTABLE OF CONTENTS\n\n\nForeword\t4"
  },
  {
    "title": "4.4\tRecommended DWG Study Methodologies\t44",
    "text": "4.4.1\tVoltage Instability Identification in Stability Studies\t44\n4.4.2\tCascading Identification in Stability Studies\t45\n4.4.3\tUncontrolled Islanding Identification in Stability Studies\t45\n4.4.4\tGenerator Protection Assumptions\t46\n\nForeword\nThis Procedure Manual is intended for use by the stakeholder members of the Electric Reliability Council of Texas (ERCOT) for the purpose of creating and maintaining the dynamics database and dynamics simulation cases which are used to evaluate the dynamic performance of the ERCOT system.\n\n\n\n\nActivities of the Dynamics Working Group (DWG)\nThe DWG builds dynamic data sets and dynamic study cases for the ERCOT system from data supplied by equipment owners. ERCOT coordinates the compilation and publication of dynamics data and dynamics study cases. The dynamics data are published in the form of dynamics study cases (flat start cases) as described within this document.\nThe DWG prepares the annual update of the Stability Book that documents dynamic data used in the flat start cases.\nThe DWG provides a forum for discussing dynamic modeling and system dynamic performance issues and questions.\nThe DWG performs other activities as directed by the Reliability and Operating Subcommittee (ROS).\nAdministrative Procedures\nMembership\nThe DWG is a non-voting working group whose members include representatives from ERCOT, Transmission Service Providers (TSPs), Texas Reliability Entity (Texas RE), and Public Utility Commission of Texas (PUCT).\nEach NERC Transmission Planner within the ERCOT footprint and each ERCOT TSP with an assigned area in the Steady State Working Group (SSWG) and DWG base cases, shall have at least one designated DWG member.  The designated DWG member(s) shall be an employee(s) of an ERCOT Registered TSP. A Designated Agent that is not a DWG member may represent a DWG member.  Designated Agents are permitted on the DWG email exploder list at the discretion of the sponsoring DWG member under the stipulation that a Non-Disclosure Agreement (NDA) is in place with the sponsoring DWG member and proper notification has been provided to ERCOT. It is the responsibility of the sponsoring DWG member to inform ERCOT of Designated Agents acting on their behalf. It is also the responsibility of the sponsoring DWG member to inform ERCOT of Designated Agents that no longer represent them and to have them removed from the email exploder list. The DWG will review the participating Designated Agents annually.\nDWG members and any Designated Agents shall be identified in the DWG roster, and the roster will be updated as needed by the DWG.  The DWG shall notify ROS (in the monthly report) of any TSPs that are required to have a designated DWG member but do not have a DWG representative identified on the DWG roster.\n\nThe DWG will nominate a chair and vice-chair to be approved by the ROS annually.\n\nDuties of Chair and Vice-Chair\nThe chair will coordinate the activities of the DWG and represent the DWG at the ROS meetings and other working group meetings as required.\nThe vice chair will support the chair and fulfill the duties of the chair in the absence of the chair.\nMeetings\nThe DWG will meet at least quarterly. DWG meetings are closed meetings. DWG members and Designated Agents of DWG members may attend. If a Designated Agent is not on the DWG roster, the sponsoring DWG member shall inform ERCOT and the DWG chair and vice chair of the name of the Designated Agent attending one week prior to the meeting.\nThe chair may coordinate additional meetings, including open meetings, as needed to facilitate the activities of the DWG. Non-DWG members may participate in DWG meetings including open portion of the meeting for specific purposes (e.g. a technical presentation or discussion).  Any such participation should be approved by the chair, limited to the specific purpose, announced in the meeting agenda, and recorded in the meeting minutes.  The vice chair will track attendance and document meeting minutes for in-person meetings.\nAgendas and meeting schedules should be published at least two weeks prior to the meeting. The minutes of each meeting will be distributed to DWG members.\nReports to ROS\nEach month, the DWG chair will provide a written report to the ROS if needed.\nDynamic Data Sharing Rules\nDynamic data and dynamic study cases are considered confidential and protected information pursuant to Nodal Protocol Section 1.3, Confidentiality.  They shall be provided to the DWG members only.\n\n\n\nDynamic Data\n\nGeneral\nDynamic data is the network data, mathematical models, and supporting information required for simulation of dynamic and transient events in the ERCOT System.\nSoftware\nThe current planning model software is PSS/E version 35 and PSCAD version 4.5 or higher.  During years where a PSS/E version change is being conducted, the previous PSS/E version user defined models shall also be provided until a full transition is completed.  The current operations model software is Powertech DSATools™ Transient Security Assessment Tool (TSAT) version 22.\nDynamic Models – General\nDynamic models compatible with the software(s) and version(s) listed in Section 3.1.1 shall be submitted to both ERCOT and the interconnecting TSP.  In addition to the requirements described in the Planning Guide Section 6.2, Dynamics Model Development, providers of dynamic models shall also adhere to the following requirements:\nEach dynamic device requires a model with model parameters that accurately represent the dynamics of the device over the entire range of operating conditions.\nStatic switchable devices part of Inverter-Based Resource (IBR ) facilities (such as on-load tap changing transformers (OLTC) and switchable reactive shunts) should include an initialization script or logic to correctly initialize for the POI initial conditions of the power flow case the model is integrated in (for example, a Python file for PSS/e and initialization logic for PSCAD), and should include switching control logic if the device is expected to switch within 45 seconds of a disturbance .\nPSCAD models shall be submitted to ERCOT for all IBRs, Wind-powered Generation Resources (WGRs), and inverter-based transmission elements (IBTEs)  installed on or after January 2015; for equipment installed before 2015 PSCAD models shall be submitted to ERCOT upon request.  For purposes of this manual, IBTEs includes STATCOMs, static VAR compensators (SVCs), and other transmission devices with power electronic grid interfaces.\nWhere multiple models are provided (e.g. PSS/E, TSAT, PSCAD), the model response shall be consistent across software platforms to the extent of platform capability.\nDynamic models shall utilize proper memory management within the software.  Data must only be written to allocated memory locations so that other models within the system are not affected.\nAll associated per unit dynamic model parameters for a given generating unit shall be provided using a base MVA (MBASE) in accordance with appropriate modeling techniques for the software platform, where the MBASE is typically the generator MVA rating.\nNo model shall restrict the DWG from using any integration time-step less than or equal to a ¼ cycle in simulations when using positive sequence simulation tools.\nNo model in the DWG’s Unacceptable Model List shall be used. Refer to Section 3.1.10.\nStandard Dynamic Models\nThe use of standard dynamic models provided by the software is preferred when they can accurately represent the dynamic performance of the device being modeled.\nUser-Written Dynamic Models\nA user written model is any model that is not a standard library model within the software(s) and version(s) listed in Section 3.1.1.  When no compatible standard dynamic model(s) provided within the software can be used to represent the dynamics of a device, accurate and appropriate user written models can be used, if accepted by ERCOT and the DWG after being tested for compatibility with the flat start cases.  A model guideline checksheet is provided by ERCOT for PSS/E, TSAT and PSCAD models to help determine compatibility ; this checksheet shall be completed and submitted along with the model.\nPSS/E User-written models for the dynamic equipment and associated data must be in dynamic linked library (DLL) format and must include a model manual.  The model manual must show control block diagrams, design logic, descriptions of all model parameters, a list of which parameters are commonly tuned for site-specific settings, and a description of procedures for using the model in dynamic simulations.\nTSAT User-written models for the dynamic equipment and associated data must be in TSAT User Defined Model (UDM) format and associated dynamic linked library (DLL) and template user-defined model (TUDM) if required. The TSAT UDM or DLL shall be able to directly read and support the PSS/E format data (.dyr file).  TSAT UDM models shall be provided with two cases:  one set up using bus numbers (the same numbers as a sample PSS/e case) and the other set up using equipment names.  The equipment name case should include a space character in the name to demonstrate that the model is compatible with space characters (an ERCOT systems requirement).\nAll PSCAD models are considered to be user-written models.\nDynamic Model Quality Test Guideline\nSubmitted dynamic planning and operations models must be accompanied with results from model quality tests (MQT) performed by the facility owner as required in paragraph (5)(c) of Planning Guide Section 6.2.  These results shall include the case simulation files as well as the simulation plots of relevant quantities for each test.  When submitting PSS/E and PSCAD MQT files, include the leading and lagging power factor cases for the voltage ride-through tests.  Guidelines on how these tests should be performed and the expected model performance are provided in the following sub-sections. All tests are required for PSS/E, TSAT, and PSCAD models with the exception of the Phase Angle Jump Test in Section 3.1.5.9, which is only required for PSCAD models.  A sample report is posted under ‘Model Quality Guide’ on the ERCOT Resource Entity webpage . Plots of PSS/E, TSAT, and PSCAD test results should be overlaid onto the same plot axis for comparison.  However, TSAT model testing is not required for models utilizing a TSAT standard library model.\n\n\n\n\n\n\n\n\nList of Applicable Tests\nApplicable Technologies\tModels\tTests and Sections\tNotes\nSynchronous Machines\n(incl. transmission-level synchronous condensers)\tPSS/e\n(and TSAT, and PSCAD if utilizing a UDM in PSS/e model)\t\tFlat-start, 3.1.5.2\nSmall volt. disturbance, 3.1.5.3\nLarge volt. disturbance, 3.1.5.6\nSmall frequency disturbance, 3.1.5.7\nIBRs, WGRs, and IBTEs\n(all non AGS-ESR)\n\n(Entities that own a generator Facility with a synchronous condenser would also run these tests.)\tPSS/e and PSCAD\n(and TSAT if utilizing a UDM PSS/e model)\t\tFlat-start, 3.1.5.2\nSmall volt. disturbance, 3.1.5.3\nSmall frequency disturbance, 3.1.5.7\nLarge voltage dist.:\nLVRT Test†, 3.1.5.4\nHVRT Test‡, 3.1.5.5\nSystem Strength, 3.1.5.8\nPhase Angle Jump, 3.1.5.9\tPhase Angle Jump is only required in PSCAD (not in PSS/e and TSAT)\nAGS-ESR\n(Energy storage with Advanced Grid Support)\tPSS/e and PSCAD\n(and TSAT if utilizing a UDM PSS/e model)\t\tFlat-start, 3.1.5.2\nAGS Small volt. disturbance, 3.1.5.11\nAGS Frequency change and inertia response , 3.1.5.12\nLarge voltage dist.:\nLVRT Test†, 3.1.5.4\nHVRT Test‡, 3.1.5.5\nAGS System Strength,3.1.5.13\nAGS Phase Angle Jump, 3.1.5.14\nAGS Loss of synchronous machine, 3.1.5.15\tAll tests, except Phase Angle Jump, are required in both PSS/e and PSCAD (and TSAT, if UDM).\n† Low Voltage Ride Through (LVRT): Includes both the Legacy LVRT and the Voltage Dip test fashioned after LVRT curve as defined in Nodal Operating Guide 2.9.1.1.\n‡ High Voltage Ride Through (HVRT): Includes the preferred HVRT curve and, if necessary, the Legacy HVRT curve. See Section 3.1.5.5 for more details.\n\n3.1.5.1 Simulation Set Up\n\nTo examine the dynamic performance of a Generation Facility or dynamic transmission element, all site-specific dynamic models needed to represent the facility shall be included in the test.  Unless otherwise specified, the following model guidelines apply:\nThe facility model is connected to a controllable infinite bus whose voltage and frequency can be adjusted for testing.  No explicit ERCOT transmission system models are required for this testing.  The tests shall be performed with the current planning model software.\nFor generation resources, the generator is dispatched at full real power output and the Point of Interconnection (POI) bus voltage is initialized to nominal 1.0 per-unit unless the test requires otherwise. Facilities that include energy storage systems should also be tested at full real power withdrawal. The initial reactive power exchange at the POI should be near zero unless the test requires otherwise.\nBehind the POI, the generator(s) and step-up transformer(s) shall be represented along with any additional planned or installed static and dynamic reactive equipment.\nStation transformer taps and static switched shunts should be initialized to a nominal position appropriate for the initial POI voltage and real power dispatch.\nAny switching controls that are expected to provide a response within 20 seconds (e.g. automatic switched shunts or on-load transformer tap changers) should be reflected in the dynamic model for the resource.\nAggregate Generation Resources, such as wind and solar, should be represented by a single equivalent aggregate model per registered Resource (i.e. allowed aggregation) and include a representation for the collector impedance and pad-mount transformer.  All dynamic control systems should be modeled (generator, exciter, governor, power system stabilizer, automatic voltage regulator, power plant controller, voltage and frequency protection, etc. as applicable).\nPSCAD models are not required to be aggregated to match resource registration.  However, PSS/E and TSAT models must match registration.\nSimulations should be run for a minimum of 20 seconds and show that the facility response has stabilized.\nExample test cases for an Inverter-Based Resource (IBR) with a STATCOM and a synchronous generator test case are shown below.\n\n\n\n3.1.5.2 Flat Start Test\nPerform a no-disturbance test of the prepared simulation case as described in Section 3.1.5.1 above for a minimum of 20 seconds.  Flat responses of voltage, MW, MVAR, and frequency, as shown in the figure below, are expected to remain very close to the initial system condition.\n\n3.1.5.3 Small Voltage Disturbance Test\nApply a 3% step increase, and in a separate simulation, a 3% step decrease of voltage at the POI.  The plant Automatic Voltage Regulator (AVR) and the associated droop and dead-band settings (if applicable) should transition the plant to/near maximum leading power factor , or in the latter case, to/near maximum lagging power factor in an attempt to regulate the original voltage set point.  Any oscillations should be well damped.  Real power output should be sustained throughout the small voltage disturbance tests.  The figures below include examples of acceptable and unacceptable responses.\n\n\n\n\n\n\n3.1.5.4 Large Voltage Disturbance Test: (Low Voltage Ride-Through (LVRT) for IBRs, WGRs, and IBTEs)\nAll IBRs, WGRs, and IBTEs should test two profiles, both a “legacy” profile and a “voltage dip” profile as described below.  Testing both profiles helps provide important model performance information.\nThe “legacy” Low Voltage Ride Through curve per Nodal Operating Guide (NOG) 2.9.1.2.\nThe “voltage dip” test includes evaluation of NOG 2.9.1.1.  The test shall be run as a series of separate piece-wise disturbances with the voltage returning to 1.0 per-unit (pu) voltage after each disturbance (see below examples).  The spacing between each disturbance may be greater than 10 seconds to allow for recovery as necessary.\nEach voltage disturbance profile starts at 1.0 pu voltage.  The “legacy” curve ends at 0.90 pu voltage.  In the case of Resources, tests shall be performed for two initial conditions: with the facility operating at a 0.95 lagging power factor (at the POI) and with the facility operating at 0.95 leading power factor (at the POI) . The model shall exhibit appropriate dynamic reactive response, active current injection, AVR response, and the model shall not exhibit momentary cessation.\nAdditionally, the maximized LVRT capability as required in NOG 2.9.1.1(8) or NOG 2.9.1.2(8) shall be documented in a format similar to the tables in NOG 2.9.1.1(1) or NOG 2.9.1.2(1).\n\nWhen testing the “legacy” profile, the following performance criteria apply:\nFor the low voltage transient, the model should inject reactive current throughout the voltage recovery period.  At the POI, both P and Q are necessarily zero during zero voltage. Q injection at the POI should be observable immediately or very shortly after voltage begins ramp up from zero.\nFor 0.9 pu sustained POI voltage, the AVR should provide voltage support that moves the resource towards nearly full reactive production (significantly lagging).\nReal power recovery should start prior to the POI voltage recovering to 0.9 pu.\nReal power should recover to full output within 1.0 seconds of POI voltage recovery to 0.9 pu.  A modest real power reduction  (typically 5% of Pmax or less) may be acceptable to accommodate greater terminal reactive power injection for sustained POI voltages in the range of 0.90 pu to 0.95 pu provided real power fully recovers when POI voltage returns to normal operating range (0.95-1.05 pu). An explanation, including a reference to any exempt status per ERCOT Nodal Operating Guide Section 2.9.1, , shall be provided for models which indicate that the unit trips or fails to meet any of the above performance criteria.\n\n\n\n\nWhen testing the “voltage dip” profile, the following criteria applies:\nResources not subject to the “preferred” Voltage Ride Through requirements of NOG 2.9.1.1 are only required to ride through the first dip of the below voltage dip profiles.  This first dip is within the “legacy” LVRT requirements of NOG 2.9.1.2.\nDuring the voltage dips:\nThe model shall inject active current for POI voltage dips of 0.5 and higher.\nInjections of significantly reduced active current for voltage dips 0.5 pu and 0.7 pu should be accompanied by increased reactive current.\nReactive current injection at the POI shall be observable immediately or very shortly after a non-zero voltage dip is applied.\nAfter the voltage dips:\nReal power should recover to full output within 1.0 seconds of POI voltage recovery to 1.0 pu.\nAn explanation, including a reference to any exempt status per ERCOT Nodal Operating Guide Section 2.9.1, shall be provided for models which indicate that the unit trips or fails to meet any of the above performance criteria.\n\nFollowing are three figures:  The first illustrates the \"Legacy” LVRT to be applied at the POI; the second illustrates the “voltage dip” LVRT voltage profile to be applied at the POI for photovoltaic generation resources (PVGRs) and energy storage resources (ESRs), and inverter-based transmission equipment, and the third illustrates the “voltage dip” LVRT voltage profile to be applied at the POI for wind generation resources (WGRs).\n\n\n\nThe figures below include the examples of acceptable and unacceptable responses:\n\n\n\n\n\n\n\n3.1.5.5 Large Voltage Disturbance Test (High Voltage Ride-Through for IBRs, WGRs, and IBTEs)\nFirst, apply the “preferred” HVRT curve to the POI per NOG 2.9.1.  If the facility cannot meet the “preferred” ride through requirements, then additionally test the “legacy” HVRT curve and report both results. The “preferred” curve has more stringent requirements, so it is not necessary to test the “legacy” curve for devices passing the “preferred” curve, and such testing would generally not provide additional revelations regarding model behavior.\nAdditionally, the maximized HVRT capability as required in NOG 2.9.1.1(8) or NOG 2.9.1.2(8) shall be documented in a format similar to the tables of NOG 2.9.1.1(1) and NOG 2.9.1.2(1).\n\nThe HVRT profiles start at 1.0 pu voltage and end at 1.1 pu.  The tests should be performed for two initial conditions: with the facility operating at 0.95 lagging power factor (at the POI) and with the facility operating at 0.95 leading power factor (at the POI). The model shall exhibit appropriate dynamic reactive response, active current injection, AVR response, and the model shall not exhibit momentary cessation.\nThe following criteria apply to both the “preferred” and “legacy” HVRT tests:\nDuring the high voltage transient, the model should provide a fast dynamic response to absorb reactive power.  The resource should be absorbing a significant amount of reactive power at the POI during the high voltage transient, and ideally within 0.5 seconds of the transient inception.\nFor 1.1 pu sustained POI voltage, the AVR should move the resource towards nearly full reactive absorbing (significantly leading).\nReal power should be sustained during high voltage condition.  A modest real power reduction (typically 5% of Pmax or less) may be acceptable to accommodate  greater reactive power absorbed for sustained POI voltages in the range of 1.05 pu to 1.10 pu provided real power fully recovers when POI voltage returns to normal operating range (0.95-1.05 pu).\nAn explanation, including a reference to any exempt status per ERCOT Nodal Operating Guide Section 2.9.1, shall be provided for models which indicate that the unit trips or fails to meet any of the above performance criteria.\nThe following two figures illustrate the “preferred” and the “legacy” HVRT voltage profiles applied at the POI.\n\n\n\nThe figures below include examples of acceptable and unacceptable responses.\n\n\n\n\n\n3.1.5.6 Large Voltage Disturbance Test (for synchronous machines-based facilities including synchronous generators and synchronous condensers)\nApply a three-phase fault at the POI for 4 cycles (i.e. apply a step change to zero voltage at the POI for 4 cycles and then a step change back to nominal voltage).  The facility should inject reactive current during the fault.  Following the fault the facility should return to a stable operating point with full real power output.  Any oscillations should be well damped.\n\n3.1.5.7 Small Frequency Disturbance Test (all facilities)\nApply a 0.3 Hz step increase, and in a separate simulation, a 0.3 Hz step decrease of system frequency from nominal frequency (60Hz).  The governor or frequency controller should lower or raise the real power dispatch according to the droop and deadband characteristic.  A frequency response is required for all Generation Resources and Energy Storage Resources (ESRs) assuming there is sufficient headroom to respond to frequency changes.  The real power should initially be dispatched at 80% of maximum for this test. Tests for ESRs should also be run for a condition at 80% of maximum charging capability.  Since Intermittent Renewable Resources (IRRs) typically operate in a power availability state (no headroom) state even when operating below nameplate capability, two frequency drop simulations shall be performed for IRRs:  One where the resource is modeled in a curtailed (with headroom) state at 80% dispatch, and another simulation where the resource is modeled in a power availability state (no headroom) at 80% dispatch.  A description of how to set up the IRR model for each case (headroom vs. no headroom) should be included.  Non-exempt IRR resource models operating with headroom should provide a real power increase in response to a frequency drop.  An explanation, including a reference to any exempt status per ERCOT Nodal Protocol 8.5.1 shall be provided for models that fail to exhibit sufficient frequency response.  In general, the submitted IRR model should reflect a power availability state (no headroom state) as that would be the normal operating assumption even when dispatched at less than Pmax.\nThe figures below include the examples of acceptable and unacceptable responses.\n\n\n\n\n\n\n\n\n3.1.5.8 System Strength Test (for Inverter-Based Resources, and Inverter-Based Transmission Elements)\nThis test considers the model performance under varying short circuit ratios (SCR).  The SCR of the electric grid can vary over time due to line contingencies, nearby generator status, etc., so it is important for a model to behave well under a range of SCR conditions.\nThe model shall be tested under at least four different short circuit ratios listed in the table below.  If there are concerns about model accuracy under certain lower short circuit ratios, a written explanation of the reason should be provided.\n\nTest\tSCR\n1\t5\n2\t3\n3\t1.5\n4\t1.2\n\nMethod for Testing SCR:\nA test case is set up where the plant model POI is connected to a controllable infinite bus by a branch whose impedance can be programmatically changed during the simulation.  Initially, the branch impedance is set to Xpu where Xpu represents the per-unit reactance necessary to achieve the desired short circuit ratio.  After applying a 4 cycle bolted three phase fault to the POI, the branch impedance is changed to reflect a post-disturbance system with higher impedance.    A series of short circuit ratios can be tested in the same simulation by progressively increasing the value of Xpu, so long as sufficient run time is provided between changes for the model to reach steady state.\n\n\n\nCalculation of Xpu, the Per-Unit Line Impedance:\nThe short circuit ratio is defined as the measured short circuit MVA (MVAfault) contribution from the system divided into the total generator MW capacity.  The measured short circuit MVA is defined as the short circuit current contribution from the system multiplied by the nominal system voltage.  Refer to the formula below, assuming a system base MVA of 100.\n\nSCR=〖MVA〗_Fault/〖MW〗_Capacity\n\nSCR=(100⁄X_pu )/〖MW〗_Capacity\n\nRearranging,\nX_pu=100/(〖MW〗_Capacity*SCR)\n\nWhere\n〖MW〗_Capacity= Total MW capacity of generator(s) under study\nSCR\t= Desired short circuit ratio to test\nXpu \t= Per unit line reactance, on a 100 MVA system base\n\nExample:\nA wind farm consisting of one-hundred 2.0 MW wind turbines is to be tested under short circuit ratios of 5, 3, 1.5, and 1.2.  Thus, for the windfarm,\n〖MW〗_Capacity= 200 MW\n\nUsing the equation above, the line impedance (Xpu) is calculated for each of the test short circuit ratios.\nWhen testing SCR = 5, the line reactance is Xpu = 0.1\nWhen testing SCR = 3, the line reactance is Xpu = 0.17\nWhen testing SCR = 1.5, the line reactance is Xpu = 0.33\nWhen testing SCR = 1.2, the line reactance is Xpu = 0.42\n\nFor each increase in line reactance, the plant reactive power controller should adjust to restore voltage schedule and compensate for the increase in reactive losses. After applying the fault disturbance, the Xpu is modified to a value corresponding to the next lower SCR level to be tested.  Models shall provide acceptable responses for an SCR of 3 and higher.  If the responses are not acceptable for an SCR of 1.5, then a technical reason for the limitation should be provided, and a model enhancement should be considered.\nThe figures below include examples of acceptable and unacceptable responses.\n\n\n\n\n\n3.1.5.9 Phase Angle Jump Test (for Inverter-Based Resources)\nThis test considers the model performance under a sudden increase or decrease in voltage phase angle as can sometimes occur on the electrical grid under disturbances.  The test consists of exposing the model to an instantaneous voltage phase angle increase, and separately, an instantaneous voltage phase angle decrease, to determine the maximum phase angle jump the model can withstand and still remain online and recover to normal operation.  For example, the test can be conducted starting with a 180 degree jump, and if the model cannot ride through, decreasing by 30 degrees each time until the model is able to ride through.  This test is only required for PSCAD models of inverter-based resources.\n\n3.1.5.10 Model Test Setup and Description for AGS-ESR\nThe following sections 3.1.5.11 – 3.1.5.15 outline test procedures and associated criteria to examine and verify functionality for AGS-ESR. The flat start (defined in section 3.1.5.1) and large voltage disturbance tests (defined in Sections 3.1.5.4 and 3.1.5.5) are applicable to AGS-ESR, while Sections 3.1.5.11-3.1.5.15 contains modified and new tests specific to AGS-ESR: small voltage disturbance, frequency change and inertia response, system strength, and phase angle jump tests, as well as loss of synchronous machine test.\n\nAny quantities showing oscillations resulting from a test should demonstrate a controlled, damped response. Required plots for all tests include the relevant test profile, POI voltage, and the active/reactive power of the plant with appropriate axis resolution to demonstrate all performance criteria.\n\n3.1.5.11 AGS-ESR Small Voltage Disturbance Test\nIn this test, a step change is applied to the voltage magnitude of the controlled source so that the reactive power response time and magnitude can be measured. The purpose of this test is to demonstrate the capability of resisting changes in voltage magnitude. The test system should be set up to have zero impedance (Zth) between the ideal voltage source and the POI. The initial dispatch of the ESR should be set to its maximum discharging for active power, with approximately zero reactive power.  The figure below illustrates the voltage magnitude profile applied to an ideal source at the POI.\n\nThe following performance criteria apply:\nThe instantaneous reactive power output of the plant should quickly respond to oppose the voltage step change for each of the step changes, with an initial peak reactive power change of at least 0.03 pu on the rated power base (e.g., A 100 MVA rated plant with 0 MVAR initial output should instantaneously increase reactive power output from 0 MVAr to at least 3 MVAr when source voltage magnitude is decreased by 3%.).\n\nThe reactive power should not return to the pre-disturbance level within 6 cycles.\n\nThe response time to 90% of the initial change in instantaneous reactive power should occur within 1 cycle.\n\nAfter each step change resulting in POI voltage above or below the nominal value, the reactive power should start to transition toward the maximum reactive capability of the plant in an attempt to regulate the original voltage set point.\n\n\n\n3.1.5.12 AGS-ESR Frequency Change and Inertia Response Test\nThis test is to evaluate the active power response of the ESR and to estimate its inertia response to frequency change. The test system should be set up with a SCR of 3 at the connection point and with a X/R ratio of 6. The initial dispatch of ESR should be set to zero for active power with approximately zero reactive power\nThe figure below illustrates the frequency profile applied to the source at the POI, with initial ramps of 1 Hz/s followed by 0.3 Hz steps which is the same test for the existing IBRs.\n\nThe following performance criteria apply:\nPlant real and reactive power output should be well controlled. The frequency and voltage should not oscillate excessively or deviate from steady-state levels for any significant amount of time.\n\nVoltage should settle to a stable operating point when the frequency is not ramping\n\nThe equivalent inertia constant, as calculated below, should be greater than 2.5 s.\n\nH ≈ 60 * ∆E [s], where: ∆E is the area under the per unit active power production of the ESR from 0 to 0.5 s, when the RoCoF is 1 Hz/s.\n\nActive power should settle according to its frequency droop and deadband settings when the frequency has settled.\n\n\n\n3.1.5.13 AGS-ESR System Strength Test\nThis test is similar to the existing system strength test for all IBRs, but AGS-ESR shall demonstrate a stable response for all tested SCR values from 10 down to 1.2. The test system should be set up with a SCR of 10 at the connection point with a X/R ratio of 6. The initial dispatch of ESR should be set to the max discharging for active power with approximately zero reactive power.\n\nThe model shall be tested under the short circuit ratios listed in the table below.  As in the case of non-AGS-ESR, a 3-phase, bolted, 4-cycle fault is applied just before each SCR transition. The SCR transition occurs at fault clearing time.\nTest\tSCR\n1\t10\n2\t5\n3\t3\n4\t1.5\n5\t1.2\n\n\n\n\nThe following performance criteria apply:\nPlant real and reactive power output and RMS voltage should be well controlled\n\nThe plant shall not trip nor reduce power (outside of the fault period) for any extended period of time for all tested SCR range from 10 to 1.2.\n\n\n\n3.1.5.14 AGS-ESR Phase Angle Jump Test\nThis test examines the capability to maintain the voltage phasor and ability to resist an angle change. In addition, it ensures stable behavior under different angle step changes when an ESR is working close to its maximum current limit. For large angle changes forcing the controls beyond their maximum current limits, the ESR should be stable and should not degrade the performance of the power grid. The test system should have a SCR of 3 at the connection point with a X/R ratio of 6. Initial dispatch of ESR should be set to the max discharging for active power with approximately zero reactive power. This phase angle jump test must be conducted using PSCAD.\n\nThe figure below illustrates the voltage angle profile applied at the 3-phase ideal voltage source.\n\n\nThe following performance criteria apply:\nThe instantaneous active power output of the plant should quickly respond to oppose the angle change with the peak active power change being at least 0.2 pu (based on the rated active power) for each 10-degree voltage phase angle change, in the opposing direction. (e.g., A 100 MW rated plant should temporarily decrease active power output from 100 MW to 80 MW, or below, when source voltage angle is increasing 10 degrees; and it should temporarily increase active power from 100 to at least 120 MW, if the current limit allows, when voltage source angle is decreased by 10 degrees.).\n\nFor the 25-degree voltage phase angle change, the instantaneous active power output of the plant should quickly respond to oppose the angle change with the peak active power change being at least 0.5 pu (based on the rated active power) in the opposing direction. If the criterion is not met for the 25-degree angle change, the rationale should be documented.\n\nThe active power should not return to the pre-disturbance level for at least 3 cycles.\n\nThe response time to 90% of the initial change in instantaneous active power should occur within one cycle.\n\nIf the current limit in the inverter is reached when the angle jump is applied, the performance criteria described above may not apply. However, the active power must return to the pre-disturbance level in a stable manner.\n\n\n\n\n\n3.1.5.15 AGS-ESR Loss of Synchronous Machine Test\nThe purpose of this test is to confirm the ability of an AGS-ESR to form voltage and work in parallel with a nearby AGS-ESR. It is not intended to examine the black start capability of AGS-ESR nor to require ESRs operate continuously on a grid without synchronous resources.\nThis test utilizes a duplicate of the AGS-ESR under test to represent the neighboring plant. The synchronous source can be represented by a voltage source or any source with sufficiently high inertia and low impedance compared to the AGS-ESR under study.\nUsing the testbench shown in the figure below, with a constant impedance load (L) and a power factor of 0.95 lag, along with the project plant initial dispatch (P1), the duplicated plant initial dispatch (P2), and the load value, the following three scenarios must be tested:\nScenario 1:\nP1 = 0.3 pu discharging, P2 = 0.1 pu discharging, and L = 1.3 pu\nScenario 2:\nP1 = 0.6 pu charging, P2 = 0.4 pu charging, and L = 0.7 pu\nScenario 3:\nP1 = 0, P2 = 1 pu discharging, and L = 1.65 pu\nNote: The dispatch and load values are provided based on the project plant rating.\n\nSimulate the system until a stable response is reached for the given scenario, ensuring that no oscillations occur, then disconnect the voltage source (without fault) and continue the simulation for at least 10 seconds. Plots of the active and reactive power of the ESR, duplicate ESR, load, and voltage source as well as POI frequency should be provided.\n\n\n\nThe following performance criteria apply:\nImmediately following the disconnection of voltage source, both AGS-ESRs output should be well controlled and exhibit stable response.\n\nSystem frequency and voltage should settle to a stable operating point (within 5 seconds) and be completely damped within 10 seconds.\n\nActive and reactive power from each plant should move immediately to meet the load requirement, while response time to 90% of initial change should occur within one cycle.\n\nActive and reactive power from each plant should settle according to its droop setting.\n\n\n3.1.6 Unit Model Validation\nPSCAD models must be accompanied with results from the unit model validation tests performed by the Interconnecting Entity or Resource Entity as required in paragraph (5)(d) of Planning Guide Section 6.2.  These validations shall demonstrate the accuracy of the PSCAD models against actual inverter testing and should be performed for all inverter-based device types within the facility.  The test report should clarify if the inverter is capable of meeting AGS-ESR requirements and that these control settings are enabled. The tests are inverter specific but need not be site-specific.  The report should include a description of the test set up as well as the simulation plots of relevant quantities for each test.   Guidelines on how these tests should be performed and the expected model performance are provided in the following sub-sections.\n\n\n3.1.6.1 PSCAD Model Setup\n\nBecause the purpose of validation is to test the PSCAD inverter model, it is not necessary to model any balance-of-plant equipment, transformers, collector system, power plant controllers, etc., however any auxiliary inverter-based equipment should also be tested (for example, STATCOMs). In simulation software, the PSCAD model(s) should be connected to a controllable voltage source whose voltage and frequency can be adjusted for testing. The inverter should be dispatched at full real power unless the test requires otherwise.  Energy storage devices should be tested under both charging and discharging modes.  Simulations should be run for a minimum of 10 seconds.\n\n3.1.6.2 Inverter Hardware Testbench Setup\n\nThe testbench should utilize actual inverter hardware programmed with typical default settings.  Thus the test should be representative for all inverter devices under the same hardware and control implementation.\n\n\n3.1.6.3 Testing\n\nThe tests are designed to measure the inverter and model response to small and large magnitude disturbances of frequency and voltage as well as the subsynchronous response to gauge model accuracy.  Many of the tests closely parallel those used in the Model Quality Guideline Section 3.1.5.  Alternative testing methods may be permissible if the objective is fulfilled.  The following tests should be performed on both the PSCAD model and the actual inverter hardware:\n\nStep change in voltage, as specified in Section 3.1.5.3\nVoltage Ride Through, as specified in Section 3.1.5.4 and 3.1.5.5.\nSystem Strength Test similar to Section 3.1.5.9.\nVoltage Angle Step Test as in Section 3.1.5.10.\nSubsynchronous Test:  Perform a frequency scan sweep to measure the subsynchronous impedance as seen looking into the inverter over the range 5 to 55 Hz in 1 Hz increments.  This test is generally conducted by adding a small voltage perturbation of variable frequency superimposed on the fundamental (60 Hz) voltage, and measuring the complex impedance as seen looking into the inverter.  The results should be provided both as a plot and as a table and should display Resistance and Reactance plotted over 5 to 55 Hz.  Values should be in per-unit on the inverter MVA base.  This test should be conducted under the following conditions:  Strong system (short circuit ratio = 10), unity power factor, Weak System Lagging (short circuit ratio = 1.5, 0.95 lagging power factor), and Weak System Leading (short circuit ratio = 1.5, 0.95 leading power factor).\n\n\nMaintenance of Dynamic Models\nMaintenance of the models is the responsibility of the device owner. Models shall be maintained in accordance with Section 3.2.  Any user-written dynamic models shall also be maintained to fulfill the requirements as described in the Planning Guide Section 6.2 and Section 3.1.4 in this manual.\nDynamic Data for Existing Equipment\n“As-built” data is required for all completed facilities in accordance with Section 3.2.  To help ensure that dynamic model data is kept up to date with site-specific settings, paragraph (5)(b) of Planning Guide Section 6.2 introduces a “plant verification” requirement.  The plant verification reports should confirm that the model correctly reflects site-specific settings by presenting evidence such as delivery and testing reports, screenshots or pictures of actual hardware settings, attestations from the equipment manufacturer, etc.\nDynamic Data for Planned Equipment\nThe development of future year case data may require an entity to submit the best available information for the planned equipment prior to development of a detailed design. In such cases, estimated or typical manufacturer’s dynamic data, based on units of similar design and characteristics, may be submitted. However, the Resource Entity shall update the model information upon completion of the detailed design and again upon commissioning the equipment. Dynamic data for planned equipment shall be submitted in accordance with Planning Guide Section 6.2 and Section 3.2 in this manual.\nUnacceptable Dynamic Models\nThe DWG adopted a list of unacceptable dynamic models developed by the NERC System Analysis and Modeling Subcommittee (SAMS) with exception of those models for which DWG has a technical justification not to adopt.\nUnacceptable models that already exist in the ERCOT dynamic dataset shall be phased out through dynamic model updates including updates received via the NERC MOD-026-1 and MOD-027-1 processes.\nIf a generation interconnection or dynamic model update has begun prior to a model being identified as unacceptable by NERC, the model may be allowed.\nThe list of acceptable/unacceptable dynamic models are published on the NERC website.\n\nDynamic Data for Equipment Owned by Resource Entities (REs)\nDynamic Data Requirements for New Equipment\nNote: This section addresses the requirements stated in R1 of NERC Standard MOD-032-1 (effective July 1, 2015).\nREs are responsible for providing models with model parameters resulting in a tuned model that represents the dynamic performance of the device. Final responsibility for the submission and the accuracy of the dynamic data lies on the RE. ERCOT and the DWG will provide voluntary assistance if requested by REs to complete parameter tuning and prepare model records. The DWG member representing the TSP to which the RE is connected is responsible for working with ERCOT to incorporate the dynamic data received from the RE into the DWG Flat Start cases (.dyr file) during annual updates.\nThe RE shall fulfill its interconnection data requirement by including acceptable dynamic data and models for their facilities.  The RE may have additional model and data reporting obligations to ensure compliance with NERC reliability standards and/or other requirements.\nThe following two subsections describe data requirements for two distinct categories of generation facilities:\nSynchronous Generation Facilities:\nThe model data shall include, at minimum, a generator model, a governor model, an exciter model, and if applicable, a power system stabilizer model and an excitation limiter model.\nExplicit frequency protection relay models shall be provided for all generators where relays are set to trip the generating unit within the “no trip zone” of NERC Standard PRC-024 Attachment 1.\nExplicit voltage protection relay models shall be provided for all generators where relays are set to trip the generating unit within the “no trip zone” of NERC Standard PRC-024 Attachment 2.\nA governor model is not required for the steam turbine(s) of combined cycle plants.\nIBRs, and WGRs:\nThe RE shall provide the following data as applicable to the generator technology:\nModel, data and description of voltage control method.\nModel, data and description of how they will meet ERCOT reactive requirements.\nA one-line diagram of the proposed facility.\nData for all transformers. The data should include:\nMVA rating.\nHigh and low-side rated voltage.\nNumber of taps, and step size.\nImpedance, including base values if different from rated values listed above.\nDynamic modeling data including:\nWind generator or solar inverter manufacturer and type.\nRated voltage.\nRated MVA.\nReactive capability, leading and lagging.\nRated MW output.\nNet MW output.\nTransient or subtransient reactance, including base values, if applicable.\nTransient or subtransient time constant, if applicable.\nTotal inertia constant, H, of generator, including the shaft and gearbox, if applicable.\nNumber of machines by manufacturer types.\nReactive resource data such as capacitor banks, STATCOMS, etc. Provide the number of devices, location of the devices, step size, speed of switching, location where voltage is monitored and controlled, control strategy, and voltage limits. For dynamic reactive devices, provide the appropriate model and data.\nLine data from the POI to each generator shall include:\nLine type (overhead or underground)\nLine length\nLine resistance in ohms/1000 ft\nLine reactance in ohms/1000 ft\nLine susceptance in mhos/1000 ft\nWind turbine models shall account for rotor mass, aerodynamic energy conversion, and pitch control.\nExplicit frequency protection relay models shall be provided for all facilities where relays are set to trip the resource within the “no trip zone” of NERC Standard PRC-024 Attachment 1.\nExplicit voltage protection relay models shall be provided for all facilities where relays are set to trip the resource within the “no trip zone” of NERC Standard PRC-024 Attachment 2.\n\nUpdates to Existing Dynamic Data\nThe RE shall submit dynamic model updates to ERCOT and the TSP to which they are connected within 30 days of any facility change and/or test result that necessitates a model update to accurately reflect dynamic performance.  The data requirements specified in section 3.2.1 for new equipment also apply to all submitted model updates.  Obsolete data should be deleted or commented out as appropriate in the dynamic data.\nData for Load Resource\nERCOT will prepare the dynamic model using a standard model for Load Resource that is qualified to provide Responsive Reserve (RRS) through under frequency relay models.  Data for the Load Resource model shall be documented in the Stability Book.\nDynamic Data for Equipment Owned by Transmission Service Providers (TSPs) or Other Equipment Owners\nUnder Frequency Firm Load Shedding (UFLS) Relay Data\nUFLS data shall be prepared annually in accordance with ERCOT and NERC standards. TSPs are responsible for preparing the UFLS relay model records for their respective loads.  The TSP shall submit the UFLS relay data to ERCOT in the form of a data file using an appropriate model compatible with the software listed in Section 3.1.1. The models should contain the necessary information to properly represent the UFLS relay actions in a dynamic study, including:\nLocation (bus number and/or load ID) of load to be interrupted.\nFraction of load to be interrupted.\nCorresponding frequency set points.\nOverall scheme clearing times (including all time delays, breaker clearing times, etc.)\nAlso, the TSP should indicate any other schemes that are part of or impact the UFLS programs such as related generation protection, islanding schemes, automatic load restoration schemes, automatic capacitor/reactor switching, and Remedial Action Scheme (RAS).\nAll UFLS data will be documented in the annual Stability Book.\nUnder Voltage Load Shedding (UVLS) Relay Data\nAn ERCOT TSP which has UVLS relays in its service area designed to mitigate under voltage conditions potentially impacting the system reliability is to establish and maintain a UVLS Program consistent with NERC Standards.\nThe TSP owning an UVLS Program will submit the corresponding relay model to ERCOT during the annual Stability Book update. The DWG member shall submit the UVLS relay data in the form of a data file using an appropriate model compatible with the software listed in Section 3.1.1.\nIt is the responsibility of the TSP to ensure the UVLS program model submitted has been tested through an assessment as per NERC standards.\nAlso, the TSP shall indicate any other schemes that are part of or impact the UVLS programs such as related generation protection, islanding schemes, automatic load restoration schemes, automatic capacitor/reactor switching, and RASs.\nThe model shall contain the necessary information to properly represent the under voltage relay actions in a dynamic study, including:\nLocation (bus number and/or load ID) of load to be interrupted.\nFraction of load to be interrupted.\nCorresponding voltage set points.\nOverall scheme clearing times (including all time delays, breaker clearing times, etc.).\nAll UVLS data from the responsible entities will be documented in the annual Stability Book.\nProtective Relay Data\nThe operation of protection, control, and RAS systems can affect the dynamic performance of the ERCOT system during and following contingencies. Planning, documenting, maintaining, or other activities associated with these systems is outside the scope of the DWG. However, because they can affect dynamic performance, the DWG should, on an as needed basis, identify and document protection, control, and RAS systems for inclusion to its dynamic data sets.  Identification of these protection systems will normally require the assistance of individuals or groups outside the DWG. The specific information to be considered for inclusion will depend on the type, purpose, and scope of study.\nProtection, control, and RAS systems included in the DWG dynamic data should be in the form of a dynamic model and shall be compatible with the software listed in Section 3.1.1.  Protection, control, and RAS systems adequately modeled for dynamic purposes by other working groups only need to be referenced in the DWG study reports.\nThe DWG member, as part of the annual dynamic data update, shall review and update as necessary protection, control, and RAS systems already in the DWG database.  This review should include evaluating the existing data for applicability and accuracy.\nProtective relay data included in a DWG flat start case shall be documented in the Stability Book.\nLoad Model Data\nNote: This section addresses the requirements stated in R1 of NERC Standard MOD 032-1 and R2.4.1 of NERC Standard TPL-001-4 and TPL-001-5.1 (effective July 1, 2023).\nAnother key component of any dynamic study is the load model and its representation as a function of changing frequency or voltage.  The load model can have a significant effect on results of dynamic analysis.  For this reason, it is important to use an appropriate load model during the study.\nThe DWG shall review and update static load models for each area, composed of a mix of constant impedance (Z), constant current (I), and constant power (P) representations, known as ZIP models.  PSS/E CONL activity is used to incorporate the ZIP models into a PSS/E study.\nThe DWG recommends the use of the CMLD composite load model to represent various typical dynamic load elements, and in particular, modeling of air conditioning load as needed for studies.  Due to the complexity of flat start case development, these dynamic load models are not included in the DWG flat start cases. Instead, the dynamic load models are documented in the Stability Book.\nWithin 30 days of a written request from ERCOT, a TSP shall provide dynamic load models compatible with the software listed in Section 3.1.1 with documentation explaining the process to derive such models.\nThe DWG shall review the standard load-frequency dependency model (LDFRAL) and update the model if necessary. The model shall be documented in the Stability Book.\nOther Types of Dynamic Data\nNote: This section addresses requirements stated in R1 of NERC Standard MOD 032-1 (effective July 1, 2015).\nAll elements with dynamic response capabilities (such as SVC, STATCOM, Superconducting Magnetic Energy Storage (SMES), DC tie, fast switchable shunts, and Variable-Frequency Transformer) that are in service and/or modeled in the SSWG base cases shall be represented with an appropriate dynamic model compatible with the software listed in Section 3.1.1.\nThe DWG member of the TSP owning the equipment shall submit the model to ERCOT during the annual dynamic database update or as needed for studies. If the equipment owner is not a TSP (e.g. DC tie owners), appropriate models shall be submitted to ERCOT and the TSP to which the equipment is connected within 30 days of any facility change and/or test result that necessitates a model update to accurately reflect dynamic performance.\nMissing or Problematic Dynamics Data\nThe DWG is responsible for reviewing the dynamic data on an annual basis and reporting to the ROS any missing data or unresolved issues relating to data submission requirements.  DWG will report select data problems to the respective ERCOT working group per Section 4.2.3.\nIf the DWG and/or ERCOT identifies inappropriate or incomplete dynamic data, the appropriate DWG member and/or ERCOT shall request that the equipment owner resolves the discrepancies by following processes established by existing NERC Standards or ERCOT requirements. The final responsibility for the submission and the accuracy of the data lies with the equipment owner. All of the data and the revisions requested by ERCOT shall be resolved by the entity owning the equipment within 30 days.  Until valid data becomes available, ERCOT or the DWG member to whose system the equipment is connected shall recommend an interim solution to the missing or problematic data.\nDynamic Data and Stability Book Storage\nERCOT shall make available to the DWG members in electronic format the dynamic data described in this document.  ERCOT shall maintain a repository of dynamic data approved by the DWG and will maintain the submitted revisions."
  },
  {
    "title": "3.5\tDynamic Models for Distributed Generation",
    "text": "3.5.1 Distribution Generation Resource (DGR) and Distribution Energy Storage Resource (DESR)\nRE provided models will be used to represent inverter-based DGRs and DESRs. If the RE is not required to provide a model and/or an adequate model is not available to DWG, the DER_A model will be used. Parameterization will be based on DWG approved parameters in the ERCOT DWG DG Parameterization Guideline for the DER_A model and will represent capabilities consistent with the DGR/DESR requirements in the ERCOT Nodal Operating Guide.\nRE provided models will be used to represent synchronous DGRs. If the RE is not required to provide a model and/or an adequate model is not available to DWG, a generic model with DWG approved parameters in the ERCOT DWG DG Parameterization Guideline will be used with capabilities consistent with the DGR requirements in the ERCOT Nodal Operating Guide.\n3.5.2 Settlement Only Distribution Generator (SODG)\nRE provided models will be used to represent inverter-based SODGs with nameplate capacity of 5 MW or greater. If the RE is not required to provide a model and/or an adequate model is not available to DWG, the DER_A model with DWG approved parameters in the ERCOT DWG DG Parameterization Guideline will be used.\nRE provided models will be used to represent synchronous SODGs with nameplate capacity of 5 MW or greater. If the RE is not required to provide a model and/or an adequate model is not available to DWG, a generic model with DWG approved parameters in the ERCOT DWG DG Parameterization Guideline will be used.\nSODGs less than 5 MW will be represented as negative load (with GNET) in DWG base cases.\n3.5.3 Unregistered Distributed Generation (UDG)\nUDG dynamics will not be explicitly represented in DWG base cases.  DWG will not modify UDG representation from the SSWG  case - UDG will be embedded or reflected in the load according to current TSP conventions.\n\n\nOverview of DWG Activities\nUpdating Dynamic Data and Flat Starts\nSchedule for Dynamic Data Updates and Flat Start Cases\nNote: This section addresses requirements stated in R2 of NERC Standards TPL-001-4 and TPL-001-5.1 (effective July 1, 2023).\n\nEach June, the DWG shall prepare a detailed schedule for developing flat start cases and providing associated dynamic contingencies.  The DWG shall begin the flat start case development process as soon as practicable after SSWG base cases are posted – normally in May.  The DWG shall prepare flat start cases for near term on-peak, near term off-peak and long-term on-peak conditions to facilitate planning assessments required by NERC Standard TPL-001-4 and TPL-001-5.1 (effective July 1, 2023).  It is intended that the three dynamic data sets be developed concurrently to be utilized in planning assessments for the next year (YR+1).  The following diagram presents a schedule as a reference for DWG flat start case development:\nYR (YR=Current Year)\tYR + 1\nApr\tMay\tJun\tJul\tAug\tSep\tOct\tNov\tDec\tJan\tFeb\tMar\nYR SSWG Build Process\n- Cases Posted\nPrepare DWG Flat Start Schedule\tDWG Dynamic Flat Start Case Development\nNear Term On-Peak Case\nNear Term Off-Peak Case\nLong Term On-Peak Case\nFinal DWG Data Sets Posted\nSubmit Dynamic Contingency Files and  Dynamic Load Models\nStability Book Finalized and Posted\n\nThe DWG flat start case development process adds detailed dynamic models to network elements represented in an SSWG base case that reflect behavior during and following system disturbances.  The DWG shall normally prepare dynamic flat start cases based on the following SSWG steady state cases:\nNear-Term On-Peak Case: (Y+3) SUM1\nNear-Term Off-Peak Case: (Y+4) HRML\nLong-Term On-Peak Case: (Y+7) SUM1\nFor example, the following flat start cases would be developed during the period from July 2023 through January 2024: 2026 SUM1, 2027 HRML, and 2030 SUM1.  These cases could then be used for planning assessments performed in 2024.  The DWG may choose to develop dynamic flat start data sets for alternative cases that meet the same objectives with respect to facilitating the completion of NERC TPL planning assessments.\nAfter January 1st, 2015, ERCOT shall serve as the flat start coordinator for all DWG flat start cases.\nDynamic Data Updates\nEach DWG member shall review the dynamic data from the prior year for its portion of the ERCOT System and provide necessary updates according to the schedule established in section 4.1.1. The changes in the data must be identified and submitted with the updated data.\nData for mothballed units shall be retained. Obsolete data should be deleted or commented.\nOther revisions of data that should be submitted to the flat start coordinator include updates to the load model, Zsource corrections, generation netting, or any other modifications to the network necessary for dynamic studies.\nDynamic Data Screening\nThe DWG members should review the dynamic data for equipment connected to their system for completeness and applicability.  The data should be appropriate for the model, and the model should be appropriate for the equipment.  Before submitting data for inclusion in updated dynamic base cases, each DWG member should perform dynamic data screening.\nFlat Start Criteria\nDWG Flat Start cases shall:\nInitialize with no errors;\nDemonstrate that simulation output channels for frequency, voltage and power do not deviate from an acceptable range for a Twenty-second run with no disturbance.\nThe product of a successful flat start will be a planning model software simulation-ready base case (the unconverted base case) with its associated dynamic data files including user models (.dyr, .obj, .lib, and .dll files), stability data change documentation, python (.py) files and response files (.idv) files.  The product of a successful flat start also includes the steps taken to build the flat start case such as network model changes (i.e. changing the schedule of the North DC, tuning voltages, etc.).\nPost Flat Start Activities\nDistribution of Flat Start Results and the Dynamic Data Base\nUpon completion of each flat start, all dynamic data and final data files shall be posted on the ERCOT MIS so that it is accessible to all DWG members and to ERCOT.  This posting shall be within the schedule established by the DWG for the given flat start.\nStability Book\nThe Stability Book is an annual document used to record dynamic data changes and/or corrections required during the flat start processes.  The flat start coordinator shall prepare the annual stability book.  Recommendations to revise load flow data are also included in the book.  DWG Members are required to communicate these recommendations to other respective working groups, including Steady State Working Group, Operations Working Group, and Network Data Support Working Group, to eliminate recurring problems.\nThe following information is included in Stability Book:\nDeviation tables or plots of the flat start results are included to verify the successful completion of the flat start process.\nDynamic data.  This data is in the DOCU ALL PSS/E activity format.\nUnder frequency and under voltage load shedding relay data submitted by each of the appropriate DWG members.\nAdditional information identified for inclusion by Section 3.4\nDWG Coordination with the Steady State Working Group\nTo support coordination with the Steady State Working Group, Operations Working Group, and Network Data Support Working Group a list of changes made to the following steady-state power flow data shall be reported to the ERCOT Steady State Working Group representative:\nUnit MVA Base: this is also known as MBASE and is used as the base quantity for many dynamic model parameters associated with generating units.\nZsource: reactive machine impedance that is required to match the subtransient reactance specified in the dynamic generator model for proper initialization of dynamic simulations.\nERCOT shall compile the list of data changes following finalization of the flat start DWG shall coordinate with SSWG to assure that conflicting data is corrected during future SSWG case building activities.\nDWG Dynamic Contingency Assumptions List\nThe DWG shall construct a dynamic contingency assumptions list detailing contingency assumptions for each TSP for the purpose of screening studies conducted by ERCOT and the DWG members. ERCOT and the DWG members shall annually review and update the dynamic contingency assumption list. Upon completion of the annual review, ERCOT shall collect the contingency assumptions and submit the finalized dynamic contingency assumptions list to the DWG.\n\nThe assumptions shall include:\nBreaker trip time for normal clearing,\nBreaker trip time for delayed clearing due to stuck breaker\nBreaker trip time for delayed clearing due to relay failure\nRelay characteristic assumptions to assess generic apparent impedance swings that can trip any transmission system elements\nOther assumptions deemed necessary by DWG as specified during the annual review\nDWG Dynamic Contingency Database\nThe DWG shall prepare a Dynamic Contingency Database according to a standard spreadsheet format.  The spreadsheet format will be reviewed annually. In addition to the spreadsheet, DWG members can also provide their contingencies in python format if the spreadsheet is inadequate to accurately represent the contingencies (ex. contingencies based on detailed expansion of the station into node breaker). The dynamic contingency database and any additional contingencies provided in python will be posted on the ERCOT Market Information System (MIS) so that it is accessible to all DWG members and to ERCOT.\nOther DWG Activities\nEvent Simulation\nERCOT will compare dynamic system model performance to that of actual system response data in accordance with NERC MOD-033.  For a selected event, the affected TSP will provide actual measured system behavior data (or a written response that it does not have the requested data) to ERCOT within 30 calendar days of a written request.\nProcedure Manual Revision Guidelines\nThe DWG is responsible for maintaining and updating this Procedure Manual.  Revisions, additions and/or deletions to this Procedure Manual may be undertaken at such times that the DWG feels it is necessary due to changes in dynamic simulation software or to meet new and/or revised requirements of NERC, ERCOT, or any other organization having oversight or regulatory authority.\nAt least annually, the DWG chair shall request a thorough review of the current Procedure Manual for any needed revisions.  The notification will request that proposed revisions be submitted to the DWG chair (or the chair’s designate) for consolidation and distribution to all DWG members for comment and/or additional revision.\nThe DWG chair may seek approval of any revision, addition, or deletion to the Procedure Manual in the regular DWG meetings, or called special meeting as deemed necessary or requested by DWG membership.\nAll proposed Procedure Manual revisions shall be submitted to ROS for approval.  After ROS approval, the Procedure Manual will be publicly posted on the DWG webpage: https://www.ercot.com/committees/ros/dwg.\nRecommended DWG Study Methodologies\nNote: This section addresses, in part, requirements R4, R5 and R6 of NERC Standard TPL-001-4 and TPL-001-5.1 (effective July 1, 2023).\nVoltage stability margin, transient voltage criteria, and damping criteria are described in the ERCOT Planning Guide Section 4.\nVoltage Instability Identification in Stability Studies\nVoltage Instability is indicated by severely low bus voltage or bus voltage collapse.\nVoltage Instability could cause:\nMotor stalling leading to significant amount of customer initiated motor tripping.\nLoss of generator(s) due to low voltage\nVoltage collapse of an area\nCascading Identification in Stability Studies\nCascading Definition - Cascading is defined as the uncontrolled loss of any system facilities or load, whether because of thermal overload, voltage collapse, or loss of synchronism, except those occurring as a result of fault isolation. Cascading is indicated by one or more of the following conditions:\nUncontrolled sequential loss of generators\nUncontrolled sequential loss of load\nUncontrolled sequential loss of branches.\nCascading could cause conditions like:\nVoltage collapse of an area\nExpanding number of buses with voltage instability\nSystem islanding, frequency instability due to power-load unbalance\nNERC Definition: The uncontrolled successive loss of system elements triggered by an incident at any location. Cascading results in widespread electric service interruption that cannot be restrained from sequentially spreading beyond an area predetermined by studies.\nUncontrolled Islanding Identification in Stability Studies\nUncontrolled islanding is the separation and loss of synchronism between a portion of the interconnection and the remaining interconnected system.  Islanding originates with uncontrolled loss of branches, ending with the formation of sub-network islands.\nGenerators disconnected from the System by fault clearing action or by a RAS are not considered out of synchronism.  Similarly, islands formed from being disconnected from the System by fault clearing action or by a RAS are not considered an uncontrolled island.\nSub-network islands have the following characteristics:\nThe sub-network islands have both generation and load to support the continuation of the island.\nThe sub-networks formed are not connected to each other.\nUncontrolled islanding in a screening study could cause:\nOut-of-step generators\nOff-nominal frequency disturbances\nEventual collapse of an island due to frequency or voltage instabilities caused by the generation-load unbalance in the sub-network island.\nGenerator Protection Assumptions\nNote: This section addresses, in part, requirements R3.3.1.1 and R4.3.1.2 of NERC Standard TPL-001-4 and TPL-001-5.1 (effective July 1, 2023).\n\nIf dynamic models are not provided for Generator protection schemes, generic generator protection may be assumed for screening purposes\nFor synchronous generators, a rotor angle swing greater than 180 degrees may be considered an unstable generator.\nGenerators may be assumed to be compliant with the minimum requirements of Section 2.9 Voltage Ride-Through Requirements for Generation Resources of the ERCOT Nodal Operating Guide.\nGenerators may be assumed to be compliant with the minimum requirements of Section 2.6 Requirements for Under/Over-Frequency Relaying of the ERCOT Nodal Operating Guide."
  }
]