[
  {
    "id": "RI_1",
    "text": "Taylor, Texas 76574\n(512) 248-6800\nercot.com\nRESOURCE INTERCONNECTION HANDBOOK\nVersion 1.94\n\nERCOT\n3/01/2023\n\nThis handbook is intended to provide a general description of ERCOT’s generator interconnection process for current and potential ERCOT Market Participants. This handbook is not a replacement for the ERCOT Protocols, Operating Guides, Planning Guide, or Other Binding Documents. In the event of any conflict, the ERCOT Protocols, Market Guides, and/or Other Binding Documents (OBDs) shall control.\nContents\nAcronyms and Abbreviations\t6\nResource Interconnection Handbook Purpose\t7\nGeneration Interconnection Overview\t7\nGeneration Interconnection Process Overview\t9\nSTAGE 1 – Generation Interconnection Request Application to QSA\t11\nGeneration Interconnection or Change Request Application and Fees\t12\nGIM (GINR) Applications for Multiple Technology Types\t17\nGIM (GINR) Applications for Multiple Project Phases or Long Commissioning\t17\nLone Star Infrastructure Protection Act RFI\t18\nSecurity Screening Study\t18\nFull Interconnection Study (FIS)\t18\nFIS Scope Meeting\t21\nFIS Study Process\t21\nSubsynchronous Resonance Study (SSR)\t21\nStandard Generation Interconnection Agreement (SGIA)\t22\nPlanning Guide section 6.9\t22\nReactive Study Requirements\t22\nCompliance with Operational Standards Review\t23\nQuarterly Stability Assessment (QSA)\t23\nSmall Generation Process:\t25\nSTAGE 2 - Registration and Modeling\t27\nRegistering as a Resource Entity\t27\nRIOO Resource Data Entry (Substation Data)\t27\nNetwork Modeling Requirements\t29\nERCOT Polled-Settlement Meter and ESI ID Requirements\t31\nTelemetry and ICCP Requirements\t31\nSTAGE 3: Energization, Synchronization and Commissioning\t33\nFinal Compliance with Operational Standards\t33\nBackground\t33\nERCOT New Generator Commissioning Checklist\t34\nRIOO-IS Commissioning Planned Dates\t34\nCommissioning Plan Template\t34\nERCOT 90-day expectation for the Commissioning Process of a Resource\t35\nOutage Scheduler\t35\nCommissioning Process\t35\nChecklist submittals and approval:\t36\nAdditional Details on Commissioning Checklist Submissions\t36\nBase Point, Reactive Power Capability, VSS, AVR, PFR and PSS Testing\t38\nBase Point following during Curtailment – IRRs and IRR Groups\t38\nIRR Unit Curtailment Testing (Note:  Use the following process for an individual IRR that is not in an IRR Group)\t38\nIRR Group Curtailment Testing (Note: The IRR Group is being curtailed at each step below; these are not individual unit curtailments)\t39\nReactive Power Capability\t40\nVoltage Support Service (VSS)\t40\nAutomatic Voltage Regulator (AVR)\t41\nPrimary Frequency Response (PFR)\t43\nPower System Stabilizer (PSS)\t43\nGenerator Status during the Commissioning Process - ONTEST, ON and OUT Status\t43\nOperation Requirement of Data Center Loads and/or PUN loads with IRR Generation\t44\nAPPENDIX A: Helpful Resources and Links\t45\nAPPENDIX B: LIST OF ERCOT FORMS FOR INTERCONNECTION PROCESS\t46\nAPPENDIX C: NAMING CONVENTIONS\t47\nAPPENDIX D:  LARGE GEN TIMELINE 1\t48\nAPPENDIX E:  LARGE GEN TIMELINE 2\t49\nAPPENDIX F:  SMALL GEN TIMELINE 1\t50\nAPPENDIX G: SMALL GEN TIMELINE 2\t51\nAPPENDIX H:  SMALL GEN PROCESS FLOWCHART (Zoom In for more details)\t52\nAPPENDIX I:  GIM (GINR) TABULAR TIMELINE:\t53\nAPPENDIX J:  FIS Review Checklist – dated 8/3/2020\t54\nAPPENDIX K:  Small Gen Review Checklist – Dated 1/22/2022:\t60\nAPPENDIX L:  Template for RE’s Wanting to Submit Model Information\t66\nAPPENDIX M:  REVISIONS\t68\nAPPENDIX N:  Resource Status Codes (ICCP Handbook 2020)\t70\n \n \nAcronyms and Abbreviations \n\nAcronym\tDefinition\nAVR\tAutomatic Voltage Regulator\nCAMR\tCollaborative Action Modeling Request\nDESR\tDistribution Energy Storage Resource\nDGR\tDistribution Generation Resource\nESI ID\tElectric Service Identifier\nFIS\tFull Interconnection Study\nGINR\tGeneration Interconnection or Change Request\nGIM\tGeneration Interconnection or Modification\nGIM Coordinator\tERCOT Resource Integration Analyst that creates the interconnection record.\nIE\tInterconnecting Entity\nME\tMeter Engineering\nNOIE\tNon-Opt-In Entity\nNOMCR\tNetwork Operations Model Change Request\nPFR\tPrimary Frequency Response\nPLD\tProduction Load Date\nPMCR\tPlanning Model Change Request\nPOI\tPoint of Interconnection\nPOIB\tPoint of Interconnection Bus\nPSS\tPower System Stabilizer\nPUCT\tPublic Utility Commission of Texas\nQSA\tQuarterly Stability Assessment\nQSE\tQualified Scheduling Entity\nRARF\tResource Asset Registration Form\nRE\tResource Entity\nRI\tERCOT Resource Integration Department\nRIOO-IS\tResource Interconnection and On-going Operations - Interconnection Services\nRIOO-RS\tResource Interconnection and On-going Operations - Resource Services\nSCADA\tSupervisory Control and Data Acquisition\nSCED\tSecurity-Constrained Economic Dispatch\nSGIA\tStandard Generation Interconnection Agreement (commonly referred to as “IA”)\nSSS\tSecurity Screening Study\nSSR\tSubsynchronous Resonance\nTSP/TDSP\tTransmission and/or Distribution Service Provider\n \nResource Interconnection Handbook Purpose\nThe goal of the Resource Interconnection Handbook is to provide an overview of the process an Interconnecting Entity must follow when it is required to enter the Generation Interconnection or Modification (GIM) Process either to commission new generation to the ERCOT System or to modify existing generation connected to the ERCOT System as described in Planning Guide section 5.2.1. When revisions to this document are made by ERCOT, a market notice will be posted on the Market Information System and the updated document will be posted to the ERCOT website.\t\nLink to the Resource Integration Page:  https://www.ercot.com/services/rq/integration. \nGeneration Interconnection Overview \nAll entities that own generation connected to the ERCOT System at or above 1 MW must be registered as a Resource Entity (RE). The RE must register each generator through the ERCOT registration process by submitting the required data using the applicable resource registration process. The resource registration process incorporates electronic and manual processes to submit, validate, and approve the resource data that is used in planning, market and operations systems as defined in the ERCOT Protocols and Market Guides.\nConnecting new or modified generation to the grid requires that QSEs, REs, IEs and TSPs provide ERCOT with accurate engineering models and telemetry of the new or modified generator and all associated transmission facilities as required for the Network Operations Model.  Adding information to the ERCOT Network Operations Model is controlled by protocol 3.10. The registration and modeling process ensures that data submitted by equipment owners is accurately modeled and that communications between ERCOT systems and the new generator’s systems through the QSE are in place before the new or modified generation is commissioned.\nDuring the interconnection process, the ERCOT Resource Integration department is the primary contact for an Interconnecting Entity (IE). ERCOT Resource Integration is responsible for tracking each generator through the stages of the interconnection process and facilitating interactions between ERCOT, TSPs and REs as well as resolution of any issues that may arise. Each RE is assigned an Account Manager upon registration as a Market Participant who serves as its primary contact for operational interactions with ERCOT after commissioning.  Account Managers will guide each RE through its preparations for market operations while the IE completes the interconnection process as the generator is energized, synchronized, and approved as ready to be commissioned for participation in the ERCOT market.\nERCOT will work with the IE to establish the Production Load Date (PLD) which is based on the Initial Energization date of the Point of Interconnection (POI) and the Initial Synchronization date of the generator. The energization date of the POI needs to be coordinated with the TSP’s PLD for their side of the POI to allow time to resolve issues with telemetry or other operational issues before synchronization.  The POI must be a new or existing station with breakers (no hard taps) capable of interrupting fault current to sectionalize the transmission lines connecting the station to the rest of the ERCOT System.  The POI must also be connected to the ERCOT System where there are breakers and not, for example, connected to an existing line that is tapped off another transmission line.  \nERCOT recommends that the potential RE register as a Market Participant at least 140 days prior to the date that the new or modified generator is to be added to the Network Operations Model (PLD). The Resource Entity should also complete the fields required for full registration in RIOO-IS Substation Details for the Network Operations Model at least 120 days prior to the desired Production Load Date (PLD) and inform ERCOT that it had been submitted to allow time for revisions to help ensure being able to meet the submittal date for the PLD shown in Protocol 3.10.1. \nGeneration Interconnection Process Overview\nThe generation interconnection process described in this handbook has been divided into the following three stages for the purpose of defining the interactions between the developer/owner of the generation resource, ERCOT and TSPs:\n\nStage 1:  Interconnection Request Application to Quarterly Stability Assessment\nStage 2:  Registration and Modeling\nStage 3:  Energization, Synchronization and Commissioning\n\t\tFigure 1: Generation Resource Interconnection Process Flow\n \nIn Stage 1, the IE submits a GIM application to ERCOT for any generation that meets the applicability requirements in section 5.2.1 of the ERCOT Planning Guides using RIOO-IS.  ERCOT will review the RIOO submittal and accept or return the application within 10 business days after which the status of the GIM will change to “In Progress” or ”Planned” (See Table 1, the IE will see the status of “In Progress” while ERCOT will see the status of “Planned”).  ERCOT will conduct a Security Screening Study (SSS) to evaluate the proposed generator’s effect on the ERCOT transmission system. ERCOT will post the SSS to the RIOO system upon completion.  Prior to or no later than 180 days after completion of the SSS, the IE will submit a RIOO change request to attach the Proof of Site Control and enter the Energization, Sychronization, and Commercial Operations Date along with the required data in Substation Details to initiate the Full Interconnection Study process that is performed by the TSP owning the POI facilities.  The IE shall inform ERCOT by email when the data required for the FIS has been submitted.  If the IE does not request the FIS within 180 days of the date ERCOT notifies the IE of the Security Screening Study results, the GIM (GINR) application will be considered withdrawn by the IE and cancelled by ERCOT.\nOnce all FIS studies are completed, a Standard Generation Interconnection Agreement must be executed with the TSP within 180 days for the GIM to continue. Failure to meet this requirement will result in cancellation of the GIM by ERCOT.  Upon completion of the SGIA, generation data required by the Resource Registration Glossary – Planning Model column shall be supplied by the IE to ERCOT using RIOO-IS. The IE shall provide to the TSP the Notice to Proceed with construction and the full financial security required to fund the interconnection and the TSP will provide these dates in RIOO-IS.  The IE must also provide the Department of Defense Notification attestation in RIOO-IS. ERCOT then models the new generation in planning base cases built by the Steady State Working Group (SSWG) once it meets Planning Guide section 6.9.\nOnce the Interconnecting Entity meets Planning Guide section 6.9, ERCOT performs a Compliance with Operational Standards review in accordance with Protocol 16.5 (3) to determine if the generator can fully comply with ERCOT Operating Standards based on the submitted FIS, SGIA and resource data.  The Quarterly Stability Assessment is used to assess the stability impact of the proposed resource alongside other resources that are synchronizing in the same quarter and determine if mitigation plans are needed before the generator is allowed to synchronize to the ERCOT system.   \nIn Stage 2, the Resource Entity registers as a Market Participant with ERCOT. Once registered, the Resource Entity is responsible for registering the generator by submitting the resource data required by the Resource Registration Glossary – Full Registration column in RIOO-IS.  ERCOT models the new generator in the Network Operations Model from the resource data supplied to reflect the addition of the new generation and related facilities. The RE will need to coordinate with the TSP to make sure the TSP facilities are also modeled for the same PLD.\nERCOT will also review the proposed telemetry points list required to establish real-time communication and control between ERCOT and the QSE. ERCOT works directly with the TSPs and REs to establish the necessary ERCOT Polled Settlement (EPS) meter communication points which allows gathering of 15-minute data for settlements.\nIn Stage 3, ERCOT reviews the generator’s Commissioning Plan Template, and approves the following 3 checklist parts described in the New Generator Commissioning Checklist:\n•\tPart 1:  Request to Energize\n•\tPart 2:  Request for Initial Synchronization (or Parts 2a and 2b for WGR’s meeting applicability of Planning Guide section 5.2.1(1)(c)(ii).\n•\tPart 3:  Request to Commission a Resource\nFor the generator to be commissioned and approved for participation in ERCOT market operations, it must demonstrate that it can satisfy ERCOT’s requirements for Reactive Power (both leading and lagging), Automatic Voltage Regulator (AVR), Primary Frequency Response (PFR), Power System Stabilizer (PSS), and follow SCED instructions as applicable to the generation type and registration.\nSee the Normal and Fast timelines in appendices D and E.\nIE sign up guide:  https://www.ercot.com/files/docs/2022/01/14/IE-SignUp-Guide-for-RIOO-Services.pdf\nRE sign up guide:  https://www.ercot.com/files/docs/2022/01/14/RE-SignUp-Guide-for-RIOO-Services.pdf\nTDSP sign up guide:  https://www.ercot.com/files/docs/2022/01/14/TSP-Sign-Up-for-RIOO-Services.pdf\nManaging your RIOO account:  https://www.ercot.com/files/docs/2022/01/14/Managing-Your-RIOO-Services-User-Account.pdf\nSTAGE 1 – Generation Interconnection Request Application to QSA\nExamples of Applicability (Planning Guide Section 5):  1 - 9.99 MW is Small Gen, 10+ MW is Large Gen.\nGeneration Interconnection or Change Request Application and Fees\nAll IEs seeking to interconnect new generation or modify existing generation connected to the ERCOT system 1 MW or greater in accordance with Planning Guide section 5.2.1 are required to follow the Generation Interconnection or Modification (GIM) process.  \nTo begin the GIM process and initiate the Security Screening Study or a simultaneous Security Screening Study and Full Interconnect Study, IEs must initiate an application using the RIOO-IS system.  Information on RIOO-IS access and use can be found on-line as shown with the numbered icons below.\n1.\tFigure 1 shows how to launch the RIOO-IS application.  Best browser to use is Chrome.\n2.\tFigure 2 shows Related content to help IEs and TSPs sign-up to create an account and to use the application with user guides specific to IEs and TSPs.  Note that TSPs must follow the RIOO-IS TSP Sign-Up Reference very carefully to create a TSP account which will allow them to see all GIM (GINR)s.\nFigure 1  ERCOT.com bottom of page link to launch RIOO-IS\nFigure 2:  Resource Integration page for related content to help IE’s and TSP’s\nIEs should see a page like that below if they have signed up correctly.  Note the “Start New INR Request” button in the top right.  TSPs should not see this button and if they do, they should submit an ERCOT Helpdesk ticket to remove their Auth0 account.  The “Start New INR Request” button is a drop down with a choice to start as either an IE or a RE.  Load Resources need to start as a RE, as should Small Generation projects because they will need to submit a full registration RARF right away.\nFigure 3:  IE RIOO page after signing in After clicking the “Start New INR Request” button, IEs should see the following screen showing the action items to choose the size and whether the connection will be transmission or distribution.  \nFigure 4: The IE screen to start an INR.  Choose the size of your project \nRE’s will see a similar screen, but first will have to select the company that they want to use to create the INR if more than one company is listed.  For a company to be listed, a RE will need to have the role RIOORS_M_OPERATOR listed in their MPIM for the companies DUNS number.  Contact your USA to have that role added.\nFigure 5 The RE screen to start an INR, select the company from the drop down and choose the size of your project \nFigure 6 Once the size is chosen, new options appear\nFrom the initial GIM (GINR) application submittal until the IE is assigned a Resource Integration (RI) Engineer, IEs should direct questions about the generator interconnection or change process itself or primary contact changes to  ResourceIntegrationDepartment@ercot.com.  RIOO-IS access issues should be submitted to the ERCOT Helpdesk or RIOO-HELP@ercot.com.  \nWhen an ERCOT RI Engineer is assigned to the GIM (GINR) application, the RI Engineer will notify the IE with their contact information and inform them that they will oversee their interconnection application and be available to answer questions. \n \nFigure 7 MW Size Entry\nThe MW values entered into the Maximum Generator MW, Maximum Summer Generator MW, and Maximum Winter Generator MW in the RIOO-IS screen above should be the MW value at the generator terminals as modeled in the ERCOT Network Operations Model (typically 34.5 kV bus for IRRs and IBRs), not the Point of Interconnection Bus.  For projects meeting PG 5.2.1(1)(c)(ii), the Maximum and Maximum Summer Generator MW are the same (except for thermal units) and the Maximum Winter Generator MW is set to the delta MW value caused by the changes being done in the project.\nERCOT will notify the IE within 10 Business days if any part of the application requirements are not complete or the appropriate fee was not submitted. ERCOT will immediately contact the IE if more information is needed, and the IE will have 10 Business Days to respond without impacting the timeline.  If the IE does not respond within 10 Business Days, ERCOT shall notify the IE that the request has been deemed incomplete and rejected. \nWhen the application is deemed complete, ERCOT will change the status of the completed GIM (GINR) application within 10 Business Days to “In progress”/”Planned”.  The IE will see the status of “In Progress”, while ERCOT will see the status of “Planned”.  Other statuses are shown in the table below:\n\t(Changed from new) - is in the status of new until ERCOT coordinator moves it to incomplete. \n•\t – with a credit card and we have automatic confirmed payment\n•\t – is manually reconciled by the coordinator. The coordinator will have access to the banking system and can move the INR to incomplete when the check clears.  \n – this is an ERCOT internal status when in this status we display to the IE the following labels instead:\n•\t on Your INR Request – when ERCOT requested a change from the IE using the toggle button in the ERCOT information section of the INR review\n•\tSubmitted to ERCOT– otherwise it says submitted during ERCOT review of paperwork\n– stays in planned until it is commissioned, canceled, or suspended during a sale. We display labels to the IE user of:\n•\t - when no CR is in progress has the label of in progress.\n•\t – when there is a CR in progress will go back to planned when the CR is resolved by either an IE cancel or ERCOT or IE merge. \n•\t – waiting for check to clear for ERCOT Stability Modeling Fee. – the IE as requested an FIS and paid by check \n•\t – when ercot has responded to the IE that not all of their changes were excepted, the IE user can either acknowledge or cancel the feedback from ercot.\n – the IE has sent in a CR for change of owner, the system has automatically updated the status to suspend. The label that is displayed to the IE is\n•\t – displayed until the IE send in a CR with a new RARF, ercot will manually move the status from suspended to planned. \n – is displayed when an INR is canceled\n– is displayed when ercot changes the status to operational.\n\nGIM (GINR) Status\tSaved – is set to Saved until the IE submits it to ERCOT\nSubmitted (changed from new) - is in the status of new until ERCOT coordinator moves it to incomplete. The IE will see the status of:\n•\tINR Submitted to ERCOT – with a credit card and we have automatic confirmed payment\n•\tINR Submitted to ERCOT - waiting for check to clear – is manually reconciled by the coordinator. The coordinator will have access to the banking system and can move the INR to incomplete when the check clears.  \nIncomplete – this is an ERCOT internal status when in this status we display to the IE the following labels instead:\n•\tUpdates Needed on Your INR Request – when ERCOT requested a change from the IE using the toggle button in the ERCOT information section of the INR review\n•\tINR Submitted to ERCOT– otherwise it says submitted during ERCOT review of paperwork\nPlanned – stays in planned until it is commissioned, canceled, or suspended during a sale. The IE will see:\n•\tIn Progress - when no CR is in progress has the label of in progress.\n•\tChange Request Submitted to ERCOT – when there is a CR in progress will go back to planned when the CR is resolved by either an IE cancel or ERCOT or IE merge. \n•\tChange Request Submitted to ERCOT – waiting for check to clear for ERCOT Stability Modeling Fee. – the IE as requested an FIS and paid by check \n•\tReview ERCOT Feedback – when ERCOT has responded to the IE that not all their changes were accepted, the IE user can either acknowledge or cancel the feedback from ERCOT.\nSuspended (also used for “Inactive”) – the IE has sent in a CR for change of owner or have requested the project be put in Inactive status, the system has automatically updated the status to suspended. The label that is displayed to the IE is\n•\tSuspended for Ownership Determination – displayed until the IE send in a CR with a new RARF, ERCOT will manually move the status from suspended to planned. \n•\t(Temporary) Used to denote “INACTIVE” status but IE will still see “Suspended for Ownership Determination”.  The project is Inactive.\nCanceled – is displayed when an INR is canceled\nOperational – is displayed when ERCOT changes the status to operational.\nTable 1: ERCOT/IE Status Mapping \nGIM (GINR) Applications for Multiple Technology Types\nSeparate GIM applications should be submitted for each technology type in the interconnection request.  For example, if an interconnection request includes solar and battery facilities, two GIM applications should be submitted.  ERCOT and the interconnecting TSP will hold a single FIS kickoff meeting for both INR numbers and the IE and the TSP may sign a single SGIA referring to both INR numbers.  Both GIMs will be included in the SSS and FIS.\nGIM (GINR) Applications for Multiple Project Phases or Long Commissioning \nA separate GIM application should be submitted for Projects being built in phases or over a long period of time.  ERCOT desires the time between Initial Synchronization and Resource Commissioning Date to be 120 days or less.  Projects requiring more time should be split into separate GIM’s as soon as it is first known.  \nFor projects requiring multiple INR numbers, the IE must ensure that each of the modeled generator’s capacity at a given point in time is completely contained in a single INR number.  It is expected that all modeled generators whose capacity is included in the same INR number must all be approved for Resource Commissioning (Part 3) on the same day.\nLone Star Infrastructure Protection Act RFI \nDuring the initial application stage for both Small and Large generation, the following screen will appear.    The blue text concerning the Lone Star Infrastructure Protection Act can be ignored as an attestation will have to be e-signed later in the process before payment.\nFigure 8:  The text in the blue box can be ignored concerning the Lone Star Infrastructure Protection Act Screen\nSecurity Screening Study\nFor each GIM request submitted, ERCOT will conduct a high-level, steady-state Security Screening Study (SSS), including power-flow and transfer studies, based on the proposed Commercial Operation Date (COD) and a single Point of Interconnection (POI).  The main purpose of the study is to provide an indication of the level at which the proposed generation can expect to operate simultaneously with other known generation in the area before significant transmission additions or enhancements may be required.\nERCOT is allowed 90 days to perform the Screening Study.  During this time, ERCOT will contact the IE if additional information is needed, and the IE will have 10 Business Days to respond without impacting the study timeline.\nDuring the Security Screening Study, ERCOT may consult with affected TSPs to identify the most efficient means of providing transmission service.  The TSP may suggest an alternate POI which will be allowed and not force the IE to submit another GIM.\nUpon completion of the Security Screening Study, ERCOT will share the report with the IE using the RIOO-IS system.  The report shall indicate study assumptions, transfer analysis results, and whether a SSR study is required.  See below for more information on SSR.\nWhen a GIM is “Cancelled” by ERCOT or “Withdrawn” by the IE, if the IE desires to proceed with the project at a later date, they must submit a new GIM application.  The IE may use INACTIVE status to gain time once the FIS has been completed.\nFull Interconnection Study (FIS) \nWithin 180 days of the date ERCOT notifies the IE of the SSS results, the IE must begin the FIS Request process to indicate its desire to pursue a Full Interconnection Study, or the GIM will be cancelled.  This is done by:\n1.\t Submitting a change request on the RIOO-IS system to add the \na.\tEnergization date\nb.\tSynchronization date \nc.\tAttach the proof of site control\nd.\tIf a MW size change is desired, change the MW size of your project and wait for this CR to be approved before proceeding to step 2.\n2.\tEntering the required resource data required for the FIS Proof of Site Control and resource data with data required by the Resource Registration Glossary – Full Interconnect Study (FIS)\nAfter accepting the change request containing the proof of site control attachment and reviewing the resource data submitted by the IE, ERCOT will check the submissions and approve the FIS Application.  When the FIS Application is approved, RIOO-IS will generate an email to the Lead TSP to begin initiation and coordination of the FIS Kick-off meeting. \nIMPORTANT:  If you plan to reduce or increase the MW size of your project, it must be done before entry of Resource data for the FIS.  Change the MW size with the CR to change the dates and add proof of site control.  Payment will not reflect the new size if this CR is not submitted and approved by ERCOT.\nFigure 9: To request a FIS study, click “Add a Change Request” in the Basic Project Information block to enter the Energization and Synchronization dates and attach the proof of site control. The resource data also needs to be added by clicking the “Let’s get Started” button in the Substation Details block.\nThe IE can begin the FIS Request by entering data for only the Steady State study, Short Circuit study, or the Stability and Dynamics study or any combination of the three studies.  RIOO will then indicate each data field that is required for the chosen Level of Commitment (LOC).\nFigure 10 RIOO screen to select Level of Comittment\nFigure 11 RIOO Screen showing the data fields required for the chosen level of comittment\nThe IE will pay FIS fees to both ERCOT using RIOO-IS, as specified in the ERCOT Fee Schedule, and to the TSP performing the studies in accordance with an agreement with the TSP.  Fees paid to the TSP should be agreed on and specified in the FIS Scope Agreement.  ERCOT is not a party to the FIS Scope Agreement.\nAs discussed in Section 5 of the Planning Guide, the FIS process consists of a set of steady-state, dynamic, short-circuit, and facility studies.  The FIS studies are not intended to ensure the deliverability of power from the proposed generation to the market or to ensure that the proposed generation does not experience any congestion-related curtailments in real-time.\nBecause the FIS is generally the critical path item in the GIM process with no defined length to complete, ERCOT recommends that a timetable for the FIS be developed and included in the FIS study scope agreement.  \nSee Planning Guide section 5.3.2, Full Interconnection Study Request, for more information regarding the FIS.\nFIS Scope Meeting \nWithin 10 Business Days of receiving the RIOO-IS data required to proceed with the FIS from the IE, ERCOT will designate the lead TSP for the FIS.  The selection of the lead TSP will be based upon a preliminary analysis of the most likely Point of Interconnection (POI).  The lead TSP will then arrange a FIS kick-off meeting with ERCOT, the IE and other TSPs desiring to participate in the study.  During the meeting, the IE will discuss the GIM application and the TSP will discuss the overall scope, timetable of activities, studies being performed, anticipated facilities needed, etc.  ERCOT will discuss the Security Screening Study results.\nThe date of the FIS kick-off meeting starts the 60-calendar day clock within which the IE and TSP should reach an agreement on the FIS scope.  ERCOT will attempt to mediate if an agreement cannot be reached within that period.  After the 60-day period, if no agreement is reached, the GIM may be terminated.   \nFIS Study Process\nBased on the overall scope established during the FIS kick-off meeting, the lead TSP shall use the data provided by ERCOT and the IE to develop and study the existing and future ERCOT system to determine the generator’s reliability impact at the proposed POI.  The TSP(s) will examine normal transmission operating conditions as well as potentially adverse, or contingency, conditions. \nIn comparing interconnection alternatives, the TSP(s) will consider such information as interconnection cost and construction schedule, impact to short and long-range reliability, operational flexibility, and compatibility with future transmission plans. The TSP(s) may also consider interconnection alternatives not suggested by the IE or ERCOT.  ERCOT will perform an independent Economic Study for informational purposes if the TSP determines in the facility study that the estimated transmission interconnection costs could exceed $25 million dollars.\nFollowing the completion and review of the FIS studies by the TSPs and approval by ERCOT, the report will be deemed complete, and the IE and TSP may execute a SGIA.\nSubsynchronous Resonance Study (SSR)\nThe ERCOT Protocols section 3.22 contains detailed definitions and information pertaining to the Subsynchronous Resonance, countermeasure, protection, mitigation, etc. terminology used in this section.\nIf ERCOT determines during the Security Screening Study topology-check that the generator may be vulnerable to SSR, the lead TSP shall be notified that a SSR study is required.  The SSR study scope will be shared between ERCOT, TSPs and the IE and discussed during the FIS kick-off meeting, but the study itself is not part of the FIS.  \nERCOT will review the SSR study for approval.  If the study results determine that the Resource is vulnerable to SSR, the IE shall be responsible for either installing the appropriate SSR countermeasures or developing a SSR Mitigation Plan.  The ERCOT-approved SSR Protection scheme or Mitigation Plan must be installed and operational prior to Initial Synchronization."
  },
  {
    "id": "RI_2",
    "text": "Standard Generation Interconnection Agreement (SGIA)\nShould the IE decide to proceed with the construction and completion of the proposed generation project, they shall execute a SGIA with the respective TSP.  ERCOT is not a party to the agreement.\nThe SGIA must be signed by all parties within 180 days following the completion of the FIS or, following notification by ERCOT, the GIM will be cancelled unless the IE requests and is granted an exception before expiration of the 180 days.  The exception will require that work has begun on the IA by both the IE and TSP and is confirmed by email by the TSP.\nIn certain situations, the IE and the TSP may agree to allow the TSP to begin design or construction of facilities prior to the execution of the SGIA, or to allow the IE to delay issuing a Notice to Proceed until sometime after the SGIA is signed.\nPlanning Guide section 6.9\nMeeting the requirements of Planning Guide section 6.9 is an important milestone in the GIM process.  It is required to qualify for entry in the Quarterly Stability Assessment (QSA) and for submittal into the Network Operations Model.  It is also required to begin the Protocol section 16.5 Compliance with Operational Standards Review which will be reviewed prior to Initial Synchronization of the generator.  Generator’s designated as a small generator need to meet P.G. 6.9(3).\nReactive Study Requirements\nThe Interconnecting Entity is required to submit to ERCOT a reactive study that provides an engineering analysis of the reactive capability of the proposed interconnected generation facilities. This study shall include the list of equipment and systems that are to be installed to meet ERCOT reactive support requirements. It is recommended that the Interconnecting Entity incorporate in their project plan at least one month for ERCOT to review and approve the study with consideration for lead-time necessary for procurement of associated equipment. New generation facilities adding reactive equipment, in addition to the generation’s reactive capability specified in the ERCOT approved reactive study, shall have the reactive equipment installed in the field and ready to be placed in service at the time of Initial Synchronization. Protocol Section 3.15 Voltage Support provides more information about reactive requirements.\nThe Reactive Study is a requirement for the Quarterly Stability Assessment (QSA). \nCompliance with Operational Standards Review\nAfter the SGIA is signed and Planning Guide section 6.9 is met, ERCOT will begin the Protocol section 16.5 (3) review and assess whether the proposed generator would violate any operational standards as established in the Protocols, Operating Guides, Market Guides or Other Binding Documents.  \nERCOT has 90-days from the date that PG 6.9 was met to complete its review and provide the IE a written determination of whether the proposed system design complies with the operational standards. \nIf, based on the information contained in the FIS, IA, RARF and other submitted data, ERCOT determines that the Resource does not meet, or cannot determine whether the Resource will meet, the operational standards, ERCOT will provide a written document to the IE explaining the determination.  Additional data may have to be provided to ERCOT by updating the RARF or other required studies or documents.  Final determination of compliance with operational standards will occur during the Stage 3 process and is needed prior to synchronization.\nQuarterly Stability Assessment (QSA)\nERCOT conducts a stability assessment every three months to assess the impact of planned new or modified generation proposing to synchronize to the ERCOT System five to seven months in the future as shown in PG 5.3.5, ERCOT Quarterly Stability Assessment, and repeated in the table below.  The QSA assesses the impact of proposed generation and determines if mitigation plans are required before the generator can synchronize to the ERCOT grid.\nGeneration not included in the quarter shown in the Initial Synchronization Quarter column in the table below will not be eligible for Initial Synchronization during that three-month period:\nGeneration Resource Initial Synchronization Quarter\tLast Day for an IE to meet prerequisites as listed below\tCompletion of Quarterly Stability Assessment\nUpcoming January, February, March\tPrior August 1\tEnd of October\nUpcoming April, May, June\tPrior November 1\tEnd of January\nUpcoming July, August, September\tPrior February 1\tEnd of April\nUpcoming October, November, December\tPrior May 1\tEnd of July\nThe IE must have met the following requirements before being allowed to synchronize new or modified generation: \n•\tCompleted the requirements of Planning Guide Section 6.9, Addition of Proposed Generation to the Planning Models. \n•\tCompleted the following: \n•\tFIS studies; \n•\tReactive Power Study; \n•\tSSR study if required;\n•\tSystem improvements or mitigation plans that were identified in studies\n•\tInitial Compliance with Operational Standards review.\nThe summary results of the Quarterly Assessment will be posted to the MIS within ten days of completion.  Please refer to Planning Guide section 5.3.5 for detailed information pertaining to the QSA process. \nSmall Generation Process:\nThe Small Generation process is governed by Planning Guide Section 5.4.  \nA flow chart with more details of the Small Generation process flow is in Appendix H.  An example of the Small Gen Checklist is in Appendix K.\nRIOO-IS Small Generation Initial Application Checks:\n•\tOne-line diagram (Need the Load Transformer name on the One-Line)\n•\tValid Load/Load Transformer information in RIOO-IS \n•\tSite Photos, .kmz files, and/or Maps \n•\tProof of Site Control\n•\tSigned Declaration of Department of Defense (DOD) Notification \n•\tPayment for Small Gen application  \nSmall Generator Review Meetings.  \nThese meetings are optional but are HIGHLY RECOMMENDED for new IEs or for an IE submitting a Small Generation application for the first time. The IE must request these meetings for any Small Generator interconnection request if they desire a meeting.  (These are optional as per Planning Guide Section 5.4.1) \nSmall Gen Application Information (Planning Guide 5.4):\nIn addition to the above items, the following items / studies are required to submit the full Registration Level RARF in accordance with PG 5.4.3, Review and Approval to Submit Model Information. Please coordinate with your TDSP:\n•\tInitial RARF – Uploaded to RIOO by IE/RE (See the RARF Glossary for all required fields and data for Registration purposes)\n•\tInclude the TDSP Station Name and Code for the Resource Site Name/Code in the General Site ESIID Form. (Resource Site/Station Code must be 8 digits)\n•\tInverter and Technology data sheets and specs embedded to Gen Form – Dynamic Data tab\n•\tAll Operation Limitations should be reflected in Gen Form – Operation Limitation tab\n•\tOnly the Station tab information is required in the Transmission Form.  One-Line and Transformer Test Report tabs are still used.\n•\tInclude Load Resource Form\n•\tSystem Impact Study – Conducted by TDSP (Operating Guide Section 2.9 [VRT], Operating Guide Section 2.6 and 2.9 [FRT and VRT] and Planning Guide Section 5.4.2)\n•\tVoltage Ride through (VRT)\n•\tFrequency Ride through (FRT)\n•\tOver/Under Frequency relaying\n•\tPrimary Frequency Response \n•\tDGR/DESR limitations (Min/Max MW charge/discharge and ramp rates limits)\n•\tConfirmation that TDSP’s system will not preclude compliance with ERCOT’s requirements\n•\tOperation Limitations to the DGR/DESR (If any) – Provided by TDSP via a Change Request in RIOO-IS (Planning Guide Section 5.4.2)\n•\tConfirmation that this DGR/DESR will not be a part of a Load Shedding scheme.  Line cannot be subject to a manual or automatic disconnection by the DSP, TSP, or TO as part of any under-frequency, under-voltage, or manual load shed scheme – Provided by TDSP via a Change Request in RIOO-IS (Protocol Section 3.8.6)\n•\tConfirmation the IE / RE has provided financial security sufficient to fund the Required Distribution System Upgrades identified by the TDSP (if any) – provided by TDSP via a Change Request in RIOO-IS (Planning Guide Section 5.4.2)\n•\tFully Executed and Funded IA – Singed by TDSP and IE/RE, and submitted via a Change Request in RIOO-IS by the TDSP (Planning Guide Section 5)\n•\tFinancial security to fund system upgrades (if any)\n•\tNotice to proceed\nIn order for ERCOT to approve the Registration level resource data in RIOO, all of these conditions described above must be met before ERCOT gives Approval to Submit Model Information. (Planning Guide Section 5.4.3).\nOther Information and Links:\nFor more information regarding this process.  Please see the attached presentations.  Small Gen uses a System Impact Study.  Here is some additional information that may help you with this process.  Here are some links you should find useful for the specific rules associated with a DGR or DESR (Distribution Generation Resource or Distribution Energy Storage Resource)."
  },
  {
    "id": "RI_3",
    "text": "Distributed Generation information:  https://www.ercot.com/services/rq/re/dgresource/\nTo start an interconnection application please follow this link:  https://sa.ercot.com/rioo-rs/\nDGR and Impedance Calculations from a RIWG meeting: https://www.ercot.com/files/docs/2022/02/18/Resource_Integration_Working_Group_DGR_Topics_02222022.pptx\nResource Registration Glossary: https://www.ercot.com/mktrules/guides/resourcereg/library\nDGR workshop 12: https://www.ercot.com/files/docs/2021/10/13/DGR_Workshop_12_.pptx\nTDSP contacts: https://www.ercot.com/files/docs/2021/11/23/Market_Participant_List.xls\n \nSTAGE 2 - Registration and Modeling \nStage 2 of the Generation Interconnection Process involves the following steps:\n•\tRegistering as a Resource Entity\n•\tCompleting the Resource data entry in RIOO\n•\tNetwork Modeling Requirements\n•\tERCOT Polled-Settlement Meters and ESI ID Requirements\n•\tTelemetry and ICCP Requirements\nRegistering as a Resource Entity\nWith the completion of a signed SGIA, a Resource Entity (RE) that will own or control a generator in the ERCOT market must be registered. Power Generation Companies operating within Texas are also required to register with the Public Utility Commission of Texas in accordance with PUCT Substantive rules which may be found at http://www.puc.texas.gov/.\nThe ERCOT account manager assigned to each RE will assist the applicant with registering as a Resource Entity.  The process generally takes 10 to 15 Business Days and is comprised of the following key submissions which may be found at ercot.com on the Registration & Qualification webpages:\n•\tStandard Form Market Participant Agreement\n•\tResource Entity (RE) Application for Registration\n•\tManaged Capacity Declaration Form\n•\tDesignation of authorized representatives, contacts, User Security Administrator, etc.\nRIOO Resource Data Entry (Substation Data)\nRIOO now contains screens for the IE/RE to enter resource data for the generator and associated substation equipment information needed for ERCOT systems. The content of RIOO’s resource data screens are governed by the Resource Registration Glossary.  RIOO shows the data fields that are required for the selected level of commitment as shown in Figure 11 above.  RIOO allows the following levels of commitment:\n•\tFull Interconnection Study (FIS) – either Steady State, Short Circuit, or Stability and Dynamic studies separately or any combination\n•\tPlanning Model\n•\tFull Registration\nPrior to Full Registration, ERCOT requests that the RE reach out to ERCOT at least 30 days prior to the deadline for the desired PLD to allow for calls and edits prior to submittal in RIOO-IS for review.  For Full Registration, the desired Production Load Date deadlines can be found in https://www.ercot.com/gridinfo/transmission/opsys-change-schedule. Resource data submitted after 15 days prior to the PLD deadline may not get processed in time to be included in the desired PLD!\nOnce a GIM has reached the PLD, data will move from RIOO-IS to RIOO-RS. From this point forward, the RE shall use RIOO-RS to submit changes to registration data.\nResource data for a Small Generator must use the simplified modeling approach.  This means that the Unit is modeled at the TDSP Station as shown below.\nCurrent DGR Modeling Topology Examples:\nNetwork Modeling Requirements\nThe ERCOT Network Operations Model is defined as: A representation of the ERCOT System providing the complete physical network definition, characteristics, ratings, and operational limits of all elements of the ERCOT Transmission Grid and other information from TSPs, Resource Entities, and QSEs.  ERCOT uses the physical characteristics, ratings, and operational limits provided by TSPs and REs to specify limits within which the ERCOT Transmission Grid will be operated.  The Network Operations Model is the basis for the model used to send accurate Base Points and pricing signals to Market Participants.  During the Modeling phase, data required for dispatching, metering, and communicating with the new or modified Resource will be established and verified.   The model is updated on a scheduled basis as shown in the Network Operations Model Change Schedule in Protocol 3.10.1.  Each BESS or ESR Unit needs to be an equivalent impedance for that Unit.  See here for more information:  https://www.ercot.com/files/docs/2022/02/18/Resource_Integration_Working_Group_DGR_Topics_02222022.pptx\nERCOT will work with the IE to establish the all-important Production Load Date (PLD) on which ERCOT’s systems will link together the following key components:\n•\tMetering and Meter Data Acquisition System (MDAS)\n•\tERCOT market settlement information and pricing location\n•\tSupervisory Control and Data Acquisition (SCADA) and Inter-Control Center Communication Protocol (ICCP) communication points\n•\tQSE and Resource Entity relationship and contact information\n•\tThe Network Operations Model of the resource data for the new generator site\nEstablishing these links requires coordination between all involved Market Participants and internal ERCOT departments.  Appendix A of this document also provides a list of forms and links to the ERCOT website where Resource Entities can find the forms and additional information on how to submit modeling data to ERCOT. The PLD for loading the new generator and associated equipment into the Network Operations Model should precede the desired Planned Energization Date of the Point of Interconnection (Checklist Part 1) by at least 15- 30 days.  30 days is typical from PLD to energization.\nThe responsibility for model data submissions is shared between the TSP, QSE and RE. \nTSPs must submit:\n•\tNetwork Operations Model Change Request (NOMCR) for TSP facilities at the Point of Interconnection and any line owned by the TSP to connect the RE site\n•\tOutage requests for equipment being added or removed from the Network Operations Model\n•\tTelemetry points for line flow MW and MVAr of the line connecting the generator station to the TSP POI station.\n•\tTelemetry for KVM and KVT for voltage control \nQSEs must submit:\n•\tICCP communication points for all required telemetry\n•\tOutage requests for all Transmission Facilities/equipment and all generators being added or removed from the Network Operations Model.  \no\tFor a new generation station that has multiple generator owners – a single QSE (the QSE for the Resource Entity submitting the resource data for the new station) is assigned the responsibility to enter all Transmission Facility outages in the Outage Scheduler regardless of which RE owns the Transmission Facilities at the station or any RE-owned line.  \no\tGenerator outages must be entered by the RE-owner’s QSE.  For Split Generation Resources, the Master QSE must enter the Resource’s outage.\nREs must submit:\t \n•\tModeling data for the new/modified generation including RE-owned and operated Transmission Facilities data through the ERCOT-prescribed process applicable to Resource Entities\n•\tGeneration Node and Meter Mapping package (GENMAP) verification\nThe Generation Node and Meter Mapping (GENMAP) package is compiled by ERCOT and provided to the Resource Entity. The GENMAP package provides documentation on the modeled location of the Resource Node and EPS metering in the Network Operations Model as of the PLD. The Resource Entity will review and provide confirmation to ERCOT that the Generation Node and Meter Mapping is accurate by submitting the Resource Node & EPS Meter Mapping Verification document included in the Generation Node and Meter Mapping package.\nAll resource data submissions and verifications are designed to take effect on the PLD. On this day, with submission of the EPS Cutover form by the TSP, all telemetry and metering with ERCOT will be fully functional and the generator and associated equipment will appear in the ERCOT Network Operations Model. At this point, the generator site is modeled such that it later can be approved for energization, synchronization, and commissioning so that it can proceed to be dispatched, scheduled, and settled in ERCOT market systems.\nERCOT Polled-Settlement Meter and ESI ID Requirements\nERCOT maintains a Meter Data Acquisition System (MDAS) to collect all generation and load data for Settlement purposes as outlined in the Protocols and the Settlement Metering Operating Guide.  MDAS receives its data from ERCOT-Polled Settlement Meters (EPS) which are installed and maintained by TSPs.  Prior to installing EPS meters at generation facilities, TSPs must work with the RE to prepare an EPS Meter Design Proposal with one-line drawings, facility details and contact information.  \nNOTE:  The EPS Meter Design Proposal needs to be submitted by the TSP before the Resource data is submitted by the RE so the meter proposal can be approved before the Resource data submittal deadline shown in protocol 3.10.1(3).  \nTo meet the ERCOT Polled Settlement Meter requirements, TSPs will submit the following to ERCOT:\n•\tMetering Plan\n•\tDesign Proposal with one-lines\n•\tMeter Data Acquisition Form\n•\tMeter Cutover Form\nTSPs may commence installation of the meters as soon as ERCOT approves the design.\nEach service delivery point is assigned an Electronic Service Identifier (ESI ID) by ERCOT for settlement purposes.  Please refer to the ESI ID Service History and Usage Extract User Guide on the ERCOT User Guide webpage for detailed information.\nTelemetry and ICCP Requirements\nERCOT interfaces with each QSE and TSP over a fully redundant, highly available Wide Area Network (WAN).  The WAN is designed for the normal and emergency exchange of Real-Time data and voice communications used for wholesale operations, frequency control, transmission security and emergency operations. \nData exchange between ERCOT, QSEs and TSPs is accomplished by using Inter-control Center Communications Protocol (ICCP) as defined in Chapter 5 of the ICCP Handbook.  The data is used to support functions such as generation control, Current Operating Plans, Outage Scheduling, Dispatch Instructions, posting of information and other applications.  QSEs must work with interconnected TSPs and ERCOT to establish an ICCP points list based on the Resource data and NOMCRs approved for use in the Network Operations Model.\nWind Generation Resources (WGRs) and Photovoltaic Generation Resources (PVGRs) must also provide ICCP points for the site-specific meteorological data required for the Renewable Production Potential forecasts as specified in Protocols 4.2.2 Wind-Powered Generation and & 4.2.3 Photovoltaic Generation Resource Production Potential. \nIn addition to SCED telemetry for the generator(s) and CLR(s), ICCP points for breaker/switch statuses, transformer low and high side kV, line flows MW/MVAr for both ends of the interconnecting line (QSE provides for the RE generation site end of the line and TSP provides for the TSP end of the line), transformer high-side MW/MVAr flows, capacitor/reactor and other reactive device MVAr, load MW/MVAr and generator gross and net MW/MVAr outputs, AVR status and PSS status must be supplied.\nTo assure that the new Resource station and generators will be added to the Network Operations Model on the PLD, the QSE needs to submit the ICCP Point List to ERCOT at least 30 days prior to the PLD. It is expected that the ICCP Points List includes parameters for the new generation and associated equipment, including the interconnecting transmission substation equipment at the Point of Interconnection. \nNOTE:  If insufficient telemetry data is provided during the modeling process, there is a high risk of delay in the energization, synchronization, and commissioning of the new generator.\nAccurate and working telemetry and communication systems from the generation site to the QSE to ERCOT must be tested and proven reliable prior to submittal of the Part 1 checklist for energization and Part 2 checklist for synchronization of all new or modified RE and TSP facilities. \nData Center Loads and/or PUN Loads with IRR Generation\nFor co-located data center loads and/or PUN loads netted with IRR generation, an additional telemetry data point, Gross Real-Time Power Potential (GRPP), will need to be added to reflect the real-time power potential of the IRR. \nSTAGE 3: Energization, Synchronization and Commissioning \nStage 3 involves the following steps:\n•\tFinal Compliance with Operational Standards Review\n•\tNew Generator Commissioning Part 1, 2, and 3 Checklists\n•\tCommissioning Plan Template\n•\tCommissioning Process\n•\tReactive Capability, AVR, PSS and Performance Testing\n•\tResource Status during Testing \nFinal Compliance with Operational Standards \nAs stated in Protocol 16.5 Registration of a Resource Entity, an IE shall not proceed to Initial Synchronization of a generation resource in the event of any of the following conditions:\n•\tERCOT has reasonably determined that the generation resource may violate operational standards established in the Protocols, Planning Guide, Nodal Operating Guides, or Other Binding Documents\n•\tThe Resource Entity has not yet demonstrated to ERCOT’s satisfaction that the generation resource can comply with the Operational Standards.\n•\tThe requirements of Planning Guide 5.3.5, Quarterly Stability Assessment, have not been completed\n•\tAny required sub-synchronous resonance studies have not been completed and approved by ERCOT as specified in the ERCOT Protocols and any required mitigation or monitoring has not been completed.\nBased on ERCOT’s review of the Operational Standards requirements, the RE will be notified by email if the generator to be synchronized has passed or failed to meet the Protocol requirements.    A copy of the compliance report will be available in RIOO-IS.  Initial synchronization will not be allowed until all Operational Standards requirements have been satisfied.\nPlanning Guide Applicability\n•\tNew units that meet PG 5.2.1 and go through the INR process will be required to do Part 1, 2 and 3 checklists \n•\tNew units that do not meet PG 5.2.1, and do not go through the INR process, will be required to submit new resource data and do Part 1, 2 and 3 checklists\n•\tExisting units that meet PG 5.2.1and go through the INR process will be required to do Part 2 and 3 checklists but do not have to do Part 1\n•\tExisting units that do not meet PG 5.2.1- will be required to submit new resource data but will not be required to do Part 1, 2, and 3 checklists\nBackground\nStage 3 is primarily governed by the ERCOT New Generator Commissioning Checklist and the Commissioning Plan Template, which are available on the ERCOT website.  The Generator Commissioning checklist and Commissioning Plan Template process is initiated by the Resource Entity/QSE, and all approvals are made by ERCOT Resource Integration.\nERCOT New Generator Commissioning Checklist\nThe three-part ERCOT New Generator Commissioning Checklist is designed to coordinate the energization, synchronization, and commissioning of a new or modified generator once all qualification measures have been met to the satisfaction of ERCOT.  \nThe three parts of the Generator Commissioning Checklist for interconnection requests representing new generation are:\n•\tPart 1:  Request for Energization of Resource Entity Equipment\n•\tPart 2:  Request for Initial Synchronization \n•\tPart 3:  Request to Commission a Resource\nChecklist Submissions for Existing Generation meeting PG 5.2.1(1)(c)(ii) Seeking to Increase Output:\nFor interconnection requests representing modified Wind Generation Resources meeting PG 5.2.1(1)(c)(ii), Applicability, the Checklist Part 2 above is replaced by the following two Checklist parts, submitted before and after modification:\nPart 2a:  Request for Wind Units meeting PG 5.2.1(1)(c)(ii) Pre-Synchronization [QSE submits checklist to request approval to begin re-power work at the site]\nPart 2b:  Request for Wind Units meeting PG 5.2.1(1)(c)(ii) Initial Synchronization [QSE submits checklist prior to desired Initial Synchronization of first re-powered turbine]\nFor modified Wind Generation Resources meeting PG 5.2.1(1)(c)(ii), Applicability, Checklist Part 1 is not necessary and Checklist Part 3 is unchanged.\nUpon reaching Stage 3 of the interconnection process, these REs and/or QSEs are required to submit the Checklist Part 2 and 3. Checklist Part 1 is not necessary, but the telemetry points listed in Part 1 are still required.   Parts 2 and 3 are necessary to ensure the resource is modeled correctly and able to pass all required testing up to the increased capability. This check also helps ensure that any generation previously exempt from PSS requirements as indicated in Section 2.2.6 of the ERCOT Nodal Operating Guides that have done work on their excitation systems have installed a PSS and are operating with it in service.\nRIOO-IS Commissioning Planned Dates\nIt is very important to update RIOO-IS planned commissioning dates for Energization, Synchronization and Commercial Operation.  RIOO-IS dates are used by ERCOT teams for timing of GTC updates and other key steps during commissioning.  NOTE: If these RIOO-IS planned dates are not kept updated, the project could experience delays in approvals for energization, synchronization, and the commissioning of the generators.\nCommissioning Plan Template\nThe Commissioning Plan Template provides in-depth details on how the facility will be operated during all three stages of the Checklist, including testing of generation and control systems while supporting grid security in accordance with ERCOT Operational Standards.  Within 15 days of receipt, ERCOT shall review the commissioning plan and provide feedback with regards to compliance with operational standards and identify possible operational limitations during the commissioning process. The commissioning plan must include the planned dates for all ERCOT required testing.\nThe 8 sections of the Commissioning Plan Template are:\n•\tSection 1:  General Resource Description\n•\tSection 2:  Resource Controls\n•\tSection 3:  Resource Shut-Down Sequences\n•\tSection 4:  Resource Telemetry Verification\n•\tSection 5:  Resource Commissioning Milestones\n•\tSection 6:  Resource Detailed Commissioning Schedule\n•\tSection 7:  Resource Design Capabilities\n•\tSection 8:  Process Notes and Descriptions\nAll 8 sections of the commissioning plan must be completed before submitting it to ERCOT in RIOO-IS.  \nThe ERCOT New Generator Commissioning Checklist and Commissioning Plan Template verify critical communication points and generation security measures before allowing the Resource Entity to energize the point of interconnection, synchronize generation, and prepare for commissioning of the Resource. \nERCOT 90-day expectation for the Commissioning Process of a Resource\nIf the RE believes that it will take more than 90 days from initial synchronization of the generator to commissioning, the RE needs to provide a statement of the reason for it taking more than 90 days with the Commissioning Plan.  As the Resource commissioning progresses, the RE needs to keep ERCOT advised as to the reasons for any delays that may cause there to be more than 90 days from initial synchronization to Part 3 approval for a generator.\nOutage Scheduler\nThe generator has the responsibility to provide accurate and timely updates to the Outage Scheduler to reflect their expected future equipment unavailability if they are expecting not to be capable of generating at their modeled maximum output level due to equipment derates or generation equipment commissioning progression.  Prior to approval of each stage of commissioning and on an on-going basis, the Outage Scheduler must be updated to accurately reflect the generator’s future derate amount, start time and end time.  Outage submission requirements are outlined in ERCOT Nodal Protocols Section 3.1.  \n[Note: ERCOT’s renewable forecasts make predictions 168 hours (7 days) into the future. Because of this, ERCOT needs accurately updated outage scheduler information 7 days into the future. If the derate has an end-date that is tentative during the commissioning at the site, then the RE/QSE need to review derates daily, to ensure it is accurate for at least 7 days into the future.  Also, be aware that Information regarding planned daily capacity that is provided in the Commissioning Plan is for coordination purposes only during commissioning and is not a substitute for the entries of deratings in the Outage Scheduler].\nCommissioning Process\nAt least 30 days before the RE plans to submit Checklist Part 1, the RE is required to submit a completed Commissioning Plan Template.   \nChecklist submittals and approval:\n•\tSeparate Generator Commissioning Checklists must be submitted for each new generator associated with the same Point of Interconnection. RE/QSE will submit all Checklists to ERCOT using the RIOO-IS application.\n•\tPrior to submitting Part 1 (Energization) of the Checklist, the QSE, Resource Entity, and interconnecting Transmission Service Provider shall ensure that the transmission switchyard facilities have been adequately constructed and modeled in ERCOT’s Network Operations Model and are ready for energization and operation as part of the ERCOT system.\n•\tERCOT recommends that Part 1 of the Checklist be submitted at least 7 Business Days in advance of the planned date of the initial energization of the Point of Interconnection.\n•\tERCOT will provide a response to a submitted Checklist part within 7 Business Days of receipt.\n•\tERCOT recommends that Checklist Part 2 be submitted after approval of Checklist Part 1 by ERCOT and successful energization of the RE site and be at least 7 Business Days from the date ERCOT approves the previous Checklist part.\n•\tChecklist Part 3 can only be submitted after satisfactory completion of required testing and approval by ERCOT.\n•\tAny Checklist Part submitted prior to receiving approval of the previous Checklist Part will be considered as being submitted on the next business day after the approval of the previous Checklist part by ERCOT\nAdditional Details on Commissioning Checklist Submissions\nERCOT reviews and approves Checklist submissions for execution on Business Days only, during the hours of 8 AM to 5 PM Central Prevailing Time (CPT). On Friday’s and the day before ERCOT holidays, Checklists will be either approved before 2 PM CPT or the review will resume on the next Business Day.  Checklist submissions received by ERCOT after 2 PM CPT will be considered as received by ERCOT on the following Business Day. \nERCOT Checklist approval will be communicated by Resource Integration to the IE Contacts listed on RIOO-IS.  RE and QSE contacts will be notified by their ERCOT Account Manager of the checklist approval.  \nUpon receipt of Part 1 of the Checklist, ERCOT shall review it for accuracy and completeness. ERCOT shall then perform a verification of the network model and SCADA telemetry before providing energization approval. Telemetry must be good quality and reasonable for at least 48 hours prior to ERCOT approval.  ERCOT shall provide a response within 7 Business Days of receipt. If any problems are encountered with the network model or SCADA telemetry that cannot be readily resolved, ERCOT shall reject Part 1 of the Checklist, and request the QSE, Resource Entity or Transmission Service Provider, where appropriate, to review and correct any outstanding issues as required, and have the RE resubmit Checklist Part 1.  Part 1 of the Checklist shall not be approved until all identified problems have been resolved to the satisfaction of ERCOT. \nThe above process applies with Checklist Part 2. ERCOT shall review the model and telemetry and will reject Part 2 of the Checklist if any problems are encountered that cannot be readily resolved.  Telemetry must be good quality and reasonable for at least 48 hours prior to ERCOT approval.  \nERCOT’s approval of Part 1 and Part 2 checklists, energization of the generator’s Point of Interconnection and synchronization of the generator to the grid, is given for a specific target day requested by the Resource Entity (Part 1) or QSE (Part 2) and is subject to real-time grid operating conditions. Accordingly, the Resource Entity’s QSE must contact the ERCOT control room on the day of energization as per ERCOT’s Operating Procedures and receive permission to proceed prior to station energization or synchronization of the generation. \nIf system conditions are such that energizing the generator station facilities or allowing the generation to synchronize to the grid will place unnecessary risk to the ERCOT Transmission Grid, ERCOT System Operators have the authority to cancel or otherwise prohibit these actions. \nChecklist Part 3 approval requires verification of several generator capabilities such as reactive capability, primary frequency response, base point compliance during curtailment and voltage control. Obtaining approval of Checklist Part 3 is dependent on the time necessary for the RE and QSE to commission the equipment and conduct all required performance testing. Once all testing has been performed, ERCOT shall review all test results within 30 days of test submittal and approve Checklist Part 3 within 7 business days of submittal as appropriate.  The reactive test and AVR test need to both be submitted before review will begin.  The review will then have 30 days after the submittal of the latest of the two tests. It’s best to submit all testing to ERCOT as soon as possible to allow sufficient time to review.  If any issues are identified with regards to performance testing that cannot be readily resolved, ERCOT shall reject the Part 3 submittal, and request the QSE, Resource Entity or Transmission Service Provider, where appropriate, review and correct any outstanding issues as required, and then resubmit Checklist Part 3. Part 3 of the Checklist shall not be approved until all identified problems have been resolved to the satisfaction of ERCOT.\nChecklist Part 3 requires submittal of 5 minutes of sample PMU data during a period that the generators are on-line with outputs greater than zero.  The PMU data needs to comply with Operating Guide Section 6.1.3 Phasor Measurement Recording Equipment Including Dynamic Disturbance Recording Equipment.  The PMU sample data file is in the form of worksheet or comma separated data file.  Column A is the Date/Timestamp followed by columns for voltage phasor magnitude and angle for each phase, current phasor magnitude and angle for each phase, frequency and df/dt.  There should be at least 30 data rows per second.  Sample PMU data files need to be uploaded to RIOO-IS for each generator or if PMU data for IRRs is collected on the high side of the MPT, then at least one file for each MPT.  File name needs to identify the INR#, project name, station code and generator or MPT codes.  File names can only include alpha-numeric characters, underscores, and dashes.  It is suggested that the sample PMU files be provided during Part 3 testing.\nChecklist Part 3 for Generation Resources and Energy Storage Resources requesting to commission a Resource during the winter months (December through February), the Declaration of Preparedness – Generation Entity Winter Weatherization required by Public Utility Commission of Texas (PUCT) Substantive Rule 25.55(c)(3)(A), require statement of the date that it was submitted.  Likewise for summer months (June through September), the Declaration of Preparedness – Generation Entity Summer Weatherization required by PUCT Substantive Rule 25.55(c)(3)(B) and Attachment K: Declaration of Natural Gas Pipeline Coordination was submitted require a statement of the date that it was submitted.   \nChecklist Part 3 requires acknowledgement that a Plant Verification Report is required to be submitted to ERCOT within 30 days following Part 3 approval in accordance with PG 5.5.\nThe Checklist Part 3 approval by ERCOT represents the Resource Commissioning Date and approval for participation in ERCOT market operations. This represents that final review by ERCOT and initial qualification testing by the RE has been completed and the generator has progressed out of the interconnection process.  [Note:  Ancillary Service testing and qualifications are separate from Part 3 testing.]\nBase Point, Reactive Power Capability, VSS, AVR, PFR and PSS Testing\nFor the generator to be commissioned and approved for participation in ERCOT market operations, it must demonstrate that it can satisfy ERCOT’s requirements for following its base points (during curtailments for IRRs and IRR Groups), Reactive Power (both leading and lagging), Automatic Voltage Regulator (AVR), Primary Frequency Response (PFR), and Power System Stabilizer (PSS), as applicable to the generation type. \nThese performance tests are some of the final steps before the commissioning of a generator. ERCOT may direct the generator to isolate from the grid until the required testing has been completed or mitigation plans have been established to address operational risks until the testing can be completed.\nBase Point following during Curtailment – IRRs and IRR Groups\nDue to increased numbers of Generic Transmission Constraints and IROLs, ERCOT is requiring IRRs and IRR Groups to perform Curtailment testing before allowing IRRs and IRR Groups to connect more than 20 MVA of generation capacity to the Point of Interconnection during commissioning. Per protocol requirement 6.5.7.4 and 6.6.5.4, IRR units should follow SCED Base Points when curtailed.  A curtailed IRR that is not in an IRR Group will receive telemetered SBBH (SCED Base Point Below HDL) telemetry flag that is set to “ON” and should follow it’s telemetered Base Point.  IRR Groups are curtailed if any IRR in the IRR Group receives a telemetered SBBH flag of “ON” and the IRR Group total output should be curtailed to the sum of the Base Points for the IRRs in the IRR Group.\nThere are two forms of curtailment test depending on if the IRR under test a single unit or part of an IRR Group is (which is comprised of multiple IRR units). Below is an example of the Curtailment test procedure for a single IRR and the expected response from the unit followed by an example of Curtailment of an IRR Group.\nIRR Unit Curtailment Testing (Note:  Use the following process for an individual IRR that is not in an IRR Group)\nStep #0: Following approval to conduct the Curtailment Self-Test, set RST to “ONTEST” (RST=8) for the unit.\nStep #1: Set Curtailment Flag to True (SBBH=True) and BP = 0 MW for the unit \n•\tThis sends a curtailment to 0 MW to the unit\n•\tThe unit should respond to the curtailment and the output is expected to be equal to zero MW.\n•\tMaintain the curtailment for 15 minutes \n•\tNote that ERCOT will evaluate how the unit’s output (MW), HSL, ramping rate and turbines/inverters availability are telemetered during a 15-minute observation period.\nStep #2: Following the completion of the above 15 minutes, set Curtailment Flag to False (SBBH=False) for the unit. \n•\tThis releases the unit from curtailment. \n•\tThe unit should ramp up its power output until the unit’s output (MW) matches its HSL.\nStep #3: Following the completion of the above test, set RST to “ON” (RST=3) for the unit so it can follow SCED curtailment instructions.\n•\tNote that ERCOT will observe the 10 minutes period after the completion of the test to analyze how the unit’s output (MW), HSL, ramping rate and turbines/inverters availability are telemetered.\n Step#4: Provide ERCOT with the date and beginning/ending times of the Curtailment Self-Test.\nIRR Group Curtailment Testing (Note: The IRR Group is being curtailed at each step below; these are not individual unit curtailments)\nStep #0: Following approval to conduct the IRR Group Curtailment Self-Test, to begin the test, set RST telemetered to ERCOT to “ONTEST” (RST=8) for all the units in the IRR Group.\nStep #1:  QSE sends telemetry to Resources setting Curtailment Flag to True (SBBH=True) and BP = 0 MW for the first unit of the IRR Group.  This should be recognized as an IRR Group curtailment.  If any unit in the IRR Group receives a SBBH = True, then the IRR Group is being curtailed.  During IRR Group curtailment, the HSL for all units in the IRR Group should be telemetered to ERCOT as the unit’s output capability considering wind-speed/irradiance and the number of turbines/inverters available to generate.\n•\tThe IRR Group should respond to the curtailment and the group’s output is expected to be equal to group’s output prior to Step #1 minus the first unit’s output prior to Step #1 (“X1” MW).  In this step the IRR Group is curtailed by a total of X1 MW.\n•\tMaintain the IRR Group curtailment for 15 minutes \n•\tNote that ERCOT will observe the 15 minutes period to analyze how the IRR Group output (sum of the group’s unit MW output), IRR Group unit’s HSL, ramping rate and turbines/inverters availability are telemetered.\n•\tRepeat Step #1 for the remaining units within IRR Group.  Each time, curtailment test increases the IRR Group curtailment amount by the pre-curtailment output of the next unit within the same IRR Group in successive steps.  Following the initial curtailment, the IRR Group is then curtailed by the second unit’s pre-curtailment MW output (“X2” MW), and then in the next step by the third unit’s pre-curtailment output (“X3” MW), and so on.\n•\tWhen the IRR group is curtailed by the pre-curtailment output of the last unit in the IRR Group, the group output is expected to be equal to zero MW.\nStep #2: Following the completion of the above IRR Group curtailment periods, set Curtailment Flag to False (SBBH=False) for all the IRR Group units. \n•\tThis releases the IRR Group from curtailment. \n•\tThe IRR Group should ramp up output until the IRR Group output (sum of its units’ MW outputs) matches the sum of the IRR Group units’ HSL.\nStep #3: Following the completion of the above test, set RST telemetered to ERCOT to “ON” (RST=3) for the IRR Group units so it the IRR Group can follow SCED curtailment instructions.\n•\tNote that ERCOT will observe the 10 minutes period after the completion of the test to analyze how the IRR Group unit’s output (MW), HSL, ramping rate and turbines/inverters availability are telemetered."
  },
  {
    "id": "RI_4",
    "text": "Step#4: Provide ERCOT with the date and beginning/ending times of the IRR Group Curtailment Self-Test.\nThe curtailment test will confirm the ability of a single IRR unit or an IRR Group to follow the SCED Base Point and to respond in a proper way when released from curtailment as well as the accuracy of the telemetry. When an IRR unit is not curtailed, HSL is expected to be equal to unit’s output. However, when the IRR unit is curtailed, its HSL should reflect the available capacity in power production which is a function of the available turbine/inverters and meteorological conditions (wind speed and solar irradiance). In other words, HSL should correlate with the wind speed/ solar irradiance if the number of turbine/inverters is not changed when curtailed. When an IRR unit is curtailed, the wind turbine/ inverters in operations should be telemetered as NTON (available). The HSL should have a smooth transition prior and post curtailment, and HSL is not expected to drop to the unit’s output when the curtailment is lifted. In addition, the units up/down ramp rate telemetry should be accurate, and the units must follow this ramp rate when being curtailed to ensure the reliability of ERCOT’s grid.\nReactive Power Capability\nTypically, coordinated Reactive Power Capability tests are performed in coordination with ERCOT and the TSP as described in Operating Guide section 3.3.2.2 Reactive Testing Requirements.  Although the ERCOT Operating Guides recommend maximum leading reactive tests be performed in low load months, and maximum lagging reactive tests be performed in high load months, this is often not possible for initial operation. Coordinated Reactive testing is generally required for Part 3 approval. \nIf issues arise in completing a non‐coordinated reactive test, then a coordinated reactive test will be required. No extensions to complete reactive testing for Part 3 approval are provided. If either leading or lagging reactive test cannot be completed due to RE plant limitations, the issues must be resolved, and a new reactive test conducted. \nAll Resources need to submit a Reactive Test through NDCRC.  DGRs or DESRs that are in a fixed power factor (unity power factor) control mode need to submit a reactive test with 0’s or 0.1 for all MVAr values.\nVoltage Support Service (VSS) \nAll Generation Resources connecting over 20 MVA of gross capacity or those units connected at the same Point of Interconnection aggregating to greater than 20 MVA of gross capacity shall provide VSS according to Protocol Section 3.15 (2) Voltage Support. This means that Generation Resources, such as wind or solar plants that plan on energizing their facility as new equipment is installed, shall meet the requirement to provide VSS as required in the Protocols once the gross connected capacity of the generation resource exceeds 20 MVA. \nIf unable to provide VSS until the generation resource is fully constructed, the Resource Entity may continue commissioning the new equipment so long as the Resource Entity has only 20 MVA of equipment energized at a time. \nFor IRRs, once a generation unit has enough generation capacity available for AVR, PFR and VSS control and has passed a curtailment self-test and has submitted an email attestation to ERCOT Resource Integration of being able to provide this control, the Resource Entity can request approval from ERCOT to connect more than 20 MVA and up to the capability at which the generation unit(s) can provide VSS and voltage control. \nThe way a generation resource can operate above 20 MVA shall be documented in the Commissioning Plan.  For Intermittent Renewable Resources planning on providing VSS in part using capacitor and reactive banks, it is encouraged that those reactive devices be installed by the beginning of Stage 3 (prior to Checklist Part 1 approval) to maximize output from the generator during the Commissioning process.  Note that capacitor and reactor banks can only be used to make up for losses from the generator terminal to the POIB.\nAutomatic Voltage Regulator (AVR) \nOperating Guide Section 2 governs AVR tests and testing.  All generators are required to have an AVR and have it on-line when generating.  AVR testing is done in accordance Operating Guide section 2.2.5, Automatic Voltage Regulators and varies slightly by technology type.  A Resource Entity required to provide VSS shall maintain the generator voltage or Reactive Power schedule to maintain voltage at the POIB to be within a tolerance band of the Voltage Set Point while operating at less than or equal to the maximum reactive capability of the Generation Resource.  A Generation Resource’s POIB voltage may be out of the tolerance band ONLY if it has exhausted all of its reactive capability.  The tolerance bands are as follows:\nVoltage tolerance band in Op Guide 2.7.3.5(4):\nNominal Voltage\tTolerance\nBand KV\n345\t+/- 4kV\n230\t+/- 3kV\n138\t+/- 2kV\n115\t+/- 2kV\n69\t+/- 1kV\nThe required VSS response times for Generation Resources when voltage measurements at the POIB are outside of the Voltage Set Point tolerance band identified in paragraph (4) of Section 2.7.3.5, Resource Entity Responsibilities and Generation Resource Requirements, then the unit mvar capability and all switchable shunts (If applicable) must be fully deployed in no more than five minutes.  The following document are posted at https://www.ercot.com/services/rq/integration:\n•\tCombined AVR Template  is used to complete the AVR test for IRRs, ESRs and conventional generators.  \n•\tAVR Testing Expectations for IRR explains what is expected for the IRR AVR test.\n•\tAVR and PSS Test Guidelines for Conventional Generation explains what is expected for the conventional generation AVR test.\n•\tAVR Test Guidelines for DESRs (DGRs) explains what is expected for distribution connected Resources (DGRs, DESRs).\nHere is how the AVR test should work:\nPrimary Frequency Response (PFR)\nPFR testing is performed in accordance with Nodal Operating Guide Section 8, Attachment C. Test data is submitted to ERCOT via NDCRC.\nPower System Stabilizer (PSS)\nSynchronous generators must have a PSS installed per Nodal Operating Guide Section 2.2.6. PSS testing requirements are included in Nodal Operating Guide Section 2.2.6(7).\nGenerator Status during the Commissioning Process - ONTEST, ON and OUT Status \nDuring the commissioning process for new unit(s), the QSE will submit a generator status in the COP and telemetry in accordance with Protocol section 3.9.1 Current Operating Plan (COP) Criteria. \n•\tBefore approval of Part 2 up to 20 MVA, the Resource status of “OUT” is expected with associated Outage Scheduler entry with HSL = 0.\n•\tAfter approval of Part 2 up to 20 MVA of connected capacity (IRRs and BESS) when the unit is on-line:\no\tResource status of “ONTEST” is expected if the AVR, PFR, VSS and curtailment controls are not yet functioning – this indicates to SCED that the unit(s) can’t curtail output under full automatic control.\no\tOutage Scheduler entry for HSL is entered based on connected capacity and operating conditions\no\tBattery Energy Storage Systems (BESS) units need to demonstrate the correct telemetry for both charging load and discharging generation as a portion of the telemetry check-out before approval to lift the 20 MVA limit.\n•\tAfter approval of Part 2 over 20 MVA connected capacity - \no\tIRRs having their control system in automatic control mode and having passed the Curtailment Test), when the unit(s) are on-line, it is expected that the generator status will be “ON” except during PFR, AVR and Leading and Lagging Reactive testing and  for a limited number of hours for specific tests that would require a certain level of MW output in order to tune controls for Part 3 testing or other specific exceptional cases.  Requests for unit testing are submitted by the QSE to ERCOT Operations.\no\tWhen the unit(s) are unavailable a generator Status is expected to be “OUT”.  When a unit is sending real-time telemetry status of “OUT”, it also should reflect this in its COP to let ERCOT know how long it will be unavailable.  In this sense, COP status and real-time Resource status (RST) should match if the status is “OUT”.\no\tThe use of “OFF” status is not expected during the commissioning process because it would indicate that the unit(s) are “off-line but available” for RUC and DAM dispatch which would not be the typical case.\no\tSolar units - at night, would not use “OUT” status unless the unit is on outage or the breaker is open.  As long as the unit is on-line at night but not injecting power, it should continue to send “ONTEST” before Part 2 over 20 MVA approval. Following Part 2 over 20 MVA approval it should send the “ON” status.  A telemetered AVR status of “ON” indicates the unit’s AVR system’s ability to change unit MVAr output within the registered reactive capabilities at the current unit MW output level to control voltage.\no\tNon-IRR units can request unit testing and if approved can use the “ONTEST” status during commissioning.  Use of the “ON” status requires following of SCED Base Points.  Requests for unit testing are submitted by the QSE to ERCOT Operations.\nNote: Generators using an “ON” status are subject to Base Point Deviation charges and GREDP monitoring.\nOperation Requirement of Data Center Loads and/or PUN loads with IRR Generation\n•\tQSEs need to estimate load consumption for PUN load or Data Center load for the next 168 hours\n•\tQSEs will deduct the estimated load consumption from the vendor-provided IRR forecast to update the COP HSL, which would need to be reduced further if there is any equipment outage or derate that is not reported in the Outage Scheduler. \nForecasting vendors will produce the forecast for the gross capability for the next 168 hours to estimate the power potential for the IRR \nAPPENDIX A: Helpful Resources and Links \nPublic Utility Commission of Texas (PUCT) Substantive Rules 25.198 governs the initiation of transmission service in Texas, and Substantive Rule §25.109 outlines the certification, licensing, and registration of generators. ERCOT Protocol Section 16.5 identifies additional requirements related to the registration of the Resource Entity as a Market Participant and the generation that it will represent in the ERCOT market.\nRefer to the following links for additional information.\nPUCT rules:  http://www.puc.texas.gov/agency/rulesnlaws/subrules/electric/Electric.aspx. \nERCOT Protocols: http://www.ercot.com/mktrules/nprotocols/current\nERCOT Planning Guides: http://www.ercot.com/mktrules/guides/planning/current\nGIM (GINR) application forms and registration information is available on the ERCOT website at:\nhttp://www.ercot.com/services/rq/integration\nInterconnecting Distributed Generation (less than 10 MW and at voltages below 60-kV) is described in PUCT substantive Rule 25.211, and is not discussed in this document.\nPlanning Guide Section 5:  https://www.ercot.com/files/docs/2021/12/29/05-PG-010122.docx\nHere is the Resource Integration Page:  https://www.ercot.com/services/rq/integration\nDistributed Generation information:  https://www.ercot.com/services/rq/re/dgresource/\nTo start an interconnection application please follow this link:  https://sa.ercot.com/rioo-rs/\nIE sign up guide:  https://www.ercot.com/files/docs/2022/01/14/IE-SignUp-Guide-for-RIOO-Services.pdf\nRE sign up guide:  https://www.ercot.com/files/docs/2022/01/14/RE-SignUp-Guide-for-RIOO-Services.pdf\nTDSP sign up guide:  https://www.ercot.com/files/docs/2022/01/14/TSP-Sign-Up-for-RIOO-Services.pdf\nManaging your RIOO account:  https://www.ercot.com/files/docs/2022/01/14/Managing-Your-RIOO-Services-User-Account.pdf\nHere is the ICCP Handbook on the RE page: https://www.ercot.com/files/docs/2022/02/10/ERCOT_Nodal_ICCP_Communications_Handbook.docx \nHere is a presentation that you may find particularly interesting: https://www.ercot.com/files/docs/2022/02/18/Resource_Integration_Working_Group_DGR_Topics_02222022.pptx\nHere is the Resource Entity page on ercot.com: https://www.ercot.com/services/rq/re\nHere is the RARF Glossary Site: https://www.ercot.com/mktrules/guides/resourcereg/library\nEPS Meter Design Proposal site: https://www.ercot.com/mktinfo/metering/eps/index.html\nDGR workshop 12: https://www.ercot.com/calendar/10142021-DGR-Workshop-XII-by\nTDSP contacts: https://www.ercot.com/files/docs/2021/11/23/Market_Participant_List.xls \nAPPENDIX B: LIST OF ERCOT FORMS FOR INTERCONNECTION PROCESS\nhttp://www.ercot.com/content/wcm/lists/168310/SGIA.doc\t\t\t\nProcess/Form\tEntity\tAccess Location\tSubmission Location\nGeneration Interconnection or Change Request (GIM (GINR))\tIE\tRIOO-IS\nScreening Study Data submission\tIE\tRIOO-IS\nSGIA\tIE\tSGIA\nRIOO-IS\nResource Entity Registration\tRE\tRE Registration\nResource Entity Application \nStandard Market Participant Agreement\tRE\tSFMA\nManaged Capacity Declaration Form\tRE\tManaged Capacity Form\nMIS or ercotregistration@ercot.comand MPRegistration@ercot.com\nResource Asset Registration Form (RARF)\tRE\tRARF Forms\nMIS or mpappl@ercot.com and resourcereg@ercot.com \nResource Registration Glossary\tIE/RE\tRes Reg Glossary\nEPS Design Proposal\tTSP/RE\tEPS Metering Design Proposal\nepsmetering@ercot.com\nMDAS Form\tTSP/RE\tMDAS Form\nmreads@ercot.com\nEPS Cutover Form\tTSP/RE\tEPS Cutover Form\nepsmetering@ercot.com, 1ERCOTEAADataAggregation@ercot.com\nOutage Schedule\tQSE\tMIS System\tThrough MIS outage scheduler\nQSE ICCP Points List\tQSE\tMIS System\tThrough MIS service request\nNew Generation Checklist\tRE\tNew Gen Checklist\nRIOO-IS\nRequest for Unit Testing\tQSE\tOperating Procedures\tSent to the ERCOT Shift Supervisor: shiftsupv@ercot.com.\nCommissioning Plan Template\tQSE\tComm Plan Template\nRIOO-IS\nNet Dependable Capability and Reactive Capability (NDCRC)\tQSE\tMIS System\tThrough MIS dashboard\nAPPENDIX C: NAMING CONVENTIONS\nLLC names – not used by ERCOT Operations, not used by ERCOT Planning, and they are therefore unrestricted.\nSitecode names – used by Operations in switching orders and used by Planning in modeling. Therefore, it is critical that they are clear and distinct and not easily confused with anything else.  There is an 8-character limit in the Sitecode name.  A certain amount of human judgment goes into accepting new names.  For example, “Heart Solar” and “Hart Solar” sound alike and either one could be okay, but not both.  Sometimes similar names can be tolerated if they are geographically far apart.\nProject names – used by Planning and all other departments in all other communications.  Ideally the project name would be the same as the Sitecode, and it is convenient for the project name to include “wind” or “solar” or “gas” instead of “ranch” or “farm” or “project.”  For example, if the project name is Ibis Wind, then the Sitecode can be IBIS_W and everyone can easily recognize it.\nCommission Plan file names - Include the GIM (GINR) number at the end of the filename before the extension and include the GIM (GINR) number in the subject line of all emails regarding the commissioning plan.  \nCommissioning Checklist file name -   [Gen site name] & [unit name] & “Part” & [1,2, or 3] & “Checklist” & [Date Submitted] & “.pdf”. \nAPPENDIX D:  LARGE GEN TIMELINE 1\nAPPENDIX E:  LARGE GEN TIMELINE 2\nAPPENDIX F:  SMALL GEN TIMELINE 1\nAPPENDIX G: SMALL GEN TIMELINE 2\nAPPENDIX H:  SMALL GEN PROCESS FLOWCHART (Zoom In for more details)\nAPPENDIX I:  GIM (GINR) TABULAR TIMELINE:\nTask\tResponsible Entity\tTime Required to Complete \nAcknowledgement of GIM (GINR) Application\tERCOT\t1 to 10 Business Days\nNotification of Additional Information Needed to Complete Application\tERCOT\t1 to 10 Business Days\nPerform Security Screening Study (after application is deemed complete)\tERCOT\t10 to 90 days\nDecision to Pursue FIS (following issuance of Security Screening Study by ERCOT)\tIE\tUp to 180 days\nDevelop Scope Agreement for FIS (following IE’s Notification to ERCOT of desire for FIS and remittance of appropriate fees)\tIE, ERCOT, and TSP(s)\tUp to 60 days\nPerform FIS (following agreement on scope)\t\t40 to 300 days\nSteady-State and Transfer Analysis\tTSP(s)\t10 to 90 days\nSystem Protection Analysis (following Steady-State Analysis)\tTSP(s)\t10 to 30 days\nDynamic and Transient Stability Analysis (following System Protection Study)\tTSP(s)\t10 to 90 days\nFacility Study\tTSP(s)\t10 to 90 days\nSSR\tTSP(s)\t60 to 180 days\nStudy Report Review and Acceptance (following issuance of FIS)\tERCOT, and TSP(s)\t10 to 15 Business Days\nFIS Posted to Market Information System (MIS)\tERCOT\tWithin 10 days of being deemed complete\nReport stability resolution findings to ERCOT\tTSP\tWithin 90 days\nNegotiate and Execute Standard Generation Interconnection Agreement \n(SGIA) (following acceptance of FIS)\tIE and TSP\t180 days\nAPPENDIX J:  FIS Review Checklist – dated 8/3/2020\nINR # and Name\t\nReviewing Engineer\t\nStudies Reviewed\tSteady State                    Short Circuit                    Facilities\nDraft / Final\nDate Received\t\n10-day Review period ends\t\nIs this a restudy?\t\nSteady State Study\nCriteria\tNotes\tEvaluation\nINR # and project name included in the report? \t These should match RIOO\tY/N\nCOD matches RIOO-IS and RARF?\tVerify the COD and request update from IE/TSP\tY/N\nPOI matches RIOO-IS?\tSome TSPs will study a second POI.\tY/N\nCorrect size of proposed project?\tThe MW values in RIOO-IS, RARF and Steady State report should match. \tY/N\nCharging case studied?\tApplicable if there is a storage facility.\tY/N\nCorrect cases considered?\tThe Steady State study uses the SSWG cases.\nSUM case should correspond to the summer season after COD (i.e. same year if prior to June 1 and following year if on or after June 1).\nHWLL case should be studied for projects in areas with high wind penetration. The screening study is a good source for which cases to use.\tY/N\nIf no, explain.\nGenerators meeting PG 6.9(1)\t\tY/N\nList of generators added to / excluded from the cases, and explanation for those additions / exclusions is included?\t\tY/N\nNearby units dispatched at high output?\t\tY/N\nFuture transmission upgrades in the area of the project included in cases?\tIn some cases it may be reasonable to do the studies both with and without a transmission upgrade due to timing uncertainty.\tY/N\nP1 – P7 contingencies run in the vicinity?\tContingencies for neighboring TSPs may need to be considered.\nP2, P4, and P5 contingencies can be duplicates in steady state. If the TSP does not run all contingencies in these types they should explain why in the report.\tY/N\nIf no, explain.\nShort Circuit Study\nCriteria\tNotes\tEvaluation\nINR # and project name included in the report?\tThese should match RIOO\tY/N\nCOD matches RIOO- IS and RARF?\tVerify the COD and request update from IE or TSP\tY/N\nPOI matches RIOO-IS?\tSome TSPs will study a second POI.\tY/N\nModel listed? \tManufacturer, model and rating of the WTG/Inverter/ conventional generator. This should match the model in the RARF.\tY/N\nCorrect cases considered?\tThe Short Circuit Study uses the SPWG cases.\nCase should correspond to the summer season after COD (i.e. same year if prior to June 1 and following year if after June 1).\tY/N\nIf no, explain.\nCircuit Breaker Rating included in the report?\tThe breaker interrupting capacity/rating should be higher than the short circuit current.\tY/N\nFaults and impedances look reasonable?\t\tY/N\nIf no, explain.\nStudy indicates whether existing transmission equipment is adequate?\t\tY/N\nFacilities Study\nCriteria\tNotes\tEvaluation\nINR # and project name included in the report?\tThese should match RIOO\tY/N\nCOD matches RIOO- IS and RARF?\tVerify the COD and request update from IE or TSP\tY/N\nPOI matches RIOO-IS?\tSome TSPs will study a second POI.\tY/N\nSimple oneline or map showing project’s POI?\t\tY/N\nCost over $25,000,000?\tIf so, an economic study is required. Notify RPG@ercot.com \nY/N\nEconomic Study Required field in RIOO\tIndicate in the Project Details section of INR under Other Studies> Economic Study Required> Yes/No\tY/N\nStability Study\nRI Engineer high-level review\nRI Engineer\t\tComments\nProject size. These should match.    \tStability Study\t\t\n\tRARF\t\t\n\tRIOO-IS\t\t\nCOD\tStability Study\t\t\n\tRARF\t\t\n\tRIOO-IS\t\t\nStudy case\tSUM\t\t\n\tHWLL\t\t\nInverter / WT Model\tRARF\t\t\n\tStability Study\t\t\nPOIB \tRIOO\t\t\n\tStability Study\t\t\nCheck generation additions and statements about dispatch changes. \t☐\nCheck if P1-P7 contingencies were run. If not, check for statements explaining why some were omitted. \t☐\nCheck if Protected Information (e.g. events or contingencies causing instabilities, dynamic data) is redacted from the redacted version of the stability report.\t☐\nCheck if dynamic data sets included for any cases studied.\n1.\tPower flow case:             .raw or .sav\n2.\tDynamic case/data:        .snp and .dyr\t☐\nDynamics Review\nDynamics Engineer\t\nIf Report submitted as Draft, Key Checking List\n(DRAFT Results/Report CANNOT be shared with IE)\tClearly identify NERC P1 thru P7 contingencies?\t\n\tContingency List sufficient for study area?  No important contingencies missing or rationale provided for any contingency types not studied?\t\n\tStudy Criteria?\t\n\tStudy Assumptions?\t\n\tNearby generation dispatched at full output and listed in report or rationale provided for generation dispatch scenario that was studied?\n-Is there a separate table for new generation that meets PG 6.9 in the study report based on the cutoff date?\t\n\tReport lists .dyr parameters of unit?\t\n\tIs the POI near/in any established GTC?\n-If yes, are the critical contingencies studied in the FIS study?\t\n\tModel type used in FIS aligns with model submitted in RARF?\t\n\tModel Quality Test report provided in RARF and shows acceptable performance per DWG Procedure Manual section 3.1.5? Model quality test required if RIOO “FIS Requested” date after: 5/1/2020\t\n\tDynamic load models used if interconnect at a large load center?\t\n\tStability Issue Identified?  Is a curtailment level or other mitigation identified? \t\n\tIs this an update on the Final report posted in the MIS per PG 5.3.2.4.3 (6)? \n-\tWhat is the recommended mitigation to address instability issue? \no\tAny solution related to change in Generation Resource (e.g. Tuning, Parameter update, other model)?\no\tAny Transmission solution?\no\tDid the report say solution is feasible and can be implement before In-Sync?\t\nIRR Generators\tHVRT and LVRT*: Check 0.95 pf lead/lag\n*0.95 pf lead/lag initial condition required for LVRT if RIOO “FIS Requested” date after: 7/30/2020\t\n\tHVRT performed as one simulation (instead of piece-wise)\t\n\tHVRT and LVRT: Real and reactive power plotted at POIB?  Performance per DWG Procedure Manual section 3.1.5?\t\nPost Review Checklist\nItem\tComplete?\nPlace a copy of the study in the appropriate project folder.\tY/N\nIf the study is approved and considered final, post the study to MIS Secure\tY/N\nOnce the final report is posted to MIS, update the approval date in RIOO-IS\tY/N\nSend emails to IE and TSP saying the reports are posted to MIS\tY/N\nAPPENDIX K:  Small Gen Review Checklist – Dated 1/22/2022:\nINR # and Name\t\nReviewing Engineer\t\nDate Received\t\n10-day Review period ends\t\nSmall Generation Interconnection Request Application and Approval to Submit Model Information Checklist\n\nSmall Gen (Interconnection Application Only):\nCriteria\tNotes\tEvaluation\nMake sure Name is not taken (Check RIOO-IS and the Planning Data Dictionary).\t\tY/N\nMake sure MWs, Dates, and Voltages Levels look reasonable (Cross-check).\t\tY/N\nVerify Load/Load Transformer for connections (Analogous to POI/POIB).\t\tY/N\nLone Star Infrastructure Protection Act (LSIPA) Attestation (It is required for the initial submission, send IE the link so they download it).\t\tY/N\nVerify One-Line has necessary information, and that the Load/Load Transformer is shown in the One-Line.\t\tY/N\nVerify Payment, and put the payment information in RIOO-IS.\n1.\t ACH - Authorize.net\n2.\t WIRE – Treasury to verify:  treasury@ercot.com\nNote: RIOO-IS is the payment method of Small Gen Applications.\tY/N\nVerify DOD/Entity sheet is included in INR application\t\tY/N\nAssign a TDSP based on Planning Data Dictionary\t\tY/N\nCheck LSIPA check box, fee amount and fee paid along with putting the appropriate date fields\t\tY/N\nAssign a supervisor for both Planning and RI Engineers\t\tY/N\nSmall Gen Approval To Submit Model Information Checklist (Planning Guide Section 5.4.3):\nINR # and Name\t\nReviewing Engineer\t\nDate Received\t\n10-day Review period ends\t\nProvided by IE/RE or TDSP (Depending on Item):\nCriteria\tNotes\tEvaluation\nApproved Interconnection Application\t\tY/N\nNotification that all required studies (System Impact Study) are completed and approved by ERCOT.\nDSP conducted studies to confirm that DSP’s system will not preclude compliance with ERCOT requirements\nDSP conducted studies to identify DGR limitations\t\tY/N\nFully executed Interconnection Agreement:\nWhether any operational limitations exist and description of limitations (if applicable) that will affect generator’s operation\tOperational limitations include (but are not limited to) ramping limitations, maximum output limitation, or maximum charging limitation\tY/N\nConfirmation that IE has provided Notice to Proceed and Financial Security to fund distribution system upgrades\tSecurity should be sufficient to fund distribution system upgrades identified by the TDSP\tY/N\nTimeline for system upgrades required to interconnect the project\t(If applicable)\tY/N\nOperational limitations of the project and the details of those operational limitations prior to interconnection\t(If applicable)\tY/N\nSystem Impact Studies (Operating Guide Section 2.9 [VRT], Operating Guide Section 2.6 [FRT] Planning Guide Section 5.4.2(1)(b))\n\tCriteria\tNotes\tEvaluation\nSmall Gen\tDSP conducted studies to confirm that DSP’s system will not preclude compliance with ERCOT requirements\tRequirements include\n1)\tVoltage ride-through (VRT)\n2)\tUnder-frequency and over-frequency relaying, and\n3)\tPrimary frequency response (PFR)\tY/N\n\tDSP conducted studies to identify DGR limitations\tLimitations include\n1)\tMin / max MW discharge\n2)\tMin / max MW charge (if applicable), and\n3)\tRamp rates limits\tY/N\n•\tDGRs utilizing synchronous generation must have over-/under-voltage relays set to ride through the following operating conditions:\nVoltage (p.u. of nominal)\tMinimum Ride-Through Time\n(seconds)\n0.88 < V < 1.10\tcontinuous\n0.70 < V < 0.88\tLinear slope of 4 s/1 p.u. voltage starting at 0.7 s @ 0.7 p.u.\n•\tDGRs and DESRs utilizing inverter-based generation must be designed and relays must be set to ride through the following operating conditions:\nVoltage               (p.u. of nominal)\tRide-Through Mode\tMinimum Ride-Through Time\n(seconds)\n1.10 < V < 1.20\tMomentary Cessation\t12\n0.88 < V < 1.10\tContinuous Operation\tcontinuous\n0.70 < V < 0.88\tMandatory Operation\t20\n0.50 < V < 0.70\tMandatory Operation\t10\nV < 0.50\tMomentary Cessation\t1\nModeling (Protocol Section 3.10.7.2(3))\nCriteria\tNotes\tEvaluation\nValid Load Transformer information from the TDSP?\tThis is the Load Transformer that the TDSP will model in NMMS.\tY/N\nOperational Limitations and Telemetry (P.G. 5.4)\nCriteria\tNotes\tEvaluation\nConfirmation from DSP that all known distribution system operational limitations have been disclosed to RE\tLimitations may include DSP-imposed limits on the rate or magnitude of injection or withdrawal\tY/N\nAll operational limitations are reflected in RARF\t\tY/N\nConfirmation from RE that all limits are reflected in ERCOT model and/or telemetry\t\tY/N\nFrequency Relaying (Operating Guide Section 2.6.2.1)\nCriteria\tNotes\tEvaluation\nWritten agreement between RE and DSP confirming ERCOT frequency relaying requirements will operate and take precedence\tFrequency              (Hz)\tRide-Through Mode\tMinimum Ride-through Time\n(seconds)\nf > 61.8\tNo ride-through requirements\n61.2 < f ≤ 61.8\tMandatory Operation\t299\n58.8 ≤ f ≤ 61.2\tContinuous Operation\tcontinuous\n57.0 ≤ f < 58.8\tMandatory Operation\t299\nf < 57.0\tNo ride-through requirements\nLoad Shed (Protocol Section 3.8.6)\nCriteria\tNotes\tEvaluation\nDSP confirmation that DGR is not connected to load-shed circuit\tLine cannot be subject to…\n-\tmanual or automatic disconnection…\n-\tby DSP, TSP, or TO…\n-\tas part of any under-frequency, under-voltage, or manual load shed scheme\nOutage Scheduling (Protocol Section 3.1.6.13)\nCriteria\tNotes\tEvaluation\nDSP confirmation that DSP will notify RE or QSE of outages\tRelevant outages include any planned or forced outage of any distribution facility controlled by DSP that impacts, or that foreseeably could impact, the operation of the DGR.  This could be spelled out in the IA.\tY/N\nAPPENDIX L:  Template for RE’s Wanting to Submit Model Information\nTemplate to Submit Model Information:\tFor Informational Purposes Only\t\t\t\t\nWhat Needs to be Ready for a Submission?\tOwner\tComment\tIn RIOO (Y/N)?\tIA Exhibit #\tIA Page?\tSystem Impact Study\tStudy Page?\nSmall Gen Process per Planning Guide\t \t \t \t \t \t \t \nERCOT RIOO Fee Paid\t \t \t \t \t \t \t \nLoad/Load Transformer and Station name with TDSP\t \t \t \t \t \t \t \nRIOO Gen/DOD forms\t \t \t \t \t \t \t \nLSIPA Form\t \t \t \t \t \t \t \nClear One-line with load/transformer information and station name\t \t \t \t \t \t \t \nAffidavit for Conditions of Acceptance [P.G. 5.4.2 (1)] - or Approval to Submit Model Information (RARF) [P.G. 5.4.3]\t \t \t \t \t \t \t \nRIOO Application complete and in Planned Status\t \t \t \t \t \t \t \nConfirmation of TDSP System Impact Studies and approvals\t \t \t \t \t \t \t \nFull technology data sheet and specs\t \t \t \t \t \t \t \nResource Registration data (Initial RARF)\t \t \t \t \t \t \t \nFully Executed and Funded IA\t \t \t \t \t \t \t \nAny operational limitations from TDSP (Unity Power Factor Requirement, rates, ETC)\t \t \t \t \t \t \t \nVRT Performance\t \t \t \t \t \t \t \nFRT Performance\t \t \t \t \t \t \t \nTDSP modeling, if required\t \t \t \t \t \t \t \nTDSP confirmation that IE has funded distribution system upgrades and a timeline for those upgrades\t \t \t \t \t \t \t \nConfirmation of non-load shed UF circuit\t \t \t \t \t \t \t \nConfirmation of Outage Scheduler\t\t\t\t\t\t\t\nFull RARF Package with All Attachments per Glossary\t \t \t \t \t \t \t \nEPS Metering design proposal in and approved\t \t \t \t \t \t \t \nAPPENDIX M:  REVISIONS\nRevision  \t Comments  \tDate   \tAuthor\n0.1\tOriginal Document Draft\t10/12/2012\tAl Garcia\n0.2\tEditing and reduction of scope\t10/24/2012\tJohn Adams\n0.3\tEditing and Addition of Description of Changes/Table of Contents\t10/29/2012\tW. Rickerson\n0.4\tReplacing details of each process with checklist in appendix and other edits\t11/1/2012\tJohn Adams\n0.5\tEditing, make Figure 2 and 3 consistent with Planning Guide, changes to Appendices G and H, updated TOC\t11/6/2012\tPaul Tan\n0.6\tEditing for simplicity & clarity\t11/13/2012\tEric Adams/John Adams\n0.7\tIncorporate comments Art Deller, Bill Blevins,\t11/26/2012\tArt Deller, Bill Blevins, John Adams\n0.8\tIncorporate comments Patrick Coon, Ed Geer, Art Deller\t11/30/2012\tEd Geer, Art Deller, Patrick Coon\n0.9\tEditing and cleanup – initial draft\t11/30/2012\tWoody Rickerson\n1.0\tAdd planning model requirements, commercial operation requirements, corrections & Initial Issue\t12/20/2012\tJohn Adams\n1.1\tClarify SCADA Point plan, Generation checkout, and fate of projects if FIS scope not agreed to within 60 days.\t12/28/2012\tJohn Adams\n1.2\tIncorporate recommendations of QMWG to clarify\n\t3/29/2013\tJohn Adams\n1.3\tUpdate language to Incorporate ERCOT and Market Participant comments pertaining to the Resource Interconnection, Modeling, and Operations processes.\t12/12/2014\tIsabel Flores, Art Deller, Bill Blevins, Chad Thompson, Ed Geer, Ted Hailu, Patrick Coon\n1.4\tUpdated language to change references to “Commercial Operations Date” to “Resource Commissioning Date” as per NPRR 705 (Provides Consistency for references to the End Date of the Generation Interconnection Process)\t02/01/2016\tTed Hailu, Chad Thompson\n1.5\tUpdated to include information about the Quarterly Stability Assessment\t01/15/2018\tJay Teixeira\n1.6\tHandbook revised and updated\t07/16/2018\n\tDennis Caufield\n1.7\tPost Dennis Caufield revisions – formatting mostly\t09/15/2018\tJay Teixeira\n1.8\tPost formatting – footer, cover page, begin content change for RIOO-IS\t10/15/2018\tJay Teixeira\n1.91\tUpdated to include GIM (GINR) Timelines, Curtailment test, FIS Review Checklist and various small edits.\t01/8/2021\tJay Teixeira\n1.92\tUpdated Planning Guide references, revised Curtailment test process, added Outage Scheduler submission requirements, added descriptions of the Small Gen process, links and other clarifications and edits.\t02/15/2022\tJay Teixeira, Ed Geer, Zach Reich, Leo Villanueva\n1.94\tUpdate from ERCOT Operations and updates to replace the term “RARF” with “resource data” and changes to RIOO screens and other various small updates.\t03/01/2023\t Jay Teixeira, Mary Vu\nAPPENDIX N:  Resource Status Codes (ICCP Handbook 2020)\nResource Category\tStatus Code\tStatus Acronym\tStatus Description\nGeneration Resource\t000\tn/a\tResource status has not been defined.\n\t001\tONRUC\tOn-Line and the hour is a RUC-Committed Interval\n\n\t002\tONREG\tOn-Line Resource with Energy Offer Curve providing Regulation Service\n\t003\tON\tOn-Line Resource with Energy Offer Curve\n\t004\tONDSR\tOn-Line Dynamically Scheduled Resource\n\t005\tONOS\tOn-Line Resource with Output Schedule\n\t006\tONOSREG\tOn-Line Resource with Output Schedule providing Regulation Service\n\t007\tONDSRREG\tOn-Line Dynamically Scheduled Resource providing Regulation Service\n\t008\tONTEST\tOn-Line Test with Output Schedule\n\t009\tONEMR\tOn-Line EMR (available for commitment or dispatch only for ERCOT-declared Emergency Conditions; the QSE may appropriately set LSL and HSL to reflect operating limits\n\t010\tONRR\tOn-Line as a synchronous condenser (hydro) providing Responsive Reserve but unavailable for dispatch by SCED and available for commitment by RUC\n\t011\tOUT\tOff-Line and unavailable\n\t012\tOFFNS\tOff -Line but reserved for Non-Spin\n\t013\tOFF \tOff-Line but available for commitment by DAM and RUC\n\t014\tEMR\tAvailable for commitment only for ERCOT-declared Emergency Condition events; the QSE may appropriately set LSL and HSL to reflect operating limits\n\t015\tSHUTDOWN\tThe Resource is On-Line and in a shutdown sequence, and has no Ancillary Service Obligations.  This Resource status is only to be used for Real-Time telemetry purposes\n\t016\tSTARTUP\tThe Resource is On-Line and in a startup sequence and has no Ancillary Service Obligations.  This Resource status is only to be used for Real-Time telemetry purposes\n\t017\tFRRSUP\tOn-Line Resource with FRRS-UP obligation\n\t018\tONOPTOUT\tOn-Line hour is a RUC Buy-Back hour\n\t019\tOFFQS\tOffline – QSGR available for SCED development\n\t020\tEMRSWGR\tOffline – Switchable Generation Resource (SWGR) operating in a non-ERCOT Control Area, available for ERCOT control under Emergency conditions\n\t021\tONFFRRRS\tOn-Line Available for FFR\n Load Resource\t256\tn/a\tResource status has not been defined\n\t257\tONRGL\tAvailable for dispatch of Regulation Service by LFC and for any remaining dispatchable capacity by SCED with an RTM Energy Bid\n\t258\tONCLR\tAvailable for dispatch of a Controllable Load Resource by SCED with an RTM Energy Bid\n\t259\tONRL\tAvailable for dispatch of Responsive Reserve Service, excluding Controllable Load Resources\n\t260\tOUTL\tNot available\n\t261\tFRRSDN\tOn-Line Controllable Load  Resource with FRRS-Down obligation\n\t262\tFRRSUP\tOn-Line Controllable Load  Resource with FRRS-Up obligation\n\t263\tONFFRRRSL\tAvailable for FFR Excluding Controllable Load Resources\n\n\nQuarterly Stability Assessment (QSA) Checklist \nIn accordance with Planning Guide Section 5.3.5(4), QSA prerequisites listed below must be met for the large generator to be included in the QSA assessment per the table in Planning Guide 5.3.5(2).  \nDeadlines for QSA submission\nPlanning Guide 5.3.5 (2):  Last day for IE to meet prerequisites as listed in paragraph (4)\t45-Day Deadline\nPrior August 1\tJune 17\nPrior November 1\tSeptember 17\nPrior February 1\tDecember 18\nPrior May 1\tMarch 17\n\nAll links referenced below can be found on the Resource Integration website.\nCompleted 45-day requirement and Final QSA requirement checklist must be submitted in RIOO-IS prior to their respective deadlines.   \n45-Day Requirement\tFile Name\tDate \nSubmitted\tStatus\nCompleted and approved FIS\t\t\tApproved\n\nSteady state study\t\t\tApproved\n\nShort circuit study\t\t\tApproved\n\nDynamics study\t\t\tApproved\n\nFacilities study\t\t\tApproved\n\nDynamic Models (PSSE & PSCAD) *4\n\t\t\tApproved\n\nPSSE Model\t\t\t☒\n\nPSSE Model Quality Test\t\t\t☒\n\nPSCAD Model (psc or .pscx files are accepted)\t\t\t☒\n\nPSCAD Model Template\t\t\t☒\n\nPSCAD Model Quality Test\t\t\t☒\n\nPSCAD Unit Model Validation Report\t\t\t☒\n\nTSAT Dynamic Data for UDM*4\n\t\t\tApproved\n\nTSAT Dynamic Model Quality Test\t\t\t☒\n\n45 Day Requirement \n\n\n\n\n\n\n\n\nFinal QSA Requirements\n\nQSA Requirements\tFile Name\tDate Submitted\tStatus\nCompleted and approved FIS\t\t\tApproved\n\nSteady state study\t\t\tApproved\n\nShort circuit study\t\t\tApproved\n\nDynamics study\t\t\tApproved\n\nFacilities study\t\t\tApproved\n\nCompleted and approved reactive study*1\n\n\t\t\tApproved\n\nSigned SGIA*2\n\n\t\t\t☒\n\nFinancial commitment\t\t\t☒\n\nNotice to Proceed\t\t\t☒\n\nFinancial Security (upon implementation of PGRR088)\t\t\t☒\n\nRIOO-Create substation details \"Planning\" commitment level complete? *3\n\n\n\n\t\t\t☒\n\nDynamic Models (PSSE & PSCAD) *4\n\t\t\tApproved\n\nPSSE Models\t\t\t☒\n\nPSSE Model Quality Test\t\t\t☒\n\nPSCAD Model (psc or .pscx files are accepted)\t\t\t☒\n\nPSCAD Model Template\t\t\t☒\n\nPSCAD Model Quality Test\t\t\t☒\n\nPSCAD Unit Model Validation Report\t\t\t☒\n\nTSAT Dynamic Data for UDM*4\n\t\t\tApproved\n\nTSAT Dynamic Model Quality Test\t\t\t☒\n\nCollector System Model\t\t\tApproved\n\nCollector System Model [(.raw + .seq) OR .OLR files are accepted]\t\t\t☒\n\nCollector System Template\n(https://www.ercot.com/files/docs/2020/06/30/Collector_System_Template.zip)\n\t\t\t☒\n\nAir permit from TCEQ (if required) *5\t\t\tSubmitted \n\nGreenhouse Gas (if required) *5\t\t\tSubmitted\nDeclaration of water adequacy (if not IRR)\t\t\tApproved\n\n\nQSA References:\n1.\tReactive study: The requirements for Reactive Study are detailed in the Reactive Study Scope.\n2.\tStandard Interconnection Agreement (SGIA): The SGIA must be signed, executed and submitted in RIOO-IS for the project to meet Planning Guide 6.9.  The model and rating should match the Resource Registration Data and FIS studies. If there are modifications to the original SGIA and the SGIA cannot be amended by the QSA deadline then the TSP needs to confirm in writing that the SGIA will be executed shortly after QSA.\n3.\tRIOO-IS Planning Level Data: Refer to Entering Resource Registration Data in RIOO-IS for guidance on how to enter Recourse Registration data in RIOO-IS\n4.\tDynamic Models:  Refer to Model Quality Guide, DWG Procedure Manual and Dynamic Model Template to assist with stability model submission requirements per Planning Guides Section 6.2. \n•\tConventional and Combined Cycle Resources can EITHER provide the SUBSYNC mass and spring constant data in the RARF OR the PSCAD model plus checklist and MQT Report.\n5.\tAir Permit and Greenhouse gas should be confirmed in RIOO-IS.\n6.\tAdditional Guides:\n•\tManaging Your INR as an IE/RE in RIOO-IS\n•\tResource Registration Glossary\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReactive Study Scope v10\nApril 13, 2020 \nTable of Contents\n1.\tPurposes of the Reactive Study\t2\n2.\tWhich resources have to do a reactive study?\t2\n3.\tAcronyms and Definitions\t2\n4.\tRequired Documentation\t2\n5.\tOperating Points to study (see Figure 1)\t3\n6.\tGeneral Description of the Study\t3\n7.\tExamples of More Complicated Studies Involving Multiple Resources at the Same POI\t4\n8.\tTricky Exceptions to the Standard Requirements (Repowering Projects for Older Resources)\t5\n9.\tReferences\t5\n10.\tIllustrations:  Figure 1 Reactive requirements at POI per 100 MW, Table 1 Reactive Device Inventory, and Table 2 Study Results\t6\nFigure 1:  Reactive requirements at POI per 100 MW\t7\nTable 1:  Reactive Device Inventory\t8\nTable 2:  Study Results\t10\n\n\n \n1.\tPurposes of the Reactive Study\na.\tShow the entire reactive capability of the resource or resources\nb.\tShow the plant design will be able to meet Voltage Support Services required for the range of anticipated operating conditions\nc.\tNote:  Although a passing reactive study is a requirement for Initial Synchronization, a passing reactive study does not guarantee that a plant will meet protocol requirements once in operation.  Thoughtful, coordinated design of plant reactive controls is paramount.  It is up to the plant designers and operators to make sufficient allowance and margin for real-world operating conditions; designing plants that barely meet standards on paper is risky and not recommended.\n\n2.\tWhich resources have to do a reactive study?\na.\tAll resources going through the Generation Resource Interconnection or Change Request process including those smaller than 20 MVA that are not required to provide Voltage Support Services\nb.\tERCOT staff may waive this requirement for some repower projects if the reactive study has been successfully completed in the past and is well-documented and not expected to change.  (Send request to Resource Integration engineer assigned to the project.)"
  },
  {
    "id": "RI_5",
    "text": "3.\tAcronyms and Definitions\na.\tIA = Interconnection Agreement\nb.\tESR = Energy Storage Resource\nc.\tHSL = High Sustainable Limit of a generation resource\nd.\tIRR = Intermittent Renewable Resource, a Generation Resource that can only produce energy from variable, uncontrollable Resources, such as wind, solar, or run-of-the-river hydroelectricity\ne.\tLSL = Low Sustainable Limit of a generation or energy storage resource\nf.\tLow Output Point (LOP)= LSL for conventional generators;  10% of maximum real power output for IRRs;  LSL (maximum charging) for ESRs\ng.\tMPT = Main Power Transformer\nh.\tP = real power output of a generation resource\ni.\tPOI = Point Of Interconnection\nj.\tQ = reactive output or consumption of a generation resource\nk.\tRARF = Resource Asset Registration Forms\nl.\tRIOO = Resource Integration Ongoing Operations\nm.\tSTATCOM = Static Synchronous Compensator\nn.\tSVC = Static Var Compensator\no.\tVSS = voltage support services\n\n4.\tRequired Documentation\na.\tDescription of resource that matches RARF, RIOO, and the IA\nb.\tDescription of the resource connection to ERCOT, including at least:\ni.\tPOI bus name, nominal voltage\nii.\tLength, voltage, and conductor of gen-tie, if any\niii.\tSize and impedance of MPT \niv.\tDescription of MPT load tap changer (LTC) if any, including which side is controlled, and how quickly (seconds) it can change positions\nc.\tManufacturer’s real versus reactive power curve (also known as “D-curve” or “PQ curve”)\nd.\tManufacturer’s reactive power versus terminal voltage curve (“QV curve”)\ne.\tTable 1 (shown below) – Reactive Device Inventory\nf.\tTable 2 (shown below) – Study Results\n\n5.\tOperating Points to study (see Figure 1)\na.\tPOI voltage = 0.95 per unit, reactive power = maximum supplying (lagging)\ni.\tHSL \nii.\tLOP\nb.\tPOI voltage = 1.0 per unit, reactive power = maximum absorbing (leading)\ni.\tHSL \nii.\tLOP\nc.\tPOI voltage = 1.04 per unit, reactive power = maximum supplying (lagging)\ni.\tHSL \nii.\tLOP \nd.\tPOI voltage = 1.05 per unit, reactive power = maximum absorbing (leading)\ni.\tHSL \nii.\tLOP\ne.\tNote 1:  these four operating points are the extreme corners of Figure 1 below and they are required even if a different POI Voltage Profile has been provided.\n\n6.\tGeneral Description of the Study\na.\tCheck #1, Dynamic Reactive Capability (Gross)\ni.\tUse the PQ curve for V = 1.0 pu from the manufacturer:  draw one line at P = HSL and another at the LOP.  Multiply the results by the number of turbines or inverters of this type.  Repeat for each type of inverter or turbine and sum.\nii.\tThe resulting Q ranges in Mvar should be no less than +/- 0.329*Pmax in MW, where Pmax is the maximum net real power deliverable to the POI.  If either Q range is too small, the resource will need dynamic reactive support, such as a STATCOM or SVC.\niii.\tIf the equipment is sensitive to ambient temperature, use the PQ curve for max design ambient temperature.  Design ambient temperature should be no less than 35C.\niv.\tFill out the Reactive Device Inventory (Table 1).\nv.\tThe resulting Q range should not be artificially limited but should reflect the actual equipment capability.\nb.\tCheck #2, Reactive Performance at POI (Net)\ni.\tUse a steady-state loadflow program.  Model a slack bus with one extremely big generator and matching load at the same bus.  The TSP will provide a preliminary short circuit capability of the POI (PGRR076, approval pending).  Use this generator to set the POI voltage.  Model the transmission line gen-tie, if any, from the slack bus to the high-side of the MPT.  Model the MPT.  Model the entire collector system including each cable segment and all the transformers and all turbines or inverters.  Model all switched capacitor banks and reactors.  If a STATCOM or SVC will be part of the resource, then model it.\nii.\tNote 1:  The model should be detailed down to whatever voltage level is represented by the PQ and QV curves.  For wind turbines this may be 690 volts, but for photovoltaic solar resources this may be 34.5kV at the individual skid.  The model may include auxiliary or station service loads if they are known but this is not required.  If loads are modeled this should be noted in the resource interconnection description.\niii.\tUse the slack bus generator to set Vpoi to 0.95 per unit, adjust the MPT LTC and other variables to maximize the Mvar provided to the POI.  Check individual terminal voltages.  If any terminal voltage is outside the permissible operating range then this iteration must be excluded.  Adjust variables again (MPT tap, capbank, reactor, transformer taps, generator Vsched, etc) until an iteration is found with maximum Mvars supplied to POI (lagging) while all generator terminal voltages are within range.  Record this in the Study Results Table (Table 2).\niv.\tNote 2:  The resulting Q values should not be limited by anything other than the voltage operating limits at the generator or inverter terminals but should reflect the actual equipment capability.\nv.\tRepeat for Vpoi = 1.0 per unit and maximize Mvar absorbed from the POI (leading).\nvi.\tRepeat for Vpoi = 1.04 per unit and maximize Mvar supplied to POI (lagging).\nvii.\tRepeat for Vpoi = 1.05 per unit and maximize Mvar absorbed from the POI (leading).\nviii.\tThese four points are shown as the outside corners of Figure 1 below and are required for ERCOT.  The engineer doing the study may wish to evaluate and document other operating conditions for other reasons, including calculations that will be used to complete the RARF or to consider a known Voltage Profile.\n\n7.\tExamples of More Complicated Studies Involving Multiple Resources at the Same POI\na.\tResources which have different reactive requirements (See next section “Tricky Exceptions”) – Must be evaluated independently\nb.\tResources which have same reactive requirements but different operating regimes.  For example, if one resource is solar and the other is storage, it is expected that the storage may operate in generation mode at night while the solar is not generating.  Evaluate the resources independently.\nc.\tResources which have same reactive requirements and similar operating regimes, such as multiple types of wind turbines on separate feeders within the same project – the resources may be evaluated jointly or independently.\nd.\tResources have same reactive requirements and similar operating regimes, such as multiple types of wind turbines but are on the same feeders – the resources should be evaluated jointly.\ne.\tCombined-cycle steam turbine – If GTs are sister units, a single reactive evaluation for one unit plus a second reactive evaluation for min(GT + steamer) and for max(GTs + steamer) is best.  If the GTs are not sister units then each will need its own reactive evaluation plus the min(GT + steamer) and the max(GTs + steamer) evaluations.\n\n8.\tTricky Exceptions to the Standard Requirements (Repowering Projects for Older Resources)\na.\tThe 2010 Voltage Profile is posted at http://www.ercot.com/gridinfo/generation/voltprof/ as “Voltage_Profiles_Summer-Fall2010_051010.xls”\nb.\tThe established reactive capability curve of existing resources is available to the owners in NDCRC and in the RARF.\nc.\tNodal Protocols 3.15 (8), conventional generators online before 9-1-1999 whose designs do not meet the standard requirements\ni.\tOwner must provide documentation of initial reactive capability and this should generally agree with the most recent reactive tests\nii.\tNo decrease of reactive capability is permitted\nd.\tNodal protocols 3.15 (8) and (9), wind resources online before 2-17-2004 or online before 5-17-2005 and designed before 2-17-2004 (approx. 18 resources) whose designs do not meet the standard requirements\ni.\tOwner must provide documentation of initial reactive capability\nii.\tNo decrease of reactive capability is permitted\niii.\tIf the most recent reactive tests indicates that the documentation of initial reactive capability was overstated, then the owner shall make up the deficit as part of the repower project.\ne.\tNodal Protocols 3.15 (7) (b), Wind Generation Resources online after 2-17-2004 and IA signed before 12-1-2009 with design capable of meeting standard reactive requirement\ni.\tReactive capability requirement is +/- 0.95 power factor of maximum real power output, the “rectangle.”\nii.\tReactive capability requirement applies to the 2010 Voltage Profile\niii.\tNo decrease of reactive capability is permitted.\nf.\tNodal Protocols 3.15 (7) (a), Wind Generation Resources online after 2-17-2004 and IA signed before 12-1-2009 with design not capable of meeting standard reactive requirement\ni.\tReactive capability requirement is +/- 0.95 power factor of current real power output, the “triangle.”\nii.\tReactive capability requirement applies to the 2010 Voltage Profile\niii.\tNo decrease of reactive capability is permitted.\ng.\tFor repower projects that will result in reduced real power output, the previous reactive capability curve should be truncated at the new maximum real power output but not otherwise reduced. \n\n9.\tReferences\na.\tPlanning Guide 5.7.1(4)(d)(iii) and 5.9(4)(c)(ii)\nb.\tNodal Protocols 3.15 \nc.\tOperating Guide 2.7 plus NOGRR195\n\n10.\tIllustrations:  Figure 1 Reactive requirements at POI per 100 MW, Table 1 Reactive Device Inventory, and Table 2 Study Results \nFigure 1:  Reactive requirements at POI per 100 MW\n \n\nNotes for Figure 1:\n1.\tThe solid lines are the minimum reactive capability requirement per 100 MW.\n2.\tThe dotted lines are the total reactive capability of the resource.\n3.\tThe reactive study should demonstrate both the total reactive capability of the resource with no artificial restrictions, and compliance with the minimum requirement. \nTable 1:  Reactive Device Inventory\nPlease include the below template in the study report:\n•\tGeneration Resource High Sustained Limit, net power deliverable to POI: _________ MW.\n•\tGeneration Resource LOP net power deliverable to POI: _________ MW.  \n•\tRequired VAR capability @ POI, calculated as 32.9% of HSL: ± ______MVAr.\n•\tInventory total gross reactive capability (nominal, @ device terminals, excluding losses):\n1.\tGenerating Units (LOP):\t\t\t_______ MVAr lag / _______ MVAr lead\n2.\tGenerating Units (HSL):\t\t\t_______ MVAr lag / _______ MVAr lead\n3.\tSwitchable Shunts:\t\t\t_______ MVAr lag / _______ MVAr lead\n4.\tAuxiliary Dynamic Devices (SVC, STATCOM) :\t_______ MVAr lag / _______ MVAr lead\n5.\tGrand Total (add #2, 3, 4):\t\t\t_______ MVAr lag / _______ MVAr lead\n6.\tTotal Dynamic at low output point (add #1, 4): \t_______ MVAr lag / _______ MVAr lead\n7.\tTotal Dynamic at HSL (add #2, 4): \t\t\t_______ MVAr lag / _______ MVAr lead\n•\tReminders:  \no\tThe resource shall have Automatic Voltage Regulation\no\tThe AVR is required to be in automatic voltage control mode controlling the dynamic reactive output and switching static reactive devices  \no\tNo alternative control schemes are permitted\no\tThe resource must be capable of maintaining a voltage setpoint at the POI\n•\tWhat is the estimated response time of the shunts to a low voltage? ______ seconds\n•\tPaste manufacturer charts showing:\no\tReactive capability versus real power output (“PQ chart”, or “D-curve”).\no\tReactive capability versus terminal voltage (“QV chart” or family of D-curves).\n•\tList acceptable steady-state voltage ratings:\no\tGenerating units: _______volts low / _______ volts high\n•\tNotes about Droop and Deadband: \no\tDeadband is the % voltage set-point error range which causes no reactive output\no\tDroop is defined as additional % voltage set-point error (after deadband) causing 100% reactive power dispatch\no\tVoltage droop + deadband should be small enough to keep the POI within the tolerance band in the table from NOGRR195 (approval pending):\nPOI Voltage\tTolerance Band KV\n345\t+/- 4kV\n230\t+/- 3kV\n138\t+/- 2kV\n115\t+/- 2kV\n69\t+/- 1kV\n•\tNotes about switchable shunt timing.  Unless doing so would lead to instability or oscillation, the following guidelines are recommended for controlling shunt reactive devices:\no\tStatic reactive devices that are used to meet VSS requirements should be able to switch quickly as part of the AVR system.\no\tThe AVR system should be configured to control shunt devices with the aim of preserving dynamic capability of the unit(s).\no\tShunt devices should not wait for the units’ reactive capability to be exhausted before switching.\no\tThe first shunt device is expected to switch in less than a minute after an AVR set-point change or voltage event that would require the device to provide reactive power. Subsequent shunt devices can wait up to a minute the since last device switched in before switching.  A reasonable lockout-timer (typically, 5 minutes) which prevents the devices from switching out is acceptable.\n\n\n \nTable 2:  Study Results\nThis template shows the minimum data required to report the study results.  Rows and columns may be added to enable error-checking and to assist filling out the RARF.\nPOI Vol-tage\tDis-patch\tReactive Test\tMW Real Power Delivered to POI\tMvar Reactive Power Delivered to POI\tShunts in Service\n(+Mvar cap, or                  -Mvar react)\tTotal Mvars at all turbine or inverter terminals\tLowest voltage at turbine or inverter terminals, pu\tHighest voltage at turbine or inverter terminals, pu\n0.95 pu\tHSL\tMax Lagging\t\t +\t \t\t\t\n\tLOP\tMax Lagging\t\t +\t \t\t\t\n1.00 pu \tHSL\tMax Leading\t\t –\t \t\t\t\n\tLOP\tMax Leading\t\t –\t \t\t\t\n1.04 pu \tHSL\tMax Lagging\t\t +\t \t\t\t\n\tLOP\tMax Lagging\t\t +\t \t\t\t\n1.05 pu\tHSL\tMax Leading\t\t –\t \t\t\t\n\tLOP\tMax Leading\t\t –\t \t\t\t\n\nNotes:\n•\tA generator operating in lagging excitation injects reactive power similar to a capacitor.  A generator operating in leading excitation absorbs reactive power similar to a reactor.\n•\tTotal Mvars at all turbine or inverter terminals is the straight summation of the reactive power delivered by each turbine, wind turbine, solar inverter, or ESR inverter.  (Purpose of this column is to allow ERCOT to estimate total losses and compare to size of installed switched shunts.)\n•\tThe steady-state rating of any STATCOMs (and not the overload rating) should be used when computing reactive power deliverable to the POI.\n•\tIt is okay to add a column to record the total reactive power delivered to the central low-side bus from all the generator feeders, excluding the output of all shunts and auxiliary dynamic devices.  This data is not used to evaluate the resource’s ability to meet ERCOT reactive standards but it will be helpful to whoever is responsible for filling out the Reactive tab of the RARF.\n•\tThe purposes of the final two columns are  \no\tTo demonstrate that the solution does not put any equipment outside its allowable voltage range \no\tTo give an idea how much the reactive capability of the final turbines or inverters had to be derated with respect to the QV curve\nERCOT User Defined Model Submittal Guideline\n\nPlease provide this Guideline to your manufacturer when requesting PSSE/TSAT dynamic stability model for your plant.  This information will help your manufacturer provide functional models.\n1.\tIntroduction\nTo adequately simulate dynamic and transient events in the ERCOT System, it is necessary to establish and maintain dynamics data and simulation-ready study cases representing the dynamic capability and frequency characteristics of machines and equipment connected to the ERCOT System.  ERCOT Dynamics Working Group (DWG) uses the PSS/E and TSAT software programs.  Standard library models, including the so called “WECC Generic Models” are preferred provided the model accuracy is good, as these models are simpler to use and maintain.  Often, however, generators especially IRRs and batteries will require use of User-Defined Models (UDM).  UDM models utilize compiled model code provided by the manufacturer (.dll file) to expand the capability of the simulation program.  To improve compatibility, ERCOT requests that all UDM models adhere to these guidelines.\n2.\tUDM Guidance\nSome UDMs lack features or have certain limitations that have been observed to create challenges in preparing DWG simulation-ready study cases and are often difficult or impossible to use in large scale grid studies.  The following list of items provides discussion and recommendations regarding UDM characteristics based on user experience.\n•\tDetailed Model Manual shall be provided:\nThe model manual should contain all the information needed to set up the dynamic model and understand its overall behavior.  In particular,\no\tManual should describe how the poweflow generator model should be set up, including values for Rsource, Xsource, MBase, Qmin, Qmax, and whether the model is considered a “Wind Machine” in PSSE.\no\tManual should list and describe the major tunable control parameters.\no\tManual should provide a high level control block diagram illustrating major control functions and how the tunable control parameters are utilized.\n•\tInter-Model Communication:\no\tDocumentation should be included on how the model exchanges data (e.g., real and reactive power setpoint or other data exchange) with other downstream or upstream models. \no\tIf submitting a site-specific model, this interfacing between specific upstream/downstream models should be verified, e.g., data exchange between power plant controller (PPC), wind turbine generator (WTG) and STATCOM user-defined models.\n•\tParameter Error Checking: \no\tError and warning messages should be provided to users as appropriate.\no\tThe model should be setup with correct parameter conditions such as min/max values if applicable to allow the software tool to catch and report on issues when running simulation.\n•\tMultiple Module Dependencies:\nWhen multiple modular user-defined models are used to represent a plant, there is a possibility that the end user may exclude required modules (intentionally or unintentionally). Module dependencies should be verified when a UDM is developed, and an error thrown when dependencies are not present. Failure to perform this dependency/error handling has the potential to cause the simulation software to crash.\n•\tMultiple Instances:\nIn one ERCOT case, a given user defined model file (.dll or .tudm) may be used at different sites. The UDM should be verified to operate properly in this situation.\n•\tAccess of External Files:\no\tWith default parameters, the UDM code should not write to files.\no\tError messages should be sent using the appropriate APIs. Diagnostic messages should also be suppressed with default model parameters. \no\tAccessing/reading from a file is OK, but note that other instances of model may be accessing at the same time.\n•\tOperating Points:\no\tModel should be simulated, and behavior validated at a variety of operating points that are expected to be encountered in a powerflow. At minimum, all MQT tests should be performed at 100% dispatch and additional LVRT test should be performed at 50% and 10% dispatches.\n•\tCompatible TSAT model shall be provided:\no\tThe same UDM shall be supplied for TSAT software. Typically, this requires submitting compatible .dll and .tudm (template UDM) files.  \no\tIn addition to ERCOT’s general guideline for UDMs (applicable to both TSAT and PSS/E models), there are some guidelines specific to TSAT:\n\tInstantiation Compatibility: \nThe UDM model for TSAT should be compatible with the PSS/E dyr file format, thus one should be able to use the same site-specific parameter list in both software platforms.\n\tEquipment Name Support and Validation:\nThe model should operate with dynamic data files in “bus number” format (similar to PSS/E) and in “equipment name” format. \nEquipment name format is specific to TSAT and allows a unique 32-character identified to be used for mapping dynamic (or other auxiliary data). \nUDM authors should also verify that model works with equipment names that include space characters. \nIt should also be verified that the TSAT case operates equivalently in both bus-number and equipment name format by running equivalent test scenarios.\n\tTransfer Analysis: \nThe model should be verified to operate as expected in a “transfer” scenario, that is, utilizing TSAT’s transfer analysis feature to automatically re-dispatch the unit other test (or other units in the system). Here, testing of all model functionality should be performed at multiple transfer “points”. \nAny model features which are intended to interact directly with TSAT generator (re)dispatch should be verified.\n\tNumerical Integration Methods:\nModel should operate consistently when using different numerical integration methods, e.g., Modified Euler (ME), RK2, RK3, or RK4.\n\tCompatibility with Distributed Computation:\nModel should be tested for compatibility with TSAT’s distributed computation feature, where multiple TSAT server instances are processing multiple scenarios which all utilize the UDM.\nModel instructions should include details of which supporting files are required to be accessible by TSAT server instances, i.e., in addition to the DLL/TUDM.\n\tModel Quality Testing:\nAll ERCOT model-quality testing guidelines should be followed, testing the TSAT site-specific model in both equipment name and bus-number format. \n\tCritical Clearing Time (CCT) – TSAT has a special mode of operation which allows for determination of the critical clearing time for a given contingency list.  As the execution sequence for CCT mode differs from basecase or transfer analysis, it is recommended that model authors ensure that this mode of operation does not cause issues with the developed user defined model by including a CCT scan as part of testing.\n\tMulti-Threaded capability – As of V23.0.0, TSAT has the capability to perform simulations using a multi-threaded process which can speed up simulation run-time considerably. At present, user-defined DLLs (DLBs) are restricted to a single thread so there are no additional considerations for DLB authors, however it is suggested that the model be tested with TSAT operating in both single- and multi-threaded mode to ensure compatibility with this feature.  In future, if support is expanded to allow vendor DLBs to operate across multiple threads, additional testing may be necessary.\n\tSmall Signal Stability Analysis (SSAT) – The DSATools SSAT module makes use of linearized eigenvalue analysis to study power system oscillatory behavior. In order for a dynamic model to be incorporated in that analysis, a Jacobian matrix for that device must be defined. This can either be defined explicitly in a DLL (DLB), accounting for initial conditions and all modes of operation. As an alternative, a simplified variant of the model may be prepared in the DSATools UDM standard format, model benchmarked against non-linear time-domain model.\n\tTrapezoidal Integration – In order for trapezoidal integration to be used in a TSAT simulation, the Jacobian matrix (as noted with SSAT above) as well as dynamic step size support must be verified in the model (see above regarding variable time steps).\n\tPerformance Impact Testing – TSAT is commonly used in operation applications (control center environments) where simulation performance is critical. In addition, TSAT-RTDS co-simulation and PMU data streaming (ePMU module) require simulations to run in real-time, and the ability to do so may be impacted by execution of user-defined models. Model developers are therefore recommended to verify and report any significant impact their model may have on simulation performance (and, if applicable, other factors which may impact ability to simulate in real-time), especially when a model may be instantiated many times in a given simulation (i.e., used across multiple plants).\n\n•\tBlack-box model with limited control and model information:\nMost UDM user manuals focus on how to incorporate model properly in the simulation tool.  Many features are described very briefly without detailed control block diagrams and design logic included in the document.  This basic information may allow a user to include the model in the study tool but is not sufficient to fully understand the response and perform further investigation for observed responses. \n•\tAvoid Multiple library files and specific set up:\nUDMs generally should avoid utilizing multiple linked library files or parameter files or a specific folder structure unless this method provides a clear benefit, such as providing greater fidelity in model response.\n•\t.DLL Files only:\nFor PSSE software, ERCOT no longer accepts models that require linking and/or compiling.  Thus ERCOT no longer accepts .OBJ and .LIB model files in PSSE.\n•\tTime Step Flexibility:\nModels should be capable of running at a range of time steps commonly used in dynamic simulation (e.g. half cycle or lower).\n•\tLimited Number of Key Parameters and Settings:\nManufacturers should strive to limit the number of parameters to those that are typically tuned or adjusted.\n•\tDiagnostic Messaging:\nThe best UDMs provide informative messages during initialization to help debug issues.\n•\tImmune to numerical noise / transients:\nDuring/after faults, bus frequency, which is a calculated value in PSSE, may be subject to numerical deviations.  Protection models should avoid using instantaneous protection (zero pickup time) and consider whether additional filtering and associated time delay is necessary.\n•\tGracefully Handle Islanding:\nModels should not crash when islanded but instead should trip.\n•\tGracefully Handle GNETing or out-of-service:\nThe GNET function in PSSE is a useful debugging tool to discount certain plant dynamics.  Some UDMs also require removal of the dynamic model itself in order to GNET properly, which makes the debugging process cumbersome.\n•\tGood Memory Management:\nUDMs require designated memory location to write the response.  Poor memory management can write to the memory address that is out of the bound of the allocated space by PSS/E and affect other models in the system.  \n•\tProtocol-Required Capability:\nExcept where otherwise allowed, all generating plants must have dynamic reactive power and automatic voltage regulation capability (NP 3.15 and NOG 2.2.5), Voltage Ride Through capability (NOG 2.9), and Frequency Response (NOG 2.2.7), among others.  This required capability should be reflected in provided models.\no\tIn addition, control strategies should consider the need to provide system support while coordinating with nearby resources.  Voltage regulation with droop capability and dynamic reactive capability during voltage ride through are examples of such response.\n•\tFully Support PSS/E UDM Implementation:\nModels should avoid requiring a specific unit ID to be utilized such as “1” or “W” or “G1”.  Models should avoid requiring Qmin and Qmax limits to be set artificially in power flow, such as Qmin=Qmax or Qmin=Qmax=0.\n\nERCOT PSCAD Model Submittal Guidelines\n\nERCOT requests you submit this completed checklist along with your PSCAD model.  Please include this completed sheet in the same zip file when submitting your PSCAD model to your RARF form or RIOO system.\n1.\tIntroduction\nPSCAD models are a specialized type of model used in Electromagnetic Transient (EMT) studies.  These models are more detailed than standard dynamic stability models (e.g. PSS/E models) and are necessary for modeling generators in weak grid studies and subsynchronous resonance studies, among others.\nNot all PSCAD models are created equal.  Some are unreasonably difficult to use and some contain certain modeling approximations.  In order to provide better quality control, ERCOT with the help of the Dynamic Model Task Force created this check-sheet.  When submitting a PSCAD model to ERCOT, please fill out this check sheet and attach it along with your model (zip the files together).  This will facilitate ERCOT providing feedback, and ultimately reduce issues that may occur down the road.\nIt is expected that all PSCAD models adhere to these guidelines.  Any deviations should be documented and explained and will be subject to review.  This form should only be completed by an SME knowledgeable with the inner-workings of the PSCAD black-box model, usually this implies OEM staff\n  PSCAD submission checklist:\n\n\tInclude a Model Quality Test (MQT) report overlaying the PSCAD and PSS/E model response.  If utilizing a user-defined-model in PSS/E, then also include the TSAT model response in the overlay.\n\tPSCAD model inserted into the ERCOT PSCAD Template, available in the “Dynamic Model Templates” package posted at:  https://www.ercot.com/services/rq/re\n\tInclude this completed checksheet (check off the items in the below tables).\n\tInclude the PSCAD model manual.\n\tInclude PSCAD files and libraries compiled for both 32-bit and 64-bit Fortran compilers if possible.\n\n\n\n\nThe checklist below is applicable for models associated with the following facility (indicate project name and/or GINR# and/or ERCOT Site Code):\n\n\n\n\nContact for person completing this form:\n\n\n\n2.\tPSCAD Model Requirement\nModel Accuracy Features\nIn order to be sufficiently accurate, the model provided for each facility shall:\nItem\tDescription\tCheck\n1\tRepresent the full detailed inner control loop of the power electronics. The model cannot use the same approximations classically used in transient stability modeling and should fully represent all fast inner controls, as implemented in the real equipment. \t\n2\t Utilize actual hardware code in creating the PSCAD model *OR* validate the model by comparing the model to measured device response.  Validation should be performed for a standard set of disturbances AND include a small signal frequency sweep to confirm the subsynchronous behavior over 5 to 55 Hz.  (Beware that models assembled using standard blocks available in the PSCAD master library introduce unacceptable approximations).\t\n3\tIncorporate a full IGBT representation (preferred) or use a voltage source interface that mimics IGBT switching.  Average source voltage-like models are acceptable if considered accurate for grid stability studies.  Average source models should contain directly connected back-diodes for numerical stability. \t\n4\tRepresent plant level controllers as they are implemented in the real controls, such as automatic voltage regulation.  Model communication and other delays.\t\n5\tParameters requiring site-specific adjustment should be made user-accessible. For example, the plant level controller should provide access to regulation gains and droop settings.\t\n6\tRepresent all pertinent control features as they are implemented in the real controls (e.g. customized PLLs, ride-through controllers, etc.).  Incorporate expected site-specific adjustments and settings.\t\n7\tRepresent Subsynchronous Oscillation (SSO) mitigation and/or protection including the ability to enable and disable SSO mitigation/protection, if applicable.\t\n8\tRepresent shunt capacitor and reactor banks and any dynamic reactive devices.  The controls should be modeled if the equipment dynamically responds to a disturbance within 10 seconds.  It is recommended to include an initialization routine, even if the controls are not explicitly modeled, so that the capacitor and reactor banks will be at the correct initial operating position at the start of the simulation.  For example, if the plant controller would normally place all shunt capacitors in service for 100% dispatch in real power and no shunt capacitors in service for 50% dispatch in real power, then it is recommended that an initialization routine would include this same logic.\t\n9\tRepresent all pertinent electrical and mechanical configurations, such as filters and specialized transformers.  Mechanical features (such as gearboxes, pitch controllers, etc.) should be included in the model if they impact electrical performance.\t\n10\tHave all pertinent protections modeled in detail. This includes various over-voltage and under-voltage protections (individual phase and RMS), frequency protections, DC bus voltage protections, overcurrent protection, and any other protection which can influence ride-through behavior.  Actual code is recommended to model these protection features.  Mechanical protections, such as thermal, should be modeled to extent may limit ride through capability.\t\n11\tAccurately reflect behavior throughout the valid (MW and MVAr) output range from minimum power through maximum power.  Represent machine slip of Type III (DFIG) wind generation as appropriate for the power dispatch.  This value should be calculated and not require manual entry.\t\n12\tModel main power transformer saturation based upon transformer test reports.  Model main power transformer protection system.  This feature is not required but recommended to help diagnose ferroresonance for resources locating close to series capacitors.\t\n13\tIf PLL loss of synchronism protection, phase angle jump protection, or anti-islanding protection is installed, confirm with the OEM that it is necessary protection and it is correctly modeled in PSCAD.  If not needed, ERCOT requests that these protections be disabled as they have been linked to ride through failures .  If needed, please describe why.\t(Not installed / modeled & needed because...)\n14\tFor Type 3 Wind Turbines, include a note, label, flag, or switch in the model indicating clearly whether subsynchronous damping controls are active.\t\n15\tModel dynamics of the DC bus in the inverter/converter, including capacitor discharging and protection.\t\n\nModel Usability Features\nIn order to allow study engineers to perform system studies and analyze simulation results, the model provided for each facility shall:\n15\tHave pertinent control or hardware options accessible to the user (e.g. adjustable protection thresholds or real power recovery ramp rates).  Diagnostic flags (e.g. flags to show control mode changes or which protection has been activated) should be accessible to facilitate analysis and should clearly identify why a model trips during simulations.\t\n16\tAccurately simulates for a timestep between 10 μs and 20 μs.  Requiring a smaller time step may mean that the control implementation has not used the interpolation features of PSCAD or has used inappropriate interfacing between the model and the larger network.  It is preferable if the model can operate accurately for any arbitrary timestep between 10 μs and 20 μs, however ERCOT may accept plant models that require a different time-step if the model simulates reasonably fast per ERCOT’s sole discretion.\t\n16.1\tCompletes a 10-second simulation in PSCAD in under approximately 300 seconds using a typical computer set up (under 180 seconds ideal). If taking more than 300 seconds, subject to further discussion.\t\n17\tInclude documentation and a sample implementation test case.  Access to technical support engineers is desirable.\t\n18\tBe capable of initializing itself.  Models shall initialize and ramp to full output within without external input from simulation engineers.\t\n19\tAccept external reference values.  This includes real and reactive power reference values (for Q control modes), or voltage reference values (for V control modes) and utilize a single parameter for adjusting real power, and separately, a single parameter for adjusting voltage setpoints.  Adjustments should be easy to identify, such as using memo markers or a slider control (preferred).\t\n20\tAllow protection models to be disabled.  Many studies result in inadvertent tripping of converter equipment, and the ability to disable protection functions temporarily provides study engineers with valuable system diagnostic information.\t\n21\tProvide a switch to disable saturation on the main power transformer and the inverter or turbine local transformers for investigation of ferroresonance.\t\n22\tAllow the active power capacity of the model to be scaled.  This is distinct from a dispatchable power order and is used for modeling different plant capacities (e.g. if a portion of the plant is offline).\t\n23\tHave a simple means to represent curtailed operation for a power response to a frequency dip versus uncurtailed operation for no response to a frequency dip.\t\n24\tAvoid using PSCAD simulation sets, as these are difficult to incorporate into much larger cases.  Use of ETRAN+ is okay.  (ETRAN+ version 5 recommended.)\t\n25\tProject PSCAD model should accept real power dispatch and voltage reference commands as a variable (not a Fortran constant) for external dispatch initialization.\t\n26\tProject PSCAD model should accept reactive power initialization to seed the initial Power Plant Controller reactive state variable at the start of the simulation, rather than requiring the PPC to ramp up from zero.\t\n\nModel Efficiency Features\nIn order to improve study efficiency and model compatibility the following efficiency features are requested.  Note that no feature should compromise model accuracy.\n25\tModel is embedded into the PSCAD Template published at: https://www.ercot.com/services/rq/re\n\n26\tModel is correctly connected to the Template and inputs real power reference (Pref), voltage setpoint (Vref), and initial reactive reference (Qref).  Model exports trip signals.\t\n27\tBe compiled using Intel Fortran compiler and capable of running in Intel Fortran version 15 and higher and Microsoft Visual Studio 2015 and higher. Should not require a specific version of Intel Fortran and should support the new Intel OneAPI HPC free Fortran compiler.  \t\n28\tProvide 32-bit and 64-bit versions of libraries.  As of 2025, Intel has discontinued their 32-bit Fortran compiler.\t\n29\tCompatible with PSCAD version 5.0.1 and higher.\t\n30\tInitialize quickly under 5 seconds to user supplied terminal conditions.\t\n31\tSupport multiple instances of its own definition in the same simulation case for situations where the same inverter resource is used at multiple sites.\t\n32\tSupport the PSCAD “snapshot” feature.\t\n33\tSupport the PSCAD “multiple run” feature.\t\n34\tAllow replication in different PSCAD cases or libraries through the “copy” or “copy transfer” features.\t\n\n\n(Sample Verification Report)\n\nResource Name:  TURTLE GENERATION STATION\tDate of this Report: 8/7/2023\nDate(s) Field Settings Checked at Plant:\n5/2023:  Protection and PSS settings \n6/2022:  Date of MOD-026/027 Reports\tNames of Reference Documents (attached):\nTurtle MOD-026/027 Reports\nTurtle commissioning models\n\n\nGeneral Description:\n\nThis report is submitted to support the model parameters for the TURTLE GENERATING STATION.  The Governor and Exciter and Stabilizer models were checked through testing in the MOD-026/-027 reports.  In May of 2023, plant personnel downloaded the power system stabilizer and protection parameters to directly confirm the settings in those devices.  Tables of tunable or site-specific model parameters and their verified values are listed below.\n\n(Notes to the author writing this Verification report:\n1.\tThe new dynamic model Template contains a worksheet that can function as your verification report.  There is no need to prepare a separate report if you complete this worksheet and populate the field-verified data.\n2.\tYou can verify either your PSS/e or your PSCAD model.  However, if you verify the PSCAD model, please provide evidence you also confirmed the protection models in the PSS/e model, since these are not guaranteed to match when overlaying PSS/e versus PSCAD in the MQT report.\na.\tThe new dynamic model Template provides helpful tips on this one. \n3.\tFollow the instructions in the Model Quality Guide on submitting your models along with this report.  You must submit models when submitting a verification report.  This includes submitting both models, even if only verifying one or the other.)"
  },
  {
    "id": "RI_6",
    "text": "GENERATOR [GENROU], checked by commissioning model documents.\nPSS/E Index\tParameter Name\tModel Value\tActual Field Equipment\tVerification Method\tMatch?\n\tH, Inertia\t5.7\t5.7\tDOCS\tY\n\tS(1.0) Saturation\t0.002\t0.002\tDOCS\tY\n\tS(1.2) Saturation\t0.03\t0.03\tDOCS\tY\n\n\nEXCITER [ESST4B], checked by MOD-026.\nPSS/E Index\tParameter Name\tModel Value\tActual Field Equipment\tVerification Method\tMatch?\n\tAVR proportional Gain\t110\t110\tMOD-026\tY\n\tAVR integral Gain\t10\t10\tMOD-026\tY\n\n\nSTABILIZER [PSS2B], checked by directly query digital stabilizer settings.\nPSS/E Index\tParameter Name\tModel Value\tActual Field Equipment\tVerification Method\tMatch?\n\tTw1 First Washout\t3.5\t3.5\tDirect\tY\n\tTw2 Second washout\t3.5\t3.5\tDirect\tY\n\tTw1 First Washout\t3.5\t3.5\tDirect\tY\n\tTw2 Second washout\t0.5\t0.5\tDirect\tY\n\tKs2 Gain on Signal #2\t0.4\t0.4\tDirect\tY\n\tKs2 Gain on Signal #2\t0.7\t0.7\tDirect\tY\n\n\nGOVERNOR [GGOV1], checked by MOD-027.  Droop directly checked in equipment settings.\nPSS/E Index\tParameter Name\tModel Value\tActual Field Equipment\tVerification Method\tMatch?\n\tDroop\t5%\t5%\tDirect\tY\n\tKpgov Proportional Gain\t6.0\t6.0\tMOD-027\tY\n\tKigov Integral Gain\t0.5\t0.5\tMOD-027\tY\n\tActuator Time Const\t0.6\t0.6\tMOD-027\tY\n\n\nPROTECTION [Overvoltage] checked directly in relay settings.\nModel\tField Relay\t\t\nV Thres\tSeconds\tV Thres\tSeconds\tVerification Method\tMatch?\n1.25\t0.02\t1.25\t0.02\tInspection of relay curves\tY\n1.11\t8\t1.11\t8\tInspection of relay curves\tY\n\t\t\t\t\t\n\n\nPROTECTION [Undervoltage] checked directly in relay settings.\nModel\tField Relay\t\t\nV Thres\tSeconds\tV Thres\tSeconds\tVerification Method\tMatch?\n0.6\t0.02\t1.25\t0.02\tInspection of relay curves\tY\n0.80\t8\t1.11\t8\tInspection of relay curves\tY\n\n\nPROTECTION [Underfrequency] checked directly in relay settings.\nModel\tField Relay\t\t\nHz Thres\tSeconds\tHz Thres\tSeconds\tVerification Method\tMatch?\n65\t0.02\t65\t0.02\tInspection of relay curves\tY\n62\t8\t62\t8\tInspection of relay curves\tY\n\n\nPROTECTION [Overfrequency] checked directly in relay settings.\nModel\tField Relay\t\t\nHz Thres\tSeconds\tHz Thres\tSeconds\tVerification Method\tMatch?\n57.5\t0.02\t57.5\t0.02\tInspection of relay curves\tY\n58.5\t8\t58.5\t8\tInspection of relay curves\tY"
  },
  {
    "id": "RI_7",
    "text": "ERCOT Public MODEL GUIDELINE\nERCOT Dynamic Model Submittal Guideline\nVersion 1.10\nERCOT June 2025\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nDocument Revisions\nDate Version Description Author(s)\nMay 2020 1.0 Initial Draft Jonathan Rose\nReviewed by: John Schmall\nSeptember 2020 1.1 Add leading / lagging power factor\nscenarios for VRT\nJonathan Rose\nJanuary 2021 1.2 Updates associated with PGRR 085 Jonathan Rose\nReviewed by: John Schmall\nApril 2021 1.3 Update link to Acceptable Model List,\nelaborate TSAT data submission\nrequirements, add Table 1, and\nmiscellaneous edits for clarity\nJonathan Rose\nMehdi Daryabak\nReviewed by: John Schmall\nAugust 2022 1.4 Update various out-of-date links and\nPlanning Guide references. Added\nclarifications to Table 1.\nJohn Schmall\nJanuary 2023 1.5 Clarifications, request overlaid PSS/E,\nTSAT, PSCAD MQT plots, updated\nDMVIEW instructions, add PCAR\nJonathan Rose\nReviewed by: John Schmall\nMarch 2023 1.6 Update TSAT data submission and\nTSAT MQT requirement. Add\nPMVIEW.\nERCOT Operation Stability\nAnalysis Group, Dynamic\nStudies\nDecember 2023 1.7 Clarifications\nJune 2024 1.8 Clarifications, “combined MQT”\nrequirement, NOGRR245.\nDynamic Studies Department\nMarch 2025 1.9 Reference to operational voltage\ntolerance requirements on pgs. 4 and\n8 and updated Planning Guide 5.5\nsection numbers, misc. updates.\nDynamic Studies Department\nJune 2025 1.10 Advanced Grid Support, misc. edits Dynamic Studies Department\n© 2025 ERCOT 1\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nTable of Contents\nExecutive Summary .................................................................................................................. 3\nWhere to Find Help ................................................................................................................... 3\nERCOT Dynamic Model Requirements .................................................................................... 4\nAVR and PFR Testing and Modeling Switched Shunt and Transformer Tap Controllers........ 7\nAbout Dynamic Models ........................................................................................................... 10\nA Caution about Generic Models and MOD 026/027 Studies ................................................ 11\nDynamic Model Templates ..................................................................................................... 11\nThe Model Quality Test ........................................................................................................... 12\nUsing DMVIEW .................................................................................................................... 15\nUsing PMVIEW .................................................................................................................... 17\nUnacceptable Test Results per the DWG Procedure Manual ................................................ 17\nA special note on the frequency tests ..................................................................................... 17\nDeliverables ............................................................................................................................ 18\nEnclosures .............................................................................................................................. 20\nReferences .............................................................................................................................. 20\n© 2025 ERCOT 2\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nExecutive Summary\nThis guideline facilitates a Resource or Interconnecting Entity fulfill ERCOT Dynamic and Transient\nmodel requirements outlined in the ERCOT Planning Guide (PG) Sections 5.5 and 6.2 and Dynamics\nWorking Group Procedure Manual Section 3. This guide applies to all modeled Resources.\nWhere to Find Help\n• Questions regarding this guide…… dynamicmodels@ercot.com\n• Interconnection and QSA issues……. Contact your Resource Integration (RI) engineer.\n• General Interconnection questions…... ResourceIntegrationDepartment@ercot.com\n• NOGRR-245 questions (Nodal Operating Guide Section 2) … nogrr245@ercot.com\n• RIOO issues: Refer to the RIOO Documentation at https://www.ercot.com/services/rq/re\no These helpful guides cover everything from setting up an account to using RIOO.\no Additional help:\n▪ RIOO-IS issues (for interconnection projects) …. Contact your RI engineer.\n▪ RIOO-RS issues (for online projects) …. Rioo-help@ercot.com\n• Dynamic model questions: Email dynamicmodels@ercot.com (please include your registered\nsite-code1 in the email subject line if available).\n• This Guide is posted at https://www.ercot.com/services/rq/re , search Model Quality Guide\n• DWG Procedure Manual Section 3.1 describes model requirements and model testing.\n• Template issues or requesting a model Template: Email dynamicmodels@ercot.com with\n“Template Issue” in the email subject line.\n• TSAT model questions: Email dynamicmodels@ercot.com with “TSAT Question” in the\nsubject line.\n• PSS/e and PSCAD model questions…… dynamicmodels@ercot.com\n1 Site-code: Visible in RIOO under Substation → Code.\n© 2025 ERCOT 3\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nERCOT Dynamic Model Requirements\nBefore uploading a model to RIOO-RS, please ensure everything is included:\nCheck Model Requirement [PG Section 6.2(5)(a) and Section 5.5]\nConsulted the Deliverables section at the end of this document for additional details?\nA PSS/e version 35 and PSS/e version 36 model (.raw, .dyr files and .dll file if a user-defined\nmodel; separate .dll files must be provided for version 35 and 36)\nThe model should not have been identified as unacceptable by NERC2\nThe model should include switched shunt and on-load transformer tap initialization scripts\n(PSS/e Python format) and include dynamic control models\nThe number, size, and name of units in PSS/e and TSAT should match registration and should\nnot be aggregated differently. Unit definitions can be found in RIOO-RS under “Unit Attributes”.\nIRR (wind and solar) models should be provided set up for “no-headroom” meaning that a\ndispatch less than Pmax does not result in a power increase to a frequency drop. The model\nmanual should describe steps to place the model in a “headroom” (curtailed) state.\nPSS/e model in Excel Template format. Blank Templates are downloadable from:\nhttps://www.ercot.com/services/rq/re . For User-Defined Models (UDMs), the new “Universal”\nmodel Template included in this package should be capable of importing any type of PSS/e\nmodel. Problems?: Email dynamicmodels@ercot.com with “Template Issue” in the subject line.\nA TSAT model if submitting a user-defined PSS/E model (.raw, .dyr, .dll, and .tudm files)\nTwo TSAT example cases, one set up using bus numbers matching the PSS/e case and the\nother set up using equipment names. Include a space in the generator node name(s) to confirm\nthat the model is compatible with space characters. (include .pfb plus above files)\nThe TSAT .dyr file should interoperate with the PSS/e .dyr file.\nThe TSAT .tudm file should only define the structure of the model and shall not include any\nproject-specific information\nModel manuals (okay to reference PSS/e manuals if using standard library models). PSCAD\nmodels must include manuals.\nPSCAD for Inverter-Based Resources (IBRs), embedded in the PSCAD Template\ndownloadable from Dynamic Templates at https://www.ercot.com/services/rq/re\nCompleted PSCAD Guideline checksheet. Available in the Model Quality Guide package.\nModel Quality Test report per DWG Procedure Manual. Plots should overlay PSS/e, PSCAD,\nand TSAT models as required. [PG Section 6.2(5)(c), PG Section 5.5(4) and 5.5(6)]\nModel matches field equipment and appears to meet the performance requirements in the DWG\nProcedure Manual section 3.1.5. If not, please explain limitations.\nPlant should regulate POIB voltages within the tolerance specified in NOG 2.7.3.5(4). This\ngenerally means that plant should provide full reactive capability of at least 0.95 pf or better at\n2 https://www.nerc.com/pa/RAPA/ModelAssessment/Pages/default.aspx . Click on “Dynamic Modeling\nRecommendations.” See Appendix A. If unacceptable, must be corrected at the next MOD-026/027 review.\n© 2025 ERCOT 4\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nPOIB, in response to a voltage step of 4 kV for a 345 kV POIB, a step of 2 kV for a 138 kV\nPOIB, and a step of 1 kV for a 69 kV POIB. It is recommended that REs test such a voltage\nstep and model switched shunt controls to identify issues where their proposed model and\nsettings may not meet operational requirements. Refer to Page 7.\nPlant Verification Report if updating field settings or any time per PG 5.5(6)(c). Details on this\nreport can be found in the About Verification Report included in this package.\nA Unit Model Validation (“Hardware Benchmark”) report is required to enter the QSA.\n[PG Section 6.2(5)(d), DWG Procedure Manual Section 3.1.6]\n© 2025 ERCOT 5\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nFIS Intercon-\nnection\n• Submit PSS/e and PSCAD models. VRT capability assessed during FIS studies\n• Recommend the IE run MQT and overlay PSS/e and PSCAD to avoid QSA delays\n• Recommend IE test plant model Automatic Voltage Regulation (AVR) and primary frequency\nresponse (PFR) for compliance (refer to next section)\nEntering\nQSA\n• Submit complete PSS/e, PSCAD, and MQT with overlay; both models in Template format\n• Include a Unit Model Validation report. Refer to DWG Procedure Manual 3.1.6.\n• Recommend confirm AVR and PFR model response in preparation for commissioning tests\n(refer to next section)\n• Check that field settings match QSA model parameters\nBefore Synch-\nronization\nBefore\nCommission-\ning (Part 3)\n(IBRs only)\n• Submit an MQT comparing “as-built” model response with the QSA model response. Submit\nseparate MQT comparisons for PSS/e and PSCAD.\n• Submit “as-built” models and re-submit QSA models, both PSS/e and PSCAD.\n• Refer to Planning Guide 5.5(4) --> Please follow the submission instructions!\n• Submit final PSS/e, PSCAD, (and TSAT) models to RIOO-RS\n• Include an MQT overlay of PSS/e and PSCAD (and TSAT)\n• Include a Verification Report. Further instructions in Figure 2\nCommissioning\n(Part 3 approval)\nwithin 30 days\n1-2 Years after\nCommissioning\nand for MOD-\n026/027 and\nEvery 10 Years\n• Re-submit final PSS/e, PSCAD, and TSAT models and MQT overlay to RIOO-RS\n• Submit an updated Verification Report. If no changes since the previous Verification, indicate\nthe date and method this was checked in an updated Verification report.\n• Further instructions in Figure 2\nBefore Making\na Field\nChange (IBRs\nOnly)\n• Before making a field change affecting the dynamic response, submit an MQT overlay of the\nproposed change model versus the as-built model. Include both models and required files.\n• MQT overlay in PSS/e and a separate MQT overlay in PSCAD.\n• Refer to Planning Guide 5.5(6)(a) --> Please follow the submission instructions!\n• Submit final PSS/e, PSCAD, (and TSAT) models to RIOO-RS\n• Include an MQT overlay of PSS/e and PSCAD (and TSAT)\n• Include a Verification Report. Further instructions in Figure 2.\nAfter Making a\nField Change,\nWithin 30 days\nFigure 1: Model milestones.\n© 2025 ERCOT 6\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nAVR and PFR Testing and Modeling Switched Shunt and Transformer\nTap Controllers\nAutomatic Voltage Regulation (AVR) and Primary Frequency Response (PFR) are required for all\nresource facilities according to Section 2 of the Nodal Operating Guides. During Part 2 of the\ncommissioning process, ERCOT will require operational testing of both.\nERCOT has observed many plants needing to making field adjustments during commissioning. These\nadjustments sometimes conflict with performance objectives in the Model Quality Testing, resulting in\nadditional model updates, and ultimately, a second round of field adjustments and testing.\nInterconnecting Entities can usually avoid these complications by ensuring that the models are\naccurate representations of the future facility and subjecting the models to AVR and PFR tests during\nthe planning stage. This requires precise modeling of any switched shunt and transformer tap\ncontrollers and ensuring they are well coordinated with protection settings and the generator reactive\ncontroller. To facilitate this effort, ERCOT is strongly encouraging all resources to model such\ncontrollers and provide initialization scripts in PSS/e (Python format) to ensure that the taps\nand switched shunts are initialized in the correct position for power flow initial conditions (real\nand reactive dispatch, POI voltage, etc.). When reviewing submitted models, ERCOT has often\nneeded to reach out regarding an MQT test reflecting poor performance. The Resource Entities (REs)\nreaches out to their consultant, who investigates and finds that the switched shunts were not initialized\nin the proper position. ERCOT must then re-review the model. This inefficient back-and-forth can\nagain be avoided by REs who provide accurate models of their shunt / tap controllers.\n• Nodal Operating Guide 2.7.3.5(4) requires plants to regulate their POIB voltage within a tight\ntolerance. For example, externally applying a 4 kV voltage step at a 345 kV POIB should result in\nthe model’s voltage regulator transitioning the model to maximum reactive power exchange\n(generally better than 0.95 power factor). Thus, it is recommended to model test applying the\nfollowing voltage steps to the POIB: ±4 kV step for a 345 kV POIB, ±2 kV for a 138 kV POIB, and\na ±1 kV for a 69 kV POIB.\n• Refer here for a sample IRR AVR test. For more information on the PFR and AVR testing,\ncontact Resource Integration. ResourceIntegrationDepartment@ercot.com\n➔ Please provide accurate dynamic models for all switched shunt and transformer tap controllers\nand provide Python file initialization scripts or powerflow model parameters for PSS/e so that\nthe correct initial shunt / transformer tap position is selected for the initial POI conditions.\n© 2025 ERCOT 7\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ?\nPLANNING\nMODEL UPDATE FOR\nRESOURCE IN THE\nPLANNING STAGE\nERCOT Public\nSubmit PSCAD model (IBRs) prior to starting SSR\nstudy or entering QSA\nAlso submit Unit Model Validation and TSAT/PSCAD Model\nQuality Test. Ref ERCOT Planning Guide 6.2(5)(c) to (d).\nBefore Part 3 of\nResource\nCommissioning\nOPERATIONAL RESOURCE\nPROPOSED\nCHANGE AT\nRESOURCE\nCheck AVR / PFR compliance\n(previous page) and run Model\nQuality Test on PSS/E model\nbefore starting FIS. See Note 1.\nRun a comparison Model\nQuality Test (MQT), overlaying\nthe QSA model versus the\ncurrent field settings model.\nPlanning Guide (PG) 5.5(4).\nSubmit to ERCOT for approval. ERCOT may\ndecide the change requires further study.\nEmail notification to\ndynamicmodels@ercot.com with “IBR Prior to\nCommissioning” in subject. Ref. Note 2.\nIf the proposed\nchange falls under\nPG 5.2.1(1), stop\nand contact\nResource\nIntegration.\nFor IBRs, overlay an MQT\nof the old versus new\nmodel response.\nPG 5.5(6)(a). (Synchronous\nfacilities, skip to “Submit a\nmodel package” block.)\nSubmit to TSP and ERCOT for\napproval. Email notification\nto dynamicmodels@ercot.com\nwith “IBR Proposed\nModification” in the subject.\nERCOT may decide further\nstudy is required.\nUpdate PSS/E, TSAT, and PSCAD.\nInclude a combined Model Quality Test\nwith PSS/E-PSCAD-TSAT overlay. PG\n6.2(5)(c). Ref Note 2.\nRun Model Quality Test and\nParameter Verification report\nduring MOD 26/27 study\n(Note final submission to ERCOT\nwill require MQT to have PSCAD-\nDynamic Model overlay)\nALWAYS submit updated\nDynamic Model Template\nEven if the model did not change,\nupdate the MOD 26/27 date in the\ntemplate and submit to RIOO\nFigure 2: Model update process flow for Resource Entities (REs) and Interconnecting Entities (IEs).\nNote 1: IBRs, a joint Model Quality Test report (showing the PSS/E and PSCAD models overlaid) is required to enter the QSA and may be advisable to enter the FIS.\nNote 2: Follow instructions in this document for submission of models. Per the DWG Procedure Manual, PSCAD models are generally required for all inverter-based resources (certain IBRs\nconstructed prior to 2015 may only require a PSCAD model if requested by ERCOT). TSAT models are required if utilizing a PSS/E model that is user-defined. Resource Owners must notify the\ninterconnecting TSP of any model updates.\nWithin 30 days of ERCOT granting Part 3\napproval, then per PG 5.5(5)…\nAfter the change is\napproved and\nwithin 30 days after\nimplementation,\nthen…\nSubmit a model package and\nverification report. The MQT\nshould overlay the new PSS/e,\nTSAT, and PSCAD as applicable\n(not include the old model).\nPG 5.5(6)(c)\nMODEL CORRECTION\n/ UPDATE (No change\nat facility)\nSCHEDULED\nNERC MOD\n26/27 Model\nValidation\nSubmit Dynamic Model Update Package\nto ERCOT as a zip file upload to RIOO-RS.\nInclude all relevant models (PSS/E, TSAT,\nPSCAD), even models that are not being\nupdated, and overlay in the MQT report.\nRefer to Note 2 for package contents.\nAlso notify TSP of the change.\nTSP\nReview &\nApproval\nRE action\nTSP / ERCOT action\n© 2025 ERCOT 8\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nRequirement Applicable Facilities Required Tests(1) When to Update Responsible\nEntity\nModel Quality Test for PSS/E,\nAll Resources and Inverter-Based\nFlat start, small and large voltage\nA new or updated PSS/E, TSAT, or\nFacility owner\nPSCAD model. Model updates are\nTSAT, and PSCAD Models\nTransmission Elements\ndisturbance, small frequency\nrequired:\n(RE, IE, or TSP)\n• TSAT required if utilizing a\ndisturbance, system strength, and\n1. When there is a change at the\nuser-defined model (UDM)\nphase angle jump(2) tests\nfacility (refer to flow chart on\n(A single report should show\n• PSCAD generally required for\nprevious page).\nthe PSS/E, TSAT, and PSCAD\nInverter-based Resources\n• Advanced Grid Support (AGS, e.g.,\n2. To enter QSA.\nmodel responses overlaid on\n(IBRs) and Inverter-based\n“grid forming”) resources have\n3. Before requesting Part 3 approval.\nDynamic Transmission\nthe same plot axes.)\nmodified MQT tests which include\nElements\n4. Within 30 days of Part 3 approval.\ninertia response test and a loss of\n5. Completing MOD-026/027 studies.\nsynchronous machine test (3)\nUnit Model Validation for\nInverter-based Resources (IBRs) Step change in voltage, large voltage\nA new PSCAD model provided after\nFacility owner\nPSCAD Model(4)\ndisturbance, system strength, phase\n3/1/21. (UMV reports should not need\n(RE or IE)\nangle jump, and subsynchronous tests\nupdating for model parameter\nupdates.)\nModel Parameter Verification\nAll Resources and Inverter-Based\nProvide evidence that tunable model\nA report is required:\nFacility owner\n1. Within 30 days of Part 3 approval,\n(“Verification Report”)\nTransmission Elements\nparameters match what is\n(RE, IE, or TSP)\n2. Within 12 to 24 months after Part 3\nimplemented in the field. Evidence can\napproval. (Projects built before\ntake the form of screenshots,\nMarch 1, 2021, required by March\nnameplate photographs, signed\n1, 2023),\nmanufacturer commissioning reports,\n3. A minimum of every ten years, and\n4. Within 30 days of implementing a\netc.\nchange at the facility.\n(1). Detailed test information is available in the DWG Procedural Manual 3.1.5.\n(2). System strength and phase angle jump tests are only applicable to inverter-based facilities. The phase angle jump test is required only for the PSCAD model.\n(3). Refer to the “List of Applicable Tests” table in the DWG Procedure Manual for details on which tests apply for each technology.\n(4). Benchmark the PSCAD model against actual hardware measurements. This is not a site-specific test; the same report can be submitted whenever the same hardware is used.\n© 2025 ERCOT 9\nAll rights reserved.\nPlanning Guide\nLanguage\nPG 6.2(5)(c),\nPG 6.2.1,\nPG 5.5(6)(b)\nPG 5.5(4),\nDWG\nProcedure\nManual 3.1.5(3)\nPG 6.2(5)(d),\nDWG\nProcedure\nManual 3.1.6\nPG 5.5(5)\nPG 5.5(6)(c),\nPG 6.2(5)(b)\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nAbout Dynamic Models\nDynamic models are utilized to simulate time-domain phenomena on the ERCOT system. These\nmodels use mathematical state equations to represent generating plant behavior to disturbances. A\nsummary of the types of models is listed below.\nDYNAMIC STABILITY MODELS\n(PSS/E and TSAT)\n• Used for general dynamic simulations\n• Required for all modeled generators\n• Submitted using Dynamic Model Templates\n• Manual should illustrate control logic\n• Must undergo model quality testing\n• Either Standard Library or UDM (User-\nDefined)\nTRANSIENT (EMT) MODELS\n(PSCAD)\n• Used for specialized studies\n• Required for all inverter-based equipment\nincluding wind, solar, batteries\n• Must complete PSCAD Model Guideline\ncheck sheet\n• Manual should describe model set up\n• Must undergo model quality testing\nDYNAMIC STABILITY MODELS CAN BE STANDARD LIBRARY OR UDM\n• Standard Library models come included in the software. This includes WECC “Generic”\nmodels and most synchronous power plant models\n• User-Defined Models (UDM) models may provide a more accurate response\n• UDM require .DLL files from the OEM for PSS/E and .DLL and .TUDM files for TSAT\n• UDM typically require update with each new version of software*\n• UDM models should adhere to the enclosed ERCOT UDM Guideline\n• Either UDM or Std. Library/Generic are acceptable for ERCOT and for MOD 26/27 studies\n• Generic WECC models should be confirmed by the manufacturer\n* In many cases, this update effort is minimal. Manufacturers compile an updated version of their .DLL file. The parameters\nrepresenting site-specific settings may remain the same in which case the MQT report would not require updating.\nFigure 3: Model Types\nERCOT requires models to be provided supporting PSS/E and TSAT software and also requires\nPSCAD models for IBRs (e.g., wind / solar / battery resources). These models are typically furnished\nby the device manufacturer and should reflect the site-specific settings and layout of the plant all the\nway up to the Point of Interconnection (POI). The stability models for can be of either UDM or Standard\nLibrary/Generic type. Both types are acceptable for use in MOD 26/27 studies. See discussion on\nthe next page.\n© 2025 ERCOT 10\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nA Caution about Generic Models and MOD 026/027 Studies\nMany REs appear to be using generic models for their MOD 26/27 studies. While not prohibited,\nERCOT has observed a high proportion of these models not yielding acceptable response, are no\nlonger passing Voltage Ride Through, or have a response that is markedly different than the original\nUDM model without providing technical rationale. Per the rules in Planning Guide Section 6, ERCOT\nwill reject such models. Please refer to the enclosed presentation.\nThe cause of this problem is perhaps rooted in the fact that generic models are lower fidelity models\nand necessitate great care in choosing appropriate parameters. The expertise necessary to convert\nfrom a UDM model to a generic model usually requires involvement of the manufacturer and is\nsometimes not within the expertise of 3rd party consultants advertising MOD 26/27 services.\nIn the ERCOT region, UDM models are allowed for MOD 26/27 studies and there is no requirement\nthat generic models must be used. ERCOT DWG has adopted the “unacceptable” portion of the NERC\nAcceptable Models List3\n.\n4 Thus REs may use any model that NERC has not classified as unacceptable\nincluding models not appearing on the NERC list.\nERCOT recommends Resource or Interconnecting Entities providing a generic model to obtain\nconfirmation from their equipment manufacturer to ensure that the generic model is appropriate.\nDynamic Model Templates\nDynamic stability (PSSE/TSAT) and transient (PSCAD) models are submitted to ERCOT using model\ntemplates. The templates are downloadable from the ERCOT Resource Entity webpage:\n→ https://www.ercot.com/services/rq/re\nThe posted templates support a wide range of manufacturers and technologies. If you find that your\ndynamic model is not supported by the posted templates, contact dynamicmodels@ercot.com and put\nthe phrase “Template Issue” in the email subject.\nAny updated PSCAD models should be submitted in PSCAD Template format. The PSCAD Template\nis stored in the same zip file as the dynamic model Templates. There is an included slide tutorial.\n3 NERC Acceptable Models List, https://www.nerc.com/pa/RAPA/ModelAssessment/Pages/default.aspx\n4 ERCOT rule regarding acceptable models: Refer to Section 3.1.9 of the DWG Procedure Manual, posted at\nhttps://www.ercot.com/committees/ros/dwg\n© 2025 ERCOT 11\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nThe Model Quality Test\nThe model quality test is designed to help a Resource or Interconnecting Entity test their model before\nsubmitting to ERCOT. This helps ensure the model meets requirements and reduces arduous back\nand forth communication and corrections. Two optional tools are provided to facilitate testing:\nDMVIEW for PSS/E and PMVIEW for PSCAD. (No tool is currently provided for TSAT however it is\nstraightforward to set up using the TSAT injection function. Search for “Voltage and Frequency/Angle\nInjection Data” in the TSAT Model Manual.) At the conclusion of the test, the Resource or\nInterconnecting Entity provides a test report and testing files to ERCOT via RIOO.\n• Model quality tests must be performed using the current version of the Planning\nSoftware (ref. DWG Manual 3.1.5.1). DWG is in the process of transitioning to PSS/e\nversion 36; thus, the MQT may be run in either PSS/e version 35 or PSS/e version 36. The\ncurrent version of PSCAD is version 4.5 or higher (ref. DWG Manual 3.1.1).\n• Model quality tests must be provided whenever providing a new or updated PSS/E, TSAT, or\nPSCAD model.\no Standard library/generic models are not required to provide an MQT report testing\nthe model in TSAT. User-defined models (UDM) are required to provide an MQT\nreport testing the model in TSAT as well as PSS/E.\n• In most situations, the PSS/E, TSAT and PSCAD models should be updated at the same\ntime. Please overlay the PSS/E-TSAT-PSCAD MQT plots to facilitate comparison.\n• For synchronous plants, a MOD 26/27 test report plus TSP usability report of the same\nmodel may fulfill ERCOT’s model quality test requirements. However, for inverter-based\nresources, MOD 26/27 reports do not fulfill the MQT requirements.\n• Resources should perform model quality testing at the same time as conducting MOD 26/27.\nThe table below summarizes the required MQT tests for each type of facility:\nHybrid Facility\n(battery + other\ngenerator)\nSolar or Wind Battery only (ESR) Self-Limited (SLF)\nHybrid Facility\nRun all MQT tests at\nRun all MQT tests at\nRun all MQT tests under\nRun all MQT tests under\n100% generation unless\n100% charging and again\nthe following 4 scenarios:\nthe following 4 scenarios:\nindicated otherwise by the\nat 100% discharging\n• Standalone battery\n• Standalone battery\ntest (e.g. most frequency\nunless otherwise indicated\ncharging\ncharging\ntests run at 80%)\nby the test.\n• Standalone battery\n• Standalone battery\ndischarging\ndischarging\n• Standalone generator\n• Standalone generator\nwith battery offline\nwith battery offline\n• Battery discharging +\n• Battery discharging at\n100% generation\n50% plus generator at\n50% (adjust if\nnecessary to respect\nlimit)\n© 2025 ERCOT 12\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nHybrid plants consisting of an energy storage system (“ESS”) plus some other generation resource\n(“non-ESS”) are required to run a combined MQT and submit combined models if any of the\nfollowing apply:\n• The different components share one or more main power transformers\n• The different components share a common control system, such as a master power plant\ncontroller\n• If neither of these apply, then the hybrid plant may submit separate models and separate\nMQTs of the ESS and of the non-ESS. The MQT of the ESS must consider both charging\nand discharging scenarios.\n© 2025 ERCOT 13\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nEnergy Storage Resources consisting of Advanced Grid Support (AGS-ESR) must run the required\nAGS-ESR scenarios (refer to the “List of Applicable Tests” table in the DWG Procedure Manual).\nTable: Required Tests for an AGS-ESR only Facility and DWG Procedure Manual Section\nStand-alone AGS-ESR\nRun these tests for\n• Flat-start, 3.1.5.2\nboth charging and\n• Large volt disturbance\no LVRT Test, 3.1.5.4\nagain for discharging\no HVRT Test, 3.1.5.5\nTest discharging only • AGS small volt disturbance, 3.1.5.11\n• AGS system strength, 3.1.5.13\n• AGS phase angle jump, 3.1.5.14\nTest at 0 MW dispatch • AGS frequency change and inertia response, 3.1.5.12\nTest with other\ndispatch scenario\n• AGS Loss of synchronous machine, refer to 3.1.5.15 for the dispatch\nTable: Required Tests for a Hybrid AGS-ESR Facility and DWG Procedure Manual Section\nAGS-ESR component\nonline, non-AGS-ESR\noffline\nAGS-ESR component offline,\nnon-AGS-ESR IBR online,\nBoth AGS-ESR component\nonline and non-AGS-ESR\nIBR online\nRun these\nFlat-start, 3.1.5.2\n• Flat-start, 3.1.5.2\ntests for both\nLarge volt disturbance\n• Small volt disturbance,\nLVRT Test, 3.1.5.4\n3.1.5.3\ncharging and\nHVRT Test, 3.1.5.5\n• Large volt disturbance\nagain for\no LVRT Test, 3.1.5.4\ndischarging\no HVRT Test, 3.1.5.5\n• Small frequency disturbance,\n3.1.5.7\n• System Strength, 3.1.5.8\n• Phase Angle Jump, 3.1.5.9\nTest\ndischarging\nonly\nAGS small volt\ndisturbance, 3.1.5.11\nAGS system strength,\n3.1.5.13\nAGS phase angle jump,\n3.1.5.14\n• Flat-start, 3.1.5.2\n• Small volt disturbance,\n3.1.5.3\n• Large volt disturbance\no LVRT Test, 3.1.5.4\no HVRT Test, 3.1.5.5\n• Small frequency\ndisturbance, 3.1.5.7\n• System Strength, 3.1.5.8\n• Phase Angle Jump, 3.1.5.9\nTest at 0 MW\n• AGS frequency\ndispatch\nchange and inertia\nresponse, 3.1.5.12\nTest with other\ndispatch\nscenario\n• AGS Loss of\nsynchronous machine,\nrefer to 3.1.5.15 for the\ndispatch\n© 2025 ERCOT 14\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nA sample testing report is enclosed with this document. Details on the model quality test can be\nfound in the most recent DWG Procedure Manual, Section 3.1.5 posted at:\n→ https://www.ercot.com/committees/ros/dwg\nThe DWG Procedure Manual Section 3.1.5 contains information:\n• How to set up the simulation\n• Types of tests to perform\n• Test criteria\n• Example plots\nUsing DMVIEW\nDynamic Model reView (DMVIEW) is an optional external tool that can be used to perform model\ntesting in PSS/E. Download the tool from:\n→ https://sites.google.com/view/dmview/home\nBefore using DMVIEW, you must have a working dynamic case with your plant modeled up to the\nPoint of Interconnection (POI). Please refer to the DMVIEW manual for complete instructions as\nwell as the DWG Procedure Manual Section 3.1.5 for how to set up the case. Some helpful tips are\nprovided here.\n1. Copy your model files to a new folder under the CASEs folder. Follow the DMVIEW Program\nManual instructions to place a slack generator connected to the POI bus by a zero-impedance\nline. Tip: ERCOT has found that adding a very small amount of impedance to the zero-\nimpedance line will facilitate setting an initial reactive flow. For example, use a value of 0.001\nreactance.\na. The generator is connected to the medium voltage bus by the appropriate transformers\nand collector system equivalent. Note: You must use an aggregate model (i.e. do not\nmodel individual wind turbines or solar inverters). Several methods exist for calculating\nthe equivalent collector impedance; see for instance the NREL/WECC method5\n.\nb. Refer to the DWG Procedure Manual Section 3.1.5 for information on setting up the\ninitial voltage schedule and dispatch.\ni. For most of the tests, you can set up an initial 0 MVAr reactive exchange at\nthe POI. A convenient way to achieve this is to set the voltage schedules of\nthe slack generator and test generator to 1.0 per-unit and set the test generator\nto regulate the POI bus. For the lead and lag Voltage Ride Through tests\n(LVRT/HVRT), you can modify the voltage schedule of the test generator\nslightly to achieve a desired reactive dispatch at the POI or the latest version\nof DMVIEW accepts POI_\nPF = 0.95 command in the INI file for lagging\nand -0.95 for leading. Tip: Assign the “zero impedance” branch a slight non-\nzero impedance, say 0.001 reactance, to facilitate voltage control initialization.\nc. Ensure that the powerflow solves.\n5 E. Muldadi, “Method of Equivalencing for a Large Wind Power Plant with Multiple Turbine Representation.”\nNREL Conference paper, July 2008. https://www.nrel.gov/docs/fy08osti/42886.pdf\n© 2025 ERCOT 15\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\n2. 3. d. For Inverter-Based Resources (including Wind, Solar, and Batteries), you will generally\nneed to set up four powerflow cases and run DMVIEW four times:\ni. Case with 100% real power and minimal reactive power exchange\nii. Case with 80% real power and minimal reactive power exchange for the\nfrequency step tests\niii. Case with 100% real power and 0.95 power factor leading at the POI for the\nvoltage ride through tests (also called the Large Voltage Disturbance tests)\niv. Case with 100% real power and 0.95 power factor lagging at the POI for the\nvoltage ride through tests (also called the Large Voltage Disturbance tests)\nCopy one of the example INI files (either Wind.ini or Solar.ini) and edit the path names to\ncorrectly point to your project files.\nChange the tests specified in the INI file: (for synchronous plants, see footnote6)\nTest1_FS = ['FS','10']\nTest2_VDWN = ['VOLT','DATAs\\\\ERCOT_VOLT-STEP-DOWN.xlsx']\nTest3_VUP = ['VOLT','DATAs\\\\ERCOT_VOLT-STEP-UP.xlsx']\nTest4_HVRT = ['VOLT','DATAs\\\\ERCOT_HVRT.xlsx']\nTest5_LVRT = ['VOLT','DATAs\\\\ERCOT_LVRT.xlsx']\nTest6_FRQDWN = ['FREQ','DATAs\\\\ERCOT_FRQ-STEP-DOWN.xlsx']\nTest7_FRQDWN = ['FREQ','DATAs\\\\ERCOT_FRQ-STEP-UP.xlsx']\nTest8_SCR2 = ['SCR2', '10->5->3->1.5->1.2, 5, 1'] /SCR is changed from 10 to\n1.2 in 5 second intervals, with fault.\n4. 5. 6. These settings will run the following tests:\n• No disturbance 10-second Flat Start\n• POI Voltage Step Down 3%\n• POI Voltage Step Up 3%\n• HVRT\n• LVRT\n• Frequency Step Down 0.3 Hz, assuming no headroom\n• Frequency Step Down 0.3 Hz, assuming headroom7\n• Frequency Step Up 0.3 Hz\n• Short Circuit Ratio Test\nFollow the program instructions to run the tool.\nCompare your result plots to the examples illustrated in the DWG Procedural Manual. From\nthese, you should get a good idea whether your model will be acceptable.\nPrepare a test report similar to the enclosed example. Submit to ERCOT.\n6 For synchronous plants such as fossil, delete the HVRT, LVRT, and SCR2 tests and add Test8_FAULT = ['FAULT','-\n2e10'] at the end. You will need version 2.5.1 or higher of DMVIEW.\n7 “Headroom / no headroom”: Refer to discussion under the heading “A special note on the frequency tests.”\n© 2025 ERCOT 16\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nUsing PMVIEW\nPSCAD Model reView (PMVIEW) is an optional external tool that can be used to perform model\ntested in PSCAD. One benefit over other tools is that it will perform most tests in one button click\nusing the PSCAD multi-run block. Download the tool from:\n➔ https://sites.google.com/view/pmview\nBefore using PMVIEW, you must have a working PSCAD case with your plant modeled up to the\nPoint of Interconnection (POI). A brief manual is included in the download. More help is available\nonce the tool is opened in PSCAD; the tool has numerous comment boxes to guide you through\nusage.\nUnacceptable Test Results per the DWG Procedure Manual\nIf you find that your model is unacceptable and it is for an existing resource, provide a description of\nthe issue, including whether the shortcoming is limited to the model or whether the shortcoming really\nexists in the field. Your priority is to first provide an accurate model of your resource as it exists in the\nfield. Then afterwards, develop a plan to correct the shortcoming. Provide a proposed model\nillustrating the corrected response to ERCOT for review along with an estimated timeline. After\nadjustments are made, a new PSS/E / TSAT / PSCAD model, model quality test reports, and\nverification report should be submitted.\nA special note on the frequency tests\nRenewable generators typically operate in a “power availability” state without headroom. Thus, there\nwill be no response to a low frequency event unless the plant is curtailed (i.e., has headroom). By\ndefault, the model should be set up to interpret PGEN < PMAX to mean that power availability is less\nthan capability (e.g., wind speed or solar insolation is lower than maximum) so the model should not\nrespond to a low frequency event. There should be some means to enable headroom (such as a\nswitch or flag in the dynamic model) to tell the model to instead interpret PGEN < PMAX to mean that\nthe facility is curtailed. The dynamic model should not require adjusting PMAX to indicate whether\nheadroom is available. A flag in the dynamic model would be the preferred means to indicate\nheadroom availability. (This discussion only applies to renewable units; for conventional units the\ndifference between PGEN and the temperature-compensated PMAX is typically available to the\ngovernor for frequency response.)\nERCOT requires that all intermittent renewable (IRR) models be able to operate in the “no headroom”\nstate and this be the default setting when the model is received. If the model is not currently capable\nof being switched for headroom / no headroom, then this limitation should be explained in the quality\nreport with a note when the feature will be added.\n© 2025 ERCOT 17\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nDeliverables\nModels and Verification reports should be submitted to ERCOT’s RIOO-RS portal:\n• Select your plant or station and begin a New Change Request. The type of Change Request\nshould be an “Attachment Only” change request.\n• Upload all files as attachments. Compressed .zip file format works best. The maximum size\nper file is approximately 60 MB so it may be necessary to split large files into smaller files by\nun-zipping them first and re-zipping them.\n• Be sure to upload all plant models, manuals, and reports to the change request, even\nmodels that are not being changed (Refer to Section 1 of this document, ERCOT Dynamic\nModel Requirements). Thus, for example, if you are updating the PSS/E model, then please\nattach your latest PSCAD model as well for IBR plants. To indicate whether a model is being\nupdated, please indicate the model update date in the filename. For example, a PSCAD\nmodel which was last updated December 27th 2018 for Sitecode Turtle should be named\n“TURTLE_PSCAD_2018-12-27.zip” Refer below for file naming instructions.\n• If you have difficulties using RIOO-RS, first see the RIOO guides posted at\nhttps://www.ercot.com/services/rq/re and, if that does not resolve your issue, then email\nRIOO-help@ercot.com. If all else fails, reach out to your ERCOT client services account\nmanager asking to submit files an MIS service request. You will need a digital certificate with\nrole assigned called “MP Assets” in order to make the upload.\nSubmitting PSS/E and TSAT models:\n✓ Model contained within an Excel model template8\n✓ If the model is a user-defined model (UDM), then submit:\no Models adhering to the requirements in the included “ERCOT UDM Guideline”\no PSS/E model package (including .sav or .raw, .dyr, and .dll files) set up based on the\nbus numbers that aligns with the bus numbers in the TSAT model package\no TSAT model package (.raw, .dyr, .dll, and .tudm files) set up based on the bus numbers\nthat align with the bus numbers in the PSS/E model package\no TSAT model package (.pfb, .dyr, .dll, and .tudm files) set up based on Equipment\nNames. The equipment names should include a space in the names to demonstrate\nthat the UDM model is compatible with the space character (an ERCOT TSAT\nrequirement)\no A model manual describing simulation set-up, tunable parameters, and illustrating a\nfunctional control block diagram\no Include switched shunt and transformer tap initialization scripts and controls as\nnecessary\n✓ Model Quality Test report (a sample report is included)\no Include the test case consisting of .sav, .dyr, and any .dll files.\n8 Blank Templates for PSS/e and PSCAD can be downloaded from: https://www.ercot.com/services/rq/re User-defined model\ntemplates are available upon request by emailing dynamicmodels@ercot.com with “Template Request” in the email subject line.\n© 2025 ERCOT 18\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\no Overlay the PSCAD and TSAT model responses with the PSS/E model response.\n(TSAT is required for UDM models and PSCAD is required for most IBR models.)\nSubmitting PSCAD models:\n✓ Model contained within a PSCAD template\n✓ PSCAD model with model manual\n✓ Completed PSCAD model guideline (a blank guideline checksheet is included)\n✓ Model Quality Test report showing the PSS/E and TSAT model responses overlaid\n✓ Unit model verification (“hardware benchmark”) (required for resources interconnected after\n3/1/2021)\nFile Submission and Naming Guides:\n• For the PSS/E / TSAT models, package all files into a single compressed zip file, name the\nfile: (SITECODE)_DYNAMIC_(date).zip with the appropriate sitecode and date, and upload\nto ERCOT’s RIOO portal.\n• For the PSCAD model, package all files into a single compressed zip file, name the file:\n(SITECODE)_PSCAD_(date).zip, and upload to ERCOT’s RIOO portal.\n• The “date” in the filename should refer to the date that the model was last updated.\n• RIOO has an upload file size limit of approximately 60 MB. If your file is too large, you may\nneed to re-zip a file, splitting the contents into several smaller zip files for upload.\n• Please submit all models, even models that you are not currently updating. For example, an\nIBR utilizing a UDM model should submit the PSS/E, TSAT, and PSCAD models. The date\nin the filename will indicate to ERCOT whether, for example, the PSCAD model was\nupdated.\nOperational resources must also submit a model parameter verification report as required by\nPlanning Guide 5.5 (5) and Planning Guide 5.5 (6)(c). Refer to the “About Verification Reports”\ndocument for additional information about this report.\nQuestions:\n➔ Regarding dynamic models? → dynamicmodels@ercot.com\n➔ Regarding RIOO / RIOO-RS system? → RIOO-HELP@ercot.com\n➔ Additional contacts found in the “Where to Find Help” section of this document.\n© 2025 ERCOT 19\nAll rights reserved.\nERCOT Dynamic Model Submittal Guideline ERCOT Public\nEnclosures\n• ERCOT PSCAD Model Guideline\n• ERCOT UDM Model Guideline\n• ERCOT presentation, Caution with Generic Models\n• Memo on REGC Generic Models\n• Sample model quality test report and files\n• Sample verification (PVR) report\n• About Verification Reports informational document\nReferences\n• Dynamic Model Templates, posted at https://www.ercot.com/services/rq/re\n• DMView PSS/E model testing tool. Available at https://sites.google.com/view/dmview/home\n• PMView PSCAD model testing tool. Available at https://sites.google.com/view/pmview\n• NERC Unacceptable Model List\nhttps://www.nerc.com/pa/RAPA/ModelAssessment/Pages/default.aspx\n• DWG Procedure Manual Section 3.1.5 https://www.ercot.com/committees/ros/dwg\n• ERCOT Planning Guide Section 5.5 and Section 6,\nhttp://www.ercot.com/mktrules/guides/planning/current\n• NOGRR-245 Market Notice, https://www.ercot.com/services/comm/mkt_notices/M-A010825-01\no Questions regarding NOGRR-245 (and Nodal Operating Guide Section 2) → nogrr245@ercot.com\n© 2025 ERCOT 20\nAll rights reserved.\n(Sample Verification Report)"
  },
  {
    "id": "RI_8",
    "text": "Resource Name:  TURTLE GENERATION STATION\tDate of this Report: 8/7/2023\nDate(s) Field Settings Checked at Plant:\n5/2023:  Protection and PSS settings \n6/2022:  Date of MOD-026/027 Reports\tNames of Reference Documents (attached):\nTurtle MOD-026/027 Reports\nTurtle commissioning models\n\n\nGeneral Description:\n\nThis report is submitted to support the model parameters for the TURTLE GENERATING STATION.  The Governor and Exciter and Stabilizer models were checked through testing in the MOD-026/-027 reports.  In May of 2023, plant personnel downloaded the power system stabilizer and protection parameters to directly confirm the settings in those devices.  Tables of tunable or site-specific model parameters and their verified values are listed below.\n\n(Notes to the author writing this Verification report:\n1.\tThe new dynamic model Template contains a worksheet that can function as your verification report.  There is no need to prepare a separate report if you complete this worksheet and populate the field-verified data.\n2.\tYou can verify either your PSS/e or your PSCAD model.  However, if you verify the PSCAD model, please provide evidence you also confirmed the protection models in the PSS/e model, since these are not guaranteed to match when overlaying PSS/e versus PSCAD in the MQT report.\na.\tThe new dynamic model Template provides helpful tips on this one. \n3.\tFollow the instructions in the Model Quality Guide on submitting your models along with this report.  You must submit models when submitting a verification report.  This includes submitting both models, even if only verifying one or the other.)  \n\nGENERATOR [GENROU], checked by commissioning model documents.\nPSS/E Index\tParameter Name\tModel Value\tActual Field Equipment\tVerification Method\tMatch?\n\tH, Inertia\t5.7\t5.7\tDOCS\tY\n\tS(1.0) Saturation\t0.002\t0.002\tDOCS\tY\n\tS(1.2) Saturation\t0.03\t0.03\tDOCS\tY\n\n\nEXCITER [ESST4B], checked by MOD-026.\nPSS/E Index\tParameter Name\tModel Value\tActual Field Equipment\tVerification Method\tMatch?\n\tAVR proportional Gain\t110\t110\tMOD-026\tY\n\tAVR integral Gain\t10\t10\tMOD-026\tY\n\n\nSTABILIZER [PSS2B], checked by directly query digital stabilizer settings.\nPSS/E Index\tParameter Name\tModel Value\tActual Field Equipment\tVerification Method\tMatch?\n\tTw1 First Washout\t3.5\t3.5\tDirect\tY\n\tTw2 Second washout\t3.5\t3.5\tDirect\tY\n\tTw1 First Washout\t3.5\t3.5\tDirect\tY\n\tTw2 Second washout\t0.5\t0.5\tDirect\tY\n\tKs2 Gain on Signal #2\t0.4\t0.4\tDirect\tY\n\tKs2 Gain on Signal #2\t0.7\t0.7\tDirect\tY\n\n\nGOVERNOR [GGOV1], checked by MOD-027.  Droop directly checked in equipment settings.\nPSS/E Index\tParameter Name\tModel Value\tActual Field Equipment\tVerification Method\tMatch?\n\tDroop\t5%\t5%\tDirect\tY\n\tKpgov Proportional Gain\t6.0\t6.0\tMOD-027\tY\n\tKigov Integral Gain\t0.5\t0.5\tMOD-027\tY\n\tActuator Time Const\t0.6\t0.6\tMOD-027\tY\n\n\nPROTECTION [Overvoltage] checked directly in relay settings.\nModel\tField Relay\t\t\nV Thres\tSeconds\tV Thres\tSeconds\tVerification Method\tMatch?\n1.25\t0.02\t1.25\t0.02\tInspection of relay curves\tY\n1.11\t8\t1.11\t8\tInspection of relay curves\tY\n\t\t\t\t\t\n\n\nPROTECTION [Undervoltage] checked directly in relay settings.\nModel\tField Relay\t\t\nV Thres\tSeconds\tV Thres\tSeconds\tVerification Method\tMatch?\n0.6\t0.02\t1.25\t0.02\tInspection of relay curves\tY\n0.80\t8\t1.11\t8\tInspection of relay curves\tY\n\n\nPROTECTION [Underfrequency] checked directly in relay settings.\nModel\tField Relay\t\t\nHz Thres\tSeconds\tHz Thres\tSeconds\tVerification Method\tMatch?\n65\t0.02\t65\t0.02\tInspection of relay curves\tY\n62\t8\t62\t8\tInspection of relay curves\tY\n\n\nPROTECTION [Overfrequency] checked directly in relay settings.\nModel\tField Relay\t\t\nHz Thres\tSeconds\tHz Thres\tSeconds\tVerification Method\tMatch?\n57.5\t0.02\t57.5\t0.02\tInspection of relay curves\tY\n58.5\t8\t58.5\t8\tInspection of relay curves\tY"
  }
]