[
  {
    "id": "chunk_0_part_0",
    "text": "--- Area Data — .txt ---\n\nArea Data — \n\nArea Data¶\n\n\n\n\n\naareachar\n\n return an array of character values for subsystem areas.\n\naareacount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the area data family.\n\naareacplx\n\n return an array of complex values for subsystem areas.\n\naareaint\n\n return an array of integer values for subsystem areas.\n\naareareal\n\n return an array of real values for subsystem areas.\n\naareatypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the area data family (aAreaInt, aAreaReal, aAreaCplx and aAreaChar).\n\n--- Area Subsystems — .txt ---\n\nArea Subsystems — \n\nArea Subsystems¶\n\n\n\n\n\nasys\n\n define an area subsystem.\n\nasysdef\n\n set the definition of an area subsystem.\n\nasysinit\n\n initialize or re-initialize an area subsystem.\n\n--- Assign Branch Quantities To Output Chann"
  },
  {
    "id": "chunk_0_part_1",
    "text": "els — .txt ---\n\nAssign Branch Quantities To Output Channels — \n\nAssign Branch Quantities To Output Channels¶\n\n\n\n\n\nbranch_app_r_x_channel\n\n add a pair of output channels containing the apparent impedance, as seen at the from bus of a specified branch, along with a corresponding call to the RELAY2 monitoring model.\n\nbranch_mva_channel\n\n add an output channel containing the MVA flow at the from bus of a specified branch, along with a corresponding call to the FLOW1 monitoring model.\n\nbranch_p_and_q_channel\n\n add a pair of output channels containing the active and reactive power flow at the from bus of a specified branch, along with a corresponding call to the FLOW1 monitoring model.\n\nbranch_p_channel\n\n add an output channel containing the active power flow at the from bus of a specified branch, along with a corresponding call to the FLOW1 monitoring model.\n\nthree_wnd_app_r_x_channel\n\n add a pair of output channels containing the apparent impedance as seen at the from bus of a specified th"
  },
  {
    "id": "chunk_0_part_2",
    "text": "ree-winding transformer, along with a corresponding call to the RELAY3 monitoring model.\n\nthree_wnd_mva_channel\n\n add an output channel containing the MVA flow at the from bus of a specified three-winding transformer, along with a corresponding call to the FLOW3 monitoring model.\n\nthree_wnd_p_and_q_channel\n\n add a pair of output channels containing the active and reactive power flow at the from bus of a specified three-winding transformer, along with a corresponding call to the FLOW3 monitoring model.\n\nthree_wnd_p_channel\n\n add an output channel containing the active power flow at the from bus of a specified three-winding transformer, along with a corresponding call to the FLOW3 monitoring model.\n\n--- Assign Machine Quantities To Output Channels — .txt ---\n\nAssign Machine Quantities To Output Channels — \n\nAssign Machine Quantities To Output Channels¶\n\n\n\n\n\nmachine_app_r_x_channel\n\n add a pair of output channels containing the apparent impedance of the system, as seen from the terminal"
  },
  {
    "id": "chunk_1_part_0",
    "text": "s of a specified machine, along with a corresponding call to the GENTMZ monitoring model.\n\nmachine_array_channel\n\n add an output channel containing a plant related model variable of a designated type for a specified machine.\n\nmachine_iterm_channel\n\n add an output channel containing the terminal current of a specified machine, along with a corresponding call to the GENTMC monitoring model.\n\n--- Assign Other Quantities To Output Channels — .txt ---\n\nAssign Other Quantities To Output Channels — \n\nAssign Other Quantities To Output Channels¶\n\n\n\n\n\nbus_frequency_channel\n\n add an output channel containing the per unit frequency deviation at a specified bus.\n\nstate_channel\n\n add an output channel containing the value of a specified STATE.\n\nvar_channel\n\n add an output channel containing the value of a specified VAR.\n\nvoltage_and_angle_channel\n\n add a pair of output channels containing the voltage magnitude in per unit and phase angle in degrees of a specified bus, along with a corresponding call"
  },
  {
    "id": "chunk_1_part_1",
    "text": " to the VOLMAG monitoring model.\n\nvoltage_channel\n\n add an output channel containing the voltage magnitude in per unit of a specified bus, along with a corresponding call to the VOLMAG monitoring model.\n\n--- Auxiliary Signal Models — .txt ---\n\nAuxiliary Signal Models — \n\nAuxiliary Signal Models¶\n\n\n\n\n\nadd_fctsauxsignal_model\n\n add a FACTS device auxiliary signal model at the specified injection point of the designated FACTS device.\n\nadd_mtdcauxsignal_model\n\n add a multi-terminal dc line auxiliary signal model at the specified auxiliary signal index of the designated multi-terminal dc line.\n\nadd_ttdcauxsignal_model\n\n add a two-terminal dc line auxiliary signal model at the specified injection point of the designated two-terminal dc line.\n\nadd_vsdcauxsignal_model\n\n add a VSC dc line auxiliary signal model at the specified injection point of the designated VSC dc line.\n\nauxmod_pack\n\n remove entries that are marked as unused from the auxiliary signal model connection tables and the auxiliar"
  },
  {
    "id": "chunk_1_part_2",
    "text": "y signal array allocation tables.\n\nauxmod_unconnected\n\n list or remove from dynamics working memory those auxiliary signal models that are assigned to dc lines or FACTS devices that are not present in the current power flow working case (unconnected).\n\nauxmod_user\n\n list user-written auxiliary signal model definitions or to remove user-written auxiliary signal model definitions that are not assigned to any dc lines or FACTS devices (unused) from the user model definition tables.\n\nchange_fctsauxmod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of an auxiliary signal model of a specified FACTS device.\n\nchange_fctsauxmod_con\n\n change the value of a CON of an auxiliary signal model of a specified FACTS device.\n\nchange_fctsauxmod_data\n\n\n\nchange_fctsauxmod_icon\n\n change the value of an integer ICON of an auxiliary signal model of a specified FACTS device.\n\nchange_fctsauxmod_var\n\n change the value of a VAR of an auxiliary signal model of a specified FACT"
  },
  {
    "id": "chunk_2_part_0",
    "text": "S device.\n\nchange_mtdcauxmod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of an auxiliary signal model of a specified multi-terminal dc line.\n\nchange_mtdcauxmod_con\n\n change the value of a CON of an auxiliary signal model of a specified multi- terminal dc line.\n\nchange_mtdcauxmod_data\n\n\n\nchange_mtdcauxmod_icon\n\n change the value of an integer ICON of an auxiliary signal model of a specified multi-terminal dc line.\n\nchange_mtdcauxmod_var\n\n change the value of a VAR of an auxiliary signal model of a specified multi- terminal dc line.\n\nchange_ttdcauxmod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of an auxiliary signal model of a specified two-terminal dc line.\n\nchange_ttdcauxmod_con\n\n change the value of a CON of an auxiliary signal model of a specified two- terminal dc line.\n\nchange_ttdcauxmod_data\n\n\n\nchange_ttdcauxmod_icon\n\n change the value of an integer ICON of an auxiliary signal model of a specified tw"
  },
  {
    "id": "chunk_2_part_1",
    "text": "o-terminal dc line.\n\nchange_ttdcauxmod_var\n\n change the value of a VAR of an auxiliary signal model of a specified two- terminal dc line.\n\nchange_vsdcauxmod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of an auxiliary signal model of a specified VSC dc line.\n\nchange_vsdcauxmod_con\n\n change the value of a CON of an auxiliary signal model of a specified VSC dc line.\n\nchange_vsdcauxmod_data\n\n\n\nchange_vsdcauxmod_icon\n\n change the value of an integer ICON of an auxiliary signal model of a specified VSC dc line.\n\nchange_vsdcauxmod_var\n\n change the value of a VAR of an auxiliary signal model of a specified VSC dc line.\n\nfctsauxmod_remove\n\n remove an auxiliary signal model from the specified injection point of a designated FACTS device.\n\nfctsauxmod_status\n\n change the status of the auxiliary signal model at the specified injection point of a designated FACTS device.\n\nmtdcauxmod_remove\n\n remove an auxiliary signal model from the specified auxiliary signal"
  },
  {
    "id": "chunk_2_part_2",
    "text": " index of the designated multi-terminal dc line.\n\nmtdcauxmod_status\n\n change the status of the auxiliary signal model at the specified auxiliary signal index of the designated multi-terminal dc line.\n\nttdcauxmod_remove\n\n remove an auxiliary signal model from the specified injection point of the designated two-terminal dc line.\n\nttdcauxmod_status\n\n change the status of the auxiliary signal model at the specified injection point of the designated two-terminal dc line.\n\nvsdcauxmod_remove\n\n remove an auxiliary signal model from the specified injection point of the designated VSC dc line.\n\nvsdcauxmod_status\n\n change the status of the auxiliary signal model at the specified injection point of the designated VSC dc line.\n\n--- Branch Data — .txt ---\n\nBranch Data — \n\nBranch Data¶\n\n\n\n\n\nabrnchar\n\n return an array of character values for subsystem branches.\n\nabrncount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the branch data fa"
  },
  {
    "id": "chunk_3_part_0",
    "text": "mily.\n\nabrncplx\n\n return an array of complex values for subsystem branches.\n\nabrnint\n\n return an array of integer values for subsystem branches.\n\nabrnreal\n\n return an array of real values for subsystem branches.\n\nabrntypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the branch data family (aBrnInt, aBrnReal, aBrnCplx and aBrnChar).\n\n--- Branch Flow Data — .txt ---\n\nBranch Flow Data — \n\nBranch Flow Data¶\n\n\n\n\n\naflowchar\n\n return an array of character values for subsystem branches.\n\naflowcount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the branch flow data family.\n\naflowcplx\n\n return an array of complex values for subsystem branches.\n\naflowint\n\n return an array of integer values for subsystem branches.\n\naflowreal\n\n return an array of real values for subsystem branches.\n\naflowtypes\n\n "
  },
  {
    "id": "chunk_3_part_1",
    "text": "return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the branch flow data family (aFlowInt, aFlowReal, aFlowCplx and aFlowChar).\n\n--- Bus Data — .txt ---\n\nBus Data — \n\nBus Data¶\n\n\n\n\n\nabuschar\n\n return an array of character values for subsystem buses.\n\nabuscount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the bus data family.\n\nabuscplx\n\n return an array of complex values for subsystem buses.\n\nabusint\n\n return an array of integer values for subsystem buses.\n\nabusreal\n\n return an array of real values for subsystem buses.\n\nabustypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the bus data family (aBusInt, aBusReal, aBusCplx and aBusChar).\n\n--- Bus Subsystems —"
  },
  {
    "id": "chunk_3_part_2",
    "text": " .txt ---\n\nBus Subsystems — \n\nBus Subsystems¶\n\n\n\n\n\nbsys\n\n define a bus subsystem.\n\nbsysadd\n\n add elements to an existing bus subsystem.\n\nbsysdef\n\n set the definition of a bus subsystem.\n\nbsysdelo\n\n delete a single bus from a bus subsystem.\n\nbsysinit\n\n initialize or re-initialize a bus subsystem.\n\nbsysmem\n\n replicate the specified bus subsystem in a bus subsystem file.\n\nbsyso\n\n build a bus subsystem one bus at a time.\n\nbsysrcl\n\n recall a specified bus subsystem saved in a bus subsystem file.\n\n--- Cct Models — .txt ---\n\nCct Models — \n\nCct Models¶\n\n\n\n\n\nadd_cct2dco_model\n\n add an “other” type model attached to a 2-terminal dc line.\n\nadd_cct2wtd_model\n\n add a 2-winding transformer device model to the specified 2-winding transformer.\n\nadd_cct3wtd_model\n\n add a 3-winding transformer device model to the specified 3-winding transformer.\n\nadd_cctbrnd_model\n\n add a branch device model to the specified branch.\n\nadd_cctbrno_model\n\n add a branch “other” model to the specified branch.\n\nadd_cctbuso_mo"
  },
  {
    "id": "chunk_4_part_0",
    "text": "del\n\n add an “other” type model attached to a bus.\n\nadd_cctmcno_model\n\n add a machine other model to the specified machine.\n\nadd_cctmcnp_model\n\n add a machine protection model to the specified machine.\n\nadd_cctmsco_model\n\n add a miscellaneous “other” type model with the specified model instance.\n\nadd_cctswso_model\n\n\n\nadd_cctswso_model_2\n\n add a switched shunt “other” model to the specified bus.\n\ncct2dco_list\n\n list “other” type models attached to 2-terminal dc lines.\n\ncct2dcomod_remove\n\n remove an “other” type model attached to a 2-terminal dc line.\n\ncct2dcomod_status\n\n change status of an “other” type model attached to a 2-terminal dc line.\n\ncct2wtd_list\n\n list “other” type models attached to 2-winding transformers.\n\ncct2wtdmod_remove\n\n remove a 2-winding transformer device model attached to the specified 2-winding transformer.\n\ncct2wtdmod_status\n\n change the status of a 2-winding transformer device model attached to the specified 2-winding transformer.\n\ncct3wtd_list\n\n list “other” ty"
  },
  {
    "id": "chunk_4_part_1",
    "text": "pe models attached to 3-winding transformers.\n\ncct3wtdmod_remove\n\n remove a 3-winding transformer device model attached to the specified 3-winding transformer.\n\ncct3wtdmod_status\n\n change the status of a 3-winding transformer device model attached to the specified 3-winding transformer.\n\ncctbrnd_list\n\n list device type models attached to branches.\n\ncctbrndmod_remove\n\n remove a branch device model attached to the specified branch.\n\ncctbrndmod_status\n\n change the status of a branch device model attached to the specified branch.\n\ncctbrno_list\n\n list “other” type models attached to branches.\n\ncctbrnomod_remove\n\n remove a branch “other” model attached to the specified branch.\n\ncctbrnomod_status\n\n change the status of a branch “other” model attached to the specified branch.\n\ncctbuso_list\n\n list “other” type models attached to buses.\n\ncctbusomod_remove\n\n remove an “other” type model attached to a bus.\n\ncctbusomod_status\n\n change status of an “other” type model attached to a bus.\n\ncctmcno_list"
  },
  {
    "id": "chunk_4_part_2",
    "text": "\n\n list “other” type models attached to machines.\n\ncctmcnomod_remove\n\n remove a machine “other” model attached to the specified machine.\n\ncctmcnomod_status\n\n change status of a machine “other” model attached to the specified machine.\n\ncctmcnp_list\n\n list protection models attached to machines.\n\ncctmcnpmod_remove\n\n remove a machine protection model attached to the specified machine.\n\ncctmcnpmod_status\n\n change status of a machine protection model attached to the specified machine.\n\ncctmod_pack\n\n pack CCT model definition tables.\n\ncctmod_user\n\n list or remove user-written CCT model definitions.\n\ncctmsco_list\n\n list miscellaneous “other” type models.\n\ncctmscomod_remove\n\n remove a miscellaneous “other” type model with the specified model instance.\n\ncctmscomod_status\n\n change status of a miscellaneous “other” type model with the specified model instance.\n\ncctswso_list\n\n list “other” type models attached to switched shunts.\n\ncctswsomod_remove\n\n\n\ncctswsomod_remove_2\n\n remove an “other” type m"
  },
  {
    "id": "chunk_5_part_0",
    "text": "odel attached to a switched shunt.\n\ncctswsomod_status\n\n\n\ncctswsomod_status_2\n\n change status of an “other” type model attached to a switched shunt.\n\nchange_cct2dcomod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of the “other” type model attached to a specified 2-terminal dc line.\n\nchange_cct2dcomod_con\n\n change the value of a real constant (CON) of the “other” type model attached to a specified 2-terminal dc line.\n\nchange_cct2dcomod_icon\n\n change the value of an integer ICON of the “other” type model attached to a specified 2-terminal dc line.\n\nchange_cct2dcomod_var\n\n change the value of VAR of the “other” type model attached to a specified 2-terminal dc line.\n\nchange_cct2wtdmod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of the 2-winding transformer device model of a specified branch.\n\nchange_cct2wtdmod_con\n\n change the value of a real constant (CON) of the 2-winding transformer device model of a specifi"
  },
  {
    "id": "chunk_5_part_1",
    "text": "ed branch.\n\nchange_cct2wtdmod_icon\n\n change the value of an integer ICON of the 2-winding transformer device model of a specified branch.\n\nchange_cct2wtdmod_var\n\n change the value of VAR of the 2-winding transformer device model of a specified branch.\n\nchange_cct3wtdmod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of the 3-winding transformer device model of a specified branch.\n\nchange_cct3wtdmod_con\n\n change the value of a real constant (CON) of the 3-winding transformer device model of a specified branch.\n\nchange_cct3wtdmod_icon\n\n change the value of an integer ICON of the 3-winding transformer device model of a specified branch.\n\nchange_cct3wtdmod_var\n\n change the value of VAR of the 3-winding transformer device model of a specified branch.\n\nchange_cctbrndmod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of the branch device model of a specified branch.\n\nchange_cctbrndmod_con\n\n change the value of a real "
  },
  {
    "id": "chunk_5_part_2",
    "text": "constant (CON) of the branch device model of a specified branch.\n\nchange_cctbrndmod_icon\n\n change the value of an integer ICON of the branch device model of a specified branch.\n\nchange_cctbrndmod_var\n\n change the value of VAR of the branch device model of a specified branch.\n\nchange_cctbrnomod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of the branch “other” model of a specified branch.\n\nchange_cctbrnomod_con\n\n change the value of a real constant (CON) of the branch “other” model of a specified branch.\n\nchange_cctbrnomod_icon\n\n change the value of an integer ICON of the branch “other” model of a specified branch.\n\nchange_cctbrnomod_var\n\n change the value of VAR of the branch “other” model of a specified branch.\n\nchange_cctbusomod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of the “other” type model attached to a specified bus.\n\nchange_cctbusomod_con\n\n change the value of a real constant (CON) of the “othe"
  },
  {
    "id": "chunk_6_part_0",
    "text": "r” type model attached to a specified bus.\n\nchange_cctbusomod_icon\n\n change the value of an integer ICON of the “other” type model attached to a specified bus.\n\nchange_cctbusomod_var\n\n change the value of VAR of the “other” type model attached to a specified bus.\n\nchange_cctmcnomod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of the machine “other” model for a specified machine.\n\nchange_cctmcnomod_con\n\n change the value of a real constant (CON) of the machine “other” model for a specified machine.\n\nchange_cctmcnomod_icon\n\n change the value of an integer ICON of the machine “other” model for a specified machine.\n\nchange_cctmcnomod_var\n\n change the value of VAR of the machine “other” model for a specified machine.\n\nchange_cctmcnpmod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of the machine protection model of a specified machine.\n\nchange_cctmcnpmod_con\n\n change the value of a real constant (CON) of the mach"
  },
  {
    "id": "chunk_6_part_1",
    "text": "ine protection model of a specified machine.\n\nchange_cctmcnpmod_icon\n\n change the value of an integer ICON of the machine protection model of a specified machine.\n\nchange_cctmcnpmod_var\n\n change the value of VAR of the machine protection model of a specified machine.\n\nchange_cctmscomod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of the miscellaneous “other” type model with the specified model instance.\n\nchange_cctmscomod_con\n\n change the value of a real constant (CON) of the miscellaneous “other” type model with the specified model instance.\n\nchange_cctmscomod_icon\n\n change the value of an integer ICON of the miscellaneous “other” type model with the specified model instance.\n\nchange_cctmscomod_var\n\n change the value of VAR of the miscellaneous “other” type model with the specified model instance.\n\nchange_cctswsomod_chricn\n\n\n\nchange_cctswsomod_chricn_2\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of the “other” t"
  },
  {
    "id": "chunk_6_part_2",
    "text": "ype model attached to a specified switched shunt.\n\nchange_cctswsomod_con\n\n\n\nchange_cctswsomod_con_2\n\n change the value of a real constant (CON) of the “other” type model attached to a specified switched shunt.\n\nchange_cctswsomod_icon\n\n\n\nchange_cctswsomod_icon_2\n\n change the value of an integer ICON of the “other” type model attached to a specified switched shunt.\n\nchange_cctswsomod_var\n\n\n\nchange_cctswsomod_var_2\n\n change the value of VAR of the “other” type model attached to a specified switched shunt.\n\n--- Character Data — .txt ---\n\nCharacter Data — \n\nCharacter Data¶\n\n\n\n\n\nget_char_length\n\n return the number of characters required to accommodate the data corresponding to the specified STRING entries, which can be for any of the a*Char data retrieval functions.\n\n--- Dc Line Related Models — .txt ---\n\nDc Line Related Models — \n\nDc Line Related Models¶\n\n\n\n\n\nadd_mtdcline_model\n\n add a multi-terminal dc line model to the specified multi-terminal dc line.\n\nadd_ttdcline_model\n\n add a two-term"
  },
  {
    "id": "chunk_7_part_0",
    "text": "inal dc line model to the specified two-terminal dc line.\n\nadd_vsdcline_model\n\n add a VSC dc line model to the specified VSC dc line.\n\nchange_mtdclmod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of the multi-terminal dc line model of a specified multi-terminal dc line.\n\nchange_mtdclmod_con\n\n change the value of a CON of the multi-terminal dc line model of a specified multi-terminal dc line.\n\nchange_mtdclmod_data\n\n\n\nchange_mtdclmod_icon\n\n change the value of an integer ICON of the multi-terminal dc line model of a specified multi-terminal dc line.\n\nchange_mtdclmod_var\n\n change the value of a VAR of the multi-terminal dc line model of a specified multi-terminal dc line.\n\nchange_ttdclmod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of the two-terminal dc line model of a specified two-terminal dc line.\n\nchange_ttdclmod_con\n\n change the value of a CON of the two-terminal dc line model of a specified two- termin"
  },
  {
    "id": "chunk_7_part_1",
    "text": "al dc line.\n\nchange_ttdclmod_data\n\n\n\nchange_ttdclmod_icon\n\n change the value of an integer ICON of the two-terminal dc line model of a specified two-terminal dc line.\n\nchange_ttdclmod_var\n\n change the value of a VAR of the two-terminal dc line model of a specified two- terminal dc line.\n\nchange_vsdclmod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of the VSC dc line model of a specified VSC dc line.\n\nchange_vsdclmod_con\n\n change the value of a CON of the VSC dc line model of a specified VSC dc line.\n\nchange_vsdclmod_data\n\n\n\nchange_vsdclmod_icon\n\n change the value of an integer ICON of the VSC dc line model of a specified VSC dc line.\n\nchange_vsdclmod_var\n\n change the value of a VAR of the VSC dc line model of a specified VSC dc line.\n\ndclmod_pack\n\n remove entries that are marked as unused from the dc line model connection tables and the dc line array allocation tables.\n\ndclmod_unconnected\n\n list or remove from dynamics working memory those dc lin"
  },
  {
    "id": "chunk_7_part_2",
    "text": "e models that are assigned to dc lines that are not present in the current power flow working case (unconnected).\n\ndclmod_user\n\n list user-written dc line model definitions or to remove user-written dc line model definitions that are not assigned to any dc lines (unused) from the user model definition tables.\n\nmtdclmod_remove\n\n remove the multi-terminal dc line model from a specified multi-terminal dc line.\n\nmtdclmod_status\n\n change the status of the multi-terminal dc line model at a specified multi- terminal dc line.\n\nttdclmod_remove\n\n remove the two-terminal dc line model from a specified two-terminal dc line.\n\nttdclmod_status\n\n change the status of the two-terminal dc line model at a specified two-terminal end line.\n\nvsdclmod_remove\n\n remove the VSC dc line model from a specified VSC dc line.\n\nvsdclmod_status\n\n change the status of the VSC dc line model at a specified VSC dc line.\n\n--- Diagram View — .txt ---\n\nDiagram View — \n\nDiagram View¶\n\n\n\n\n\nchangediagcontour\n\n change the contou"
  },
  {
    "id": "chunk_8_part_0",
    "text": "r parameters for the contour in the active Slider diagram in the GUI.\n\ncheckdiagfile\n\n check the active Slider Diagram in the GUI against the current network case.\n\nclosediagfile\n\n close the active Slider Diagram in the GUI without prompting to save the Diagram.\n\ndeletediagcontour\n\n delete the contour from the active Slider Diagram in the GUI.\n\nenablediagcontour\n\n specify the contour parameters and display a contour in the active Slider Diagram in the GUI.\n\nexportbuslocfile\n\n\n\nexportbuslocfile_2\n\n export the bus location from the active Slider Diagram in the GUI to a file.\n\nexportimagefile\n\n\n\nexportimagefile_2\n\n export an image of the active Slider Diagram in the GUI to a file.\n\ngexmbus\n\n create a GEXM/GOUT display of a bus in an active Slider diagram in the GUI.\n\ngrowbus\n\n GROW a bus in an active Slider diagram in the GUI.\n\ngrowbuslevels\n\n GROW a bus and all the connected buses up to the specified number of levels away in an active Slider diagram in the GUI.\n\ngrowdiagram\n\n\n\ngrowdiagra"
  },
  {
    "id": "chunk_8_part_1",
    "text": "m_2\n\n GROW a bus and all the connected buses in an active Slider diagram in the GUI.\n\ngrowstation\n\nThis API routine was first introduced in release 34.\n\ngrpg\n\n produce a GRPG report in the active Slider diagram in the GUI.\n\nimportdrawfile\n\n import a Draw Data File into an active Slider diagram in the GUI.\n\nimportimagefile\n\n import an image into the background layer of the active Slider diagram in the GUI.\n\nnewdiagfile\n\n open a new Slider diagram in the GUI.\n\nnextdiagfiledataset\n\nThis API is used to display the next element in the active data set on the active Slider diagram.\n\nopenaccfile\n\n\n\nopenaccfile_2\n\nThis API is used to open an existing ACC results file for displaying results on diagram.\n\nopenbuslocfile\n\n open an existing bus location file in the GUI.\n\nopendiagfile\n\n open an existing Slider diagram in the GUI.\n\nprevdiagfiledataset\n\nThis API is used to display the previous element in the active data set on the active Slider diagram.\n\nprintdiagfile\n\n\n\nprintdiagfile_2\n\n print the act"
  },
  {
    "id": "chunk_8_part_2",
    "text": "ive Slider diagram in the GUI.\n\nrefreshdiagcontour\n\n refresh the contour in the active Slider diagram in the GUI.\n\nrefreshdiagfile\n\n refresh the results and styles in the active Slider diagram in the GUI.\n\nrenumdiagfile\n\n renumber buses in the active Slider diagram in the GUI.\n\nsavediagfile\n\n save the active Slider diagram in the GUI.\n\nsetdiagautofile\n\n specify an automation file that is run each time results are updated on the active Slider diagram.\n\nsetdiagfont\n\n specify the default text font in the active Slider diagram.\n\nsetdiagprec\n\n\n\nsetdiagprec_2\n\n specify the precision of results displayed in Slider Diagrams.\n\nsetdiagprop\n\n\n\nsetdiagprop_2\n\n\n\nsetdiagprop_3\n\n\n\nsetdiagprop_4\n\n\n\nsetdiagprop_5\n\n specify basic properties in the active Slider diagram.\n\nsetdiagresaccc\n\n\n\nsetdiagresaccc_2\n\n\n\nsetdiagresaccc_3\n\n set the ACCC analysis annotation options in the active Slider diagram.\n\nsetdiagresascc\n\n\n\nsetdiagresascc_2\n\n\n\nsetdiagresascc_3\n\nThis API is used to set the ASCC short circuit anal"
  },
  {
    "id": "chunk_9_part_0",
    "text": "ysis annotation options in the active Slider diagram.\n\nsetdiagresdata\n\n\n\nsetdiagresdata_2\n\n\n\nsetdiagresdata_3\n\n specify the basic Power Flow annotation options in the active Slider Diagram.\n\nsetdiagresdyn\n\n\n\nsetdiagresdyn_2\n\nThis API is used to set the dynamic simulation annotation options in the active Slider diagram.\n\nsetdiagresgdif\n\n specify the case comparison voltage and range checking annotation options in the active Slider diagram.\n\nsetdiagresiec\n\n\n\nsetdiagresiec_2\n\n\n\nsetdiagresiec_3\n\n specify the IEC annotation options in the active Slider diagram.\n\nsetdiagresmust\n\nThis API is used to set the MUST simulation annotation options in the active Slider diagram.\n\nsetdiagresopf\n\n\n\nsetdiagresopf_2\n\n\n\nsetdiagresopf_3\n\n specify the OPF annotation options in the active Slider diagram.\n\nsetdiagrespflowcheck\n\n\n\nsetdiagrespflowcheck_2\n\n\n\nsetdiagrespflowcheck_3\n\n specify the Power Flow voltage and range checking annotation options in the active Slider Diagram.\n\nsetdiagrespflowoptions\n\n\n\nsetdi"
  },
  {
    "id": "chunk_9_part_1",
    "text": "agrespflowoptions_2\n\n\n\nsetdiagrespflowoptions_3\n\n specify the basic Power Flow annotation options in the active Slider diagram.\n\nsetdiagresrel\n\n\n\nsetdiagresrel_2\n\n\n\nsetdiagresrel_3\n\n specify the reliability annotation options in the active Slider diagram.\n\nsetdiagresscgr\n\n specify the short circuit analysis voltage and range checking annotation options in the active Slider diagram.\n\nsetdiagrestypeacc\n\n set the type of results displayed in the active Slider diagram to ACCC results.\n\nsetdiagrestypeascc\n\n set the type of results displayed in the active Slider diagram to ASCC fault calculation results.\n\nsetdiagrestypedata\n\n set the type of results displayed in the active Slider diagram to impedance data values.\n\nsetdiagrestypedyn\n\n set the type of results displayed in the active Slider diagram to Dynamics data results.\n\nsetdiagrestypegdif\n\n set the type of results displayed in the active Slider diagram to the differences in values between the current network case and a supplied comparison "
  },
  {
    "id": "chunk_9_part_2",
    "text": "case.\n\nsetdiagrestypegic\n\n set the type of results displayed in the active Slider diagram to GIC solution results.\n\nsetdiagrestypeharm\n\n set the type of results displayed in the active Slider diagram to Harmonics solution results.\n\nsetdiagrestypeiec\n\n set the type of results displayed in the active Slider diagram to IEC Fault calculation results.\n\nsetdiagrestypemust\n\n set the type of results displayed in the active Slider diagram to MUST solution results.\n\nsetdiagrestypeopf\n\n set the type of results displayed in the active Slider diagram to OPF solution results.\n\nsetdiagrestypepflow\n\n set the type of results displayed in the active Slider diagram to Power Flow results.\n\nsetdiagrestyperel\n\n set the type of results displayed in the active Slider diagram to reliability analysis results.\n\nsetdiagrestypescgr\n\n set the type of results displayed in the active Slider diagram to the results of a short circuit analysis.\n\nsetdiagrestypetspf\n\n set the type of results displayed in the active Slider"
  },
  {
    "id": "chunk_10_part_0",
    "text": "diagram to TSPF solution results.\n\nsetdiagresvrcs\n\n\n\nsetdiagresvrcs_2\n\n specify the system diagram defaults for Voltage coloring and style, Out of Service coloring and style etc.\n\nsetdiagtitle\n\n set the title of the active Slider diagram.\n\nswitchdiagfiledataset\n\nThis API is used to rotate through values for the current element in the active data set on the active Slider diagram.\n\nupdatebuslocdiagfile\n\n update bus locations in the active Slider diagram in the GUI using the positions found in the current bus location file.\n\n--- Dynamic Simulation Operation — .txt ---\n\nDynamic Simulation Operation — \n\nDynamic Simulation Operation¶\n\n\n\n\n\naddmodellibrary\n\n add a library to the list to be searched for library models.\n\nastr\n\n calculate and replicates the state variable system matrices in the form required by the Linear Dynamic Analysis Program, LSYSAN (activity ASTR).\n\naulist\n\n list auxiliary signal models that inject signals into dc lines or FACTS devices connected to subsystem buses, along w"
  },
  {
    "id": "chunk_10_part_1",
    "text": "ith their storage locations in the dynamics data arrays.\n\nchange_channel_out_file\n\n modify the dynamic simulation channel output filename in dynamics working memory (see PSSE Program Operation Manual, activity ALTR).\n\nchange_chricn\n\n change the value of an element of the CHRICN array (a character ICON).\n\nchange_con\n\n change the value of an element of the CON array.\n\nchange_gref\n\n change the value of the element of the GREF (governor reference) array associated with a specified machine.\n\nchange_icon\n\n change the value of an element of the ICON array (an integer ICON).\n\nchange_state\n\n change the value of an element of the STATE array, as well as the values of the corresponding time derivative (DSTATE) and the associated memory cell used in the integration algorithm (STORE).\n\nchange_swsref\n\n\n\nchange_swsref_2\n\n change the value of the element of the SWREF array associated with a specified switched shunt.\n\nchange_var\n\n change the value of an element of the VAR array.\n\nchange_vref\n\n change t"
  },
  {
    "id": "chunk_10_part_2",
    "text": "he value of the element of the VREF array associated with a specified machine.\n\ncrctrun\n\n run critical clearing time calculation in dynamic simulations.\n\ndclist\n\n list dc line models connected to subsystem buses along with their storage locations in the dynamics data arrays.\n\ndlst\n\n tabulate specified portions of one or more of the PSSE dynamics data storage arrays.\n\ndocu\n\n tabulate the data associated with equipment models referenced in the user’s simulation setup.\n\ndropmodellibrary\n\n remove a library from the list being searched for library models.\n\ndropmodelprogram\n\n remove a model from the list of known library models; library models are added to this list the first time that they are called.\n\ndyda\n\n replicate dynamics model data in the form of a Dynamics Data Input file.\n\ndynamics_solution_param_2\n\n modify the dynamic simulation solution parameters (except the channel output filename) in dynamics working memory (see PSSE Program Operation Manual, activity ALTR).\n\ndynamics_solutio"
  },
  {
    "id": "chunk_11_part_0",
    "text": "n_params\n\n\n\ndynamicsmode\n\n return PSSE to dynamics mode following the use of the POWERFLOWMODE API while in dynamics mode.\n\ndynexportcsv\n\n export dynamics engine and dynamics model messages that are displayed after running a dynamics simulation to CSV file format.\n\ndyre_add\n\n read a Dynamics Model Raw Data File and append the model references specified in its data records to the simulation data already contained in dynamics working memory (activity DYRE,ADD).\n\ndyre_new\n\n clear dynamics working memory, read a Dynamics Data File, and place the model references specified on its data records into dynamics working memory.\n\nerun\n\n calculate PSSE state-space dynamic simulations of excitation system response tests.\n\nestr_open_circuit_test\n\n initialize a PSSE dynamic simulation for excitation system open circuit response simulations (i.e., in preparation for activity ERUN) and to specify the Channel Output File into which the output channel values are to be recorded during the simulation.\n\nestr"
  },
  {
    "id": "chunk_11_part_1",
    "text": "_response_ratio_test\n\n initialize a PSSE dynamic simulation for excitation system response ratio test simulations (i.e., in preparation for activity ERUN) and to specify the Channel Output File into which the output channel values are to be recorded during the simulation.\n\nfclist\n\n list FACTS device models connected to subsystem buses along with their storage locations in the dynamics data arrays.\n\ngrun\n\n calculate PSSE state-space dynamic simulations of turbine-governor response tests.\n\ngstr\n\n initialize a PSSE dynamic simulation for governor response simulations and to specify the Channel Output File into which the output channel values are to be recorded during the simulation.\n\nincrement_gref\n\n add a specified value to the value of the element of the GREF (governor reference) array associated with a specified machine.\n\nincrement_swsref\n\n\n\nincrement_swsref_2\n\n add a specified value to the value of the element of the SWREF (switched shunt reference) array associated with a specified s"
  },
  {
    "id": "chunk_11_part_2",
    "text": "witched shunt.\n\nincrement_vref\n\n add a specified value to the value of the element of the VREF (voltage reference) array associated with a specified machine.\n\nldclist\n\n list load models connected to subsystem loads along with their storage locations in the dynamics data arrays.\n\nldlist\n\n list load models connected to subsystem loads along with their storage locations in the dynamics data arrays.\n\nload_array_channel\n\n add an output channel containing the active or reactive component of a designated load.\n\nmlst\n\n list plant models connected to subsystem machines along with their storage locations in the dynamics data arrays.\n\nmrun\n\n calculate PSSE extended term dynamic simulations.\n\nmstr\n\n initialize a PSSE dynamic simulation for extended term simulations and to specify the Channel Output File into which the output channel values are to be recorded during the dynamic simulation.\n\npowerflowmode\n\n switch PSSE from dynamics mode to power flow mode.\n\npsas\n\n convert a PSAS Command File into a"
  },
  {
    "id": "chunk_12_part_0",
    "text": "PSSE Response File.\n\nrllist\n\n list line relay models connected to subsystem buses along with their storage locations in the dynamics data arrays.\n\nrstr\n\n read a dynamics Snapshot File into PSSE working memory.\n\nrun\n\n calculate PSSE state-space dynamic simulations.\n\nrwdy\n\n replicate portions of dynamics model data in the form of either a breaker duty data file, unit inertia and governor data file, or PSSPLT relay characteristic data file.\n\nset_chnfil_type\n\n set/Get the channel output file type (extended type or not).\n\nset_disable_run\n\n enable or disable the simulation option setting that precludes dynamic simulation runs in the event there are fatal errors in the model data.\n\nset_freq_relay_v_thresh\n\nThis API is used to set voltage threshold for use in frequency relay models.\n\nset_genang\n\n\n\nset_genang_2\n\n\n\nset_genang_3\n\n enable or disable the simulation option setting that scans for generators for which the angle differs from the angular average by more than a specified threshold.\n\nset_"
  },
  {
    "id": "chunk_12_part_1",
    "text": "genang_subsys_flag\n\nUse this API api for get/set the flag that is used for the subsystem defintion for performing scan for generators exceeding angle threshold.\n\nset_genpwr\n\n enable or disable the simulation option setting that scans for generators for which the mechanical power differs from its electrical power by more than a specified threshold.\n\nset_genspdev\n\n enable or disable the simulation option setting that scans for generators for which the speed deviation is more than a specified threshold.\n\nset_genspdev_subsys_flag\n\nUse this API api for get/set the flag that is used for the subsystem defintion for performing scans for generators for which the speed deviation is more than a specified threshold.\n\nset_load_model_thresh\n\nThis API is used to set the MW, P over Q, and load bus voltage thresholds for load models.\n\nset_model_debug_output_flag\n\n enable or disable the simulation option setting for dynamic model debug output.\n\nset_netfrq\n\n enable or disable the simulation option settin"
  },
  {
    "id": "chunk_12_part_2",
    "text": "g that models the frequency dependence of network parameters.\n\nset_next_channel\n\n assign the next available channel index value.\n\nset_next_icon\n\n assign the next available ICON index value.\n\nset_next_var\n\n assign the next available VAR index value.\n\nset_osscan\n\n enable or disable the simulation option setting that scans for out-of-step conditions using a generic relay.\n\nset_osscan_2\n\n\n\nset_osscan_subsys_flag\n\nUse this API api for get/set the flag that is used for the subsystem defintion for performing scans for out-of-step conditions using a generic relay.\n\nset_relang\n\n enable or disable the simulation option setting that expresses the ANGLE array relative to a designated reference angle.\n\nset_relscn\n\n enable or disable the simulation option setting that scans branches using a generic branch relay.\n\nset_relscn_subsys_flag\n\nUse this API api for get/set the flag that is used for the subsystem defintion for performing scans of branches using a generic branch relay.\n\nset_vltscn\n\n enable o"
  },
  {
    "id": "chunk_13_part_0",
    "text": "r disable the simulation option setting that scans buses for high or low values of voltage magnitude.\n\nset_vltscn_subsys_flag\n\nUse this API api for get/set the flag that is used for the subsystem definition for performing scans of buses for high or low voltage magnitudes.\n\nset_volt_viol_subsys_flag\n\nThis API is used to set the flag to denote the bus subsystem to be used for voltage violation (voltage recovery and voltage dip) checks.\n\nset_voltage_dip_check\n\nThis API is used to enable or disable the simulation option setting which scans buses for voltage dip (back-swing).\n\nset_voltage_rec_check\n\nThis API is used to enable or disable the simulation option setting which scans buses for voltage recovery (primary and secondary recovery).\n\nset_zsorce_reconcile_flag\n\n enable or disable the simulation option setting for automatic ZSORCE reconciliation.\n\nsize_ds\n\n obtain a summary of utilization in the general purpose dynamics data storage arrays as well as in the various model connection and a"
  },
  {
    "id": "chunk_13_part_1",
    "text": "llocation tables contained in dynamics working memory.\n\nsnap\n\n save PSSE dynamics working memory into a Snapshot file.\n\nstrt\n\n\n\nstrt_2\n\nThis API routine is the second release of the dynamic simulation initialization function.\n\nswslist\n\n list switched shunt models connected to subsystem buses along with their storage locations in the dynamics data arrays.\n\ntrig_volt_violation_check\n\nThis API is used to trigger voltage violation (voltage recovery, voltage dip) checks.\n\nwnlist\n\n list wind models connected to subsystem buses along with their storage locations in the dynamics data arrays.\n\n--- Dynamic Simulation Output Channel Operation — .txt ---\n\nDynamic Simulation Output Channel Operation — \n\nDynamic Simulation Output Channel Operation¶\n\n\n\n\n\nchange_channel\n\n change the channel address and the channel identifier of a specified output channel.\n\nchsb\n\n specify, on a subsystem basis, the simulation variables to monitor during dynamic simulation runs (activity CHSB).\n\ncrt_plot_channel\n\n  assi"
  },
  {
    "id": "chunk_13_part_2",
    "text": "gn one of the main simulation output channels to a designated CRT plot channel.\n\ndelete_all_plot_channels\n\n delete all the plot channels in the working case.\n\ndmpc\n\n replicate the output channel specifications from dynamics working memory in the form of a response file suitable for transferring them to another snapshot that models essentially the same system.\n\nlist_channel_models\n\n tabulate the output channel monitoring models referenced in the dynamic model.\n\nremove_unused_chan_models\n\n delete from the output channel monitoring model table those model references indicating equipment that is not present in the power flow working case.\n\n--- Event Studies — .txt ---\n\nEvent Studies — \n\nEvent Studies¶\n\n\n\n\n\ncloseeventstudyfile\n\n close an open Event Study file.\n\nopeneventstudyfile\n\n open a new or existing event study file in the GUI.\n\nrundynamiceventstudy\n\n run a dynamic study using the active event study in the open event study file.\n\nrunpowerfloweventstudy\n\n run a power flow study using th"
  },
  {
    "id": "chunk_14_part_0",
    "text": "e active event study in the open event study file.\n\nsaveeventstudyfile\n\n save existing event studies in an event study file.\n\nsetactiveeventstudy\n\n select an Event Study in an Event file as the active Event Study for running dynamic or power flow event studies.\n\n--- Extension Data Access — .txt ---\n\nExtension Data Access — \n\nExtension Data Access¶\n\n\n\n\n\nget_ext_acline_char\n\n get ac line character extension data.\n\nget_ext_acline_int\n\n get ac line integer extension data.\n\nget_ext_acline_logical\n\n get ac line logical extension data.\n\nget_ext_acline_real\n\n get ac line real extension data.\n\nget_ext_area_char\n\n get area character extension data.\n\nget_ext_area_int\n\n get area integer extension data.\n\nget_ext_area_logical\n\n get area logical extension data.\n\nget_ext_area_real\n\n get area real extension data.\n\nget_ext_bus_char\n\n get bus character extension data.\n\nget_ext_bus_int\n\n get bus integer extension data.\n\nget_ext_bus_logical\n\n get bus logical extension data.\n\nget_ext_bus_real\n\n get bus real"
  },
  {
    "id": "chunk_14_part_1",
    "text": " extension data.\n\nget_ext_char\n\n get character extension data.\n\nget_ext_facts_char\n\n get facts device character extension data.\n\nget_ext_facts_int\n\n get facts device integer extension data.\n\nget_ext_facts_logical\n\n get facts device logical extension data.\n\nget_ext_facts_real\n\n get facts device real extension data.\n\nget_ext_fixshunt_char\n\n get fixed shunt character extension data.\n\nget_ext_fixshunt_int\n\n get fixed shunt integer extension data.\n\nget_ext_fixshunt_logical\n\n get fixed shunt logical extension data.\n\nget_ext_fixshunt_real\n\n get fixed shunt real extension data.\n\nget_ext_generator_char\n\n get generator character extension data.\n\nget_ext_generator_int\n\n get generator integer extension data.\n\nget_ext_generator_logical\n\n get generator logical extension data.\n\nget_ext_generator_real\n\n get generator real extension data.\n\nget_ext_gne_char\n\n get general network element device character extension data.\n\nget_ext_gne_int\n\n get general network element device integer extension data.\n\nget_ex"
  },
  {
    "id": "chunk_14_part_2",
    "text": "t_gne_logical\n\n get general network element device logical extension data.\n\nget_ext_gne_real\n\n get general network element device real extension data.\n\nget_ext_iatrans_char\n\n get inter-area transfer character extension data.\n\nget_ext_iatrans_int\n\n get inter-area transfer integer extension data.\n\nget_ext_iatrans_logical\n\n get inter-area transfer logical extension data.\n\nget_ext_iatrans_real\n\n get inter-area transfer real extension data.\n\nget_ext_indmach_char\n\n get induction machine character extension data.\n\nget_ext_indmach_int\n\n get induction machine integer extension data.\n\nget_ext_indmach_logical\n\n get induction machine logical extension data.\n\nget_ext_indmach_real\n\n get induction machine real extension data.\n\nget_ext_int\n\n get integer extension data.\n\nget_ext_load_char\n\n get load character extension data.\n\nget_ext_load_int\n\n get load integer extension data.\n\nget_ext_load_logical\n\n get load logical extension data.\n\nget_ext_load_real\n\n get load real extension data.\n\nget_ext_logical"
  },
  {
    "id": "chunk_15_part_0",
    "text": "get logical extension data.\n\nget_ext_msline_char\n\n get multi-section line character extension data.\n\nget_ext_msline_int\n\n get multi-section line integer extension data.\n\nget_ext_msline_logical\n\n get multi-section line logical extension data.\n\nget_ext_msline_real\n\n get multi-section line real extension data.\n\nget_ext_ntermdc_char\n\n get multi-terminal dc line character extension data.\n\nget_ext_ntermdc_int\n\n get multi-terminal dc line integer extension data.\n\nget_ext_ntermdc_logical\n\n get multi-terminal dc line logical extension data.\n\nget_ext_ntermdc_real\n\n get multi-terminal dc line real extension data.\n\nget_ext_owner_char\n\n get owner character extension data.\n\nget_ext_owner_int\n\n get owner integer extension data.\n\nget_ext_owner_logical\n\n get owner logical extension data.\n\nget_ext_owner_real\n\n get owner real extension data.\n\nget_ext_rating_char\n\n get rating character extension data.\n\nget_ext_rating_int\n\n get rating integer extension data.\n\nget_ext_rating_logical\n\n get rating logical ext"
  },
  {
    "id": "chunk_15_part_1",
    "text": "ension data.\n\nget_ext_rating_real\n\n get rating real extension data.\n\nget_ext_real\n\n get real extension data.\n\nget_ext_rowcount\n\n get extension data table row count.\n\nget_ext_sub_char\n\n get substation character extension data.\n\nget_ext_sub_int\n\n get substation integer extension data.\n\nget_ext_sub_logical\n\n get substation logical extension data.\n\nget_ext_sub_real\n\n get substation real extension data.\n\nget_ext_subnode_char\n\n get substation node character extension data.\n\nget_ext_subnode_int\n\n get substation node integer extension data.\n\nget_ext_subnode_logical\n\n get substation node logical extension data.\n\nget_ext_subnode_real\n\n get substation node real extension data.\n\nget_ext_subswd_char\n\n get substation switching device character extension data.\n\nget_ext_subswd_int\n\n get substation switching device integer extension data.\n\nget_ext_subswd_logical\n\n get substation switching device logical extension data.\n\nget_ext_subswd_real\n\n get substation switching device real extension data.\n\nget_ext"
  },
  {
    "id": "chunk_15_part_2",
    "text": "_swshunt_char\n\n get switched shunt character extension data.\n\nget_ext_swshunt_int\n\n get switched shunt integer extension data.\n\nget_ext_swshunt_logical\n\n get switched shunt logical extension data.\n\nget_ext_swshunt_real\n\n get switched shunt real extension data.\n\nget_ext_sysswd_char\n\n get system switching device character extension data.\n\nget_ext_sysswd_int\n\n get system switching device integer extension data.\n\nget_ext_sysswd_logical\n\n get system switching device logical extension data.\n\nget_ext_sysswd_real\n\n get system switching device real extension data.\n\nget_ext_transformer_char\n\n get transformer character extension data.\n\nget_ext_transformer_int\n\n get transformer integer extension data.\n\nget_ext_transformer_logical\n\n get transformer logical extension data.\n\nget_ext_transformer_real\n\n get transformer real extension data.\n\nget_ext_twotermdc_char\n\n get two-terminal dc line character extension data.\n\nget_ext_twotermdc_int\n\n get two-terminal dc line integer extension data.\n\nget_ext_twote"
  },
  {
    "id": "chunk_16_part_0",
    "text": "rmdc_logical\n\n get two-terminal dc line logical extension data.\n\nget_ext_twotermdc_real\n\n get two-terminal dc line real extension data.\n\nget_ext_vscdc_char\n\n get voltage source converter dc line character extension data.\n\nget_ext_vscdc_int\n\n get voltage source converter dc line integer extension data.\n\nget_ext_vscdc_logical\n\n get voltage source converter dc line logical extension data.\n\nget_ext_vscdc_real\n\n get voltage source converter dc line real extension data.\n\nget_ext_zone_char\n\n get zone character extension data.\n\nget_ext_zone_int\n\n get zone integer extension data.\n\nget_ext_zone_logical\n\n get zone logical extension data.\n\nget_ext_zone_real\n\n get zone real extension data.\n\nset_ext_acline_char\n\n set ac line character extension data.\n\nset_ext_acline_int\n\n set ac line integer extension data.\n\nset_ext_acline_logical\n\n set ac line logical extension data.\n\nset_ext_acline_real\n\n set ac line real extension data.\n\nset_ext_area_char\n\n set area character extension data.\n\nset_ext_area_int\n\n s"
  },
  {
    "id": "chunk_16_part_1",
    "text": "et area integer extension data.\n\nset_ext_area_logical\n\n set area logical extension data.\n\nset_ext_area_real\n\n set area real extension data.\n\nset_ext_bus_char\n\n set bus character extension data.\n\nset_ext_bus_int\n\n set bus integer extension data.\n\nset_ext_bus_logical\n\n set bus logical extension data.\n\nset_ext_bus_real\n\n set bus real extension data.\n\nset_ext_char\n\n set character extension data.\n\nset_ext_facts_char\n\n set facts device character extension data.\n\nset_ext_facts_int\n\n set facts device integer extension data.\n\nset_ext_facts_logical\n\n set facts device logical extension data.\n\nset_ext_facts_real\n\n set facts device real extension data.\n\nset_ext_fixshunt_char\n\n set fixed shunt character extension data.\n\nset_ext_fixshunt_int\n\n set fixed shunt integer extension data.\n\nset_ext_fixshunt_logical\n\n set fixed shunt logical extension data.\n\nset_ext_fixshunt_real\n\n set fixed shunt real extension data.\n\nset_ext_generator_char\n\n set generator character extension data.\n\nset_ext_generator_int\n\n "
  },
  {
    "id": "chunk_16_part_2",
    "text": "set generator integer extension data.\n\nset_ext_generator_logical\n\n set generator logical extension data.\n\nset_ext_generator_real\n\n set generator real extension data.\n\nset_ext_gne_char\n\n set general network element device character extension data.\n\nset_ext_gne_int\n\n set general network element device integer extension data.\n\nset_ext_gne_logical\n\n set general network element device logical extension data.\n\nset_ext_gne_real\n\n set general network element device real extension data.\n\nset_ext_iatrans_char\n\n set inter-area transfer character extension data.\n\nset_ext_iatrans_int\n\n set inter-area transfer integer extension data.\n\nset_ext_iatrans_logical\n\n set inter-area transfer logical extension data.\n\nset_ext_iatrans_real\n\n set inter-area transfer real extension data.\n\nset_ext_indmach_char\n\n set induction machine character extension data.\n\nset_ext_indmach_int\n\n set induction machine integer extension data.\n\nset_ext_indmach_logical\n\n set induction machine logical extension data.\n\nset_ext_indma"
  },
  {
    "id": "chunk_17_part_0",
    "text": "ch_real\n\n set induction machine real extension data.\n\nset_ext_int\n\n set integer extension data.\n\nset_ext_load_char\n\n set load character extension data.\n\nset_ext_load_int\n\n set load integer extension data.\n\nset_ext_load_logical\n\n set load logical extension data.\n\nset_ext_load_real\n\n set load real extension data.\n\nset_ext_logical\n\n set logical extension data.\n\nset_ext_msline_char\n\n set multi-section line character extension data.\n\nset_ext_msline_int\n\n set multi-section line integer extension data.\n\nset_ext_msline_logical\n\n set multi-section line logical extension data.\n\nset_ext_msline_real\n\n set multi-section line real extension data.\n\nset_ext_ntermdc_char\n\n set multi-terminal dc line character extension data.\n\nset_ext_ntermdc_int\n\n set multi-terminal dc line integer extension data.\n\nset_ext_ntermdc_logical\n\n set multi-terminal dc line logical extension data.\n\nset_ext_ntermdc_real\n\n set multi-terminal dc line real extension data.\n\nset_ext_owner_char\n\n set owner character extension data.\n"
  },
  {
    "id": "chunk_17_part_1",
    "text": "\nset_ext_owner_int\n\n set owner integer extension data.\n\nset_ext_owner_logical\n\n set owner logical extension data.\n\nset_ext_owner_real\n\n set owner real extension data.\n\nset_ext_rating_char\n\n set rating character extension data.\n\nset_ext_rating_int\n\n set rating integer extension data.\n\nset_ext_rating_logical\n\n set rating logical extension data.\n\nset_ext_rating_real\n\n set rating real extension data.\n\nset_ext_real\n\n set real extension data.\n\nset_ext_sub_char\n\n set substation character extension data.\n\nset_ext_sub_int\n\n set substation integer extension data.\n\nset_ext_sub_logical\n\n set substation logical extension data.\n\nset_ext_sub_real\n\n set substation real extension data.\n\nset_ext_subnode_char\n\n set substation node character extension data.\n\nset_ext_subnode_int\n\n set substation node integer extension data.\n\nset_ext_subnode_logical\n\n set substation node logical extension data.\n\nset_ext_subnode_real\n\n set substation node real extension data.\n\nset_ext_subswd_char\n\n set substation switching d"
  },
  {
    "id": "chunk_17_part_2",
    "text": "evice character extension data.\n\nset_ext_subswd_int\n\n set substation switching device integer extension data.\n\nset_ext_subswd_logical\n\n set substation switching device logical extension data.\n\nset_ext_subswd_real\n\n set substation switching device real extension data.\n\nset_ext_swshunt_char\n\n set switched shunt character extension data.\n\nset_ext_swshunt_int\n\n set switched shunt integer extension data.\n\nset_ext_swshunt_logical\n\n set switched shunt logical extension data.\n\nset_ext_swshunt_real\n\n set switched shunt real extension data.\n\nset_ext_sysswd_char\n\n set system switching device character extension data.\n\nset_ext_sysswd_int\n\n set system switching device integer extension data.\n\nset_ext_sysswd_logical\n\n set system switching device logical extension data.\n\nset_ext_sysswd_real\n\n set system switching device real extension data.\n\nset_ext_transformer_char\n\n set transformer character extension data.\n\nset_ext_transformer_int\n\n set transformer integer extension data.\n\nset_ext_transformer_logi"
  },
  {
    "id": "chunk_18_part_0",
    "text": "cal\n\n set transformer logical extension data.\n\nset_ext_transformer_real\n\n set transformer real extension data.\n\nset_ext_twotermdc_char\n\n set two-terminal dc line character extension data.\n\nset_ext_twotermdc_int\n\n set two-terminal dc line integer extension data.\n\nset_ext_twotermdc_logical\n\n set two-terminal dc line logical extension data.\n\nset_ext_twotermdc_real\n\n set two-terminal dc line real extension data.\n\nset_ext_vscdc_char\n\n set voltage source converter dc line character extension data.\n\nset_ext_vscdc_int\n\n set voltage source converter dc line integer extension data.\n\nset_ext_vscdc_logical\n\n set voltage source converter dc line logical extension data.\n\nset_ext_vscdc_real\n\n set voltage source converter dc line real extension data.\n\nset_ext_zone_char\n\n set zone character extension data.\n\nset_ext_zone_int\n\n set zone integer extension data.\n\nset_ext_zone_logical\n\n set zone logical extension data.\n\nset_ext_zone_real\n\n set zone real extension data.\n\n--- Facts Device Bus Data — .txt ---\n"
  },
  {
    "id": "chunk_18_part_1",
    "text": "\nFacts Device Bus Data — \n\nFacts Device Bus Data¶\n\n\n\n\n\nafactsbuschar\n\n return an array of character values for subsystem FACTS device buses.\n\nafactsbuscount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the FACTS device bus data family.\n\nafactsbuscplx\n\n return an array of complex values for subsystem FACTS device buses.\n\nafactsbusint\n\n return an array of integer values for subsystem FACTS device buses.\n\nafactsbusreal\n\n return an array of real values for subsystem FACTS device buses.\n\nafactsbustypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the FACTS device bus data family (aFactsBusInt, aFactsBusReal, aFactsBusCplx and aFactsBusChar).\n\n--- Facts Device Data — .txt ---\n\nFacts Device Data — \n\nFacts Device Data¶\n\n\n\n\n\nafactschar\n\n return an array of character values for subsystem FACTS"
  },
  {
    "id": "chunk_18_part_2",
    "text": " devices.\n\nafactscount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the FACTS device data family.\n\nafactscplx\n\n return an array of complex values for subsystem FACTS devices.\n\nafactsint\n\n return an array of integer values for subsystem FACTS devices.\n\nafactsreal\n\n return an array of real values for subsystem FACTS devices.\n\nafactstypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the FACTS device data family (aFactsInt, aFactsReal, aFactsCplx and aFactsChar).\n\n--- Facts Device Models — .txt ---\n\nFacts Device Models — \n\nFacts Device Models¶\n\n\n\n\n\nadd_facts_device_model\n\n add a FACTS device model to the specified FACTS device.\n\nchange_fctmod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of the FACTS device model of a specified FACTS device.\n\nchange"
  },
  {
    "id": "chunk_19_part_0",
    "text": "_fctmod_con\n\n change the value of a CON of the FACTS device model of a specified FACTS device.\n\nchange_fctmod_data\n\n\n\nchange_fctmod_icon\n\n change the value of an integer ICON of the FACTS device model of a specified FACTS device.\n\nchange_fctmod_var\n\n change the value of a VAR of the FACTS device model of a specified FACTS device.\n\nfctmod_pack\n\n remove entries that are marked as unused from the FACTS device model connection tables and the FACTS device model array allocation tables.\n\nfctmod_remove\n\n remove the FACTS device model from a specified FACTS device.\n\nfctmod_status\n\n change the status of the FACTS device model at a specified FACTS device.\n\nfctmod_unconnected\n\n list or remove from dynamics working memory those FACTS device models that are assigned to FACTS device that are not present in the current power flow working case (unconnected).\n\nfctmod_user\n\n list user-written FACTS device model definitions or to remove user-written FACTS device model definitions that are not assigned to"
  },
  {
    "id": "chunk_19_part_1",
    "text": " any FACTS devices (unused) from the user model definition tables.\n\ngmb_add_facts_dev_model\n\n add a GMB FACTS device model to the specified FACTS device.\n\n--- Fault Analysis Data — .txt ---\n\nFault Analysis Data — \n\nFault Analysis Data¶\n\n\n\n\n\nmbidncs\n\n change the table name of the specified non-conventional source fault contribution table in the working case.\n\nseq_3_wind_grounding_data\n\n modify the zero sequence grounding data of an existing three-winding transformer in the working case (see PSSE Program Operation Manual, Zero Sequence Transformer Data).\n\nseq_3_wind_winding_data\n\n modify the zero sequence impedance data of one winding of an existing three- winding transformer in the working case (see PSSE Program Operation Manual, Zero Sequence Transformer Data).\n\nseq_branch_data\n\n\n\nseq_branch_data_3\n\n modify the zero sequence data of an existing non-transformer branch in the working case (see PSSE Program Operation Manual, Zero Sequence Non-Transformer Branch Data).\n\nseq_bus_data\n\nBus l"
  },
  {
    "id": "chunk_19_part_2",
    "text": "oad sequence data is now accessible as load sequence data.\n\nseq_fixed_shunt_data\n\n modify the zero sequence data of an existing fixed bus shunt in the working case (see PSSE Program Operation Manual, Zero Sequence Fixed Shunt Data).\n\nseq_induction_mach_data\n\n\n\nseq_induction_mach_data_2\n\nUse this API routine to modify the sequence data of an existing induction machine in the working case (see PSSE Program Operation Manual, Induction Machine Impedance Data).\n\nseq_load_data\n\nUse this API routine to modify the sequence data of an existing load in the working case (see PSSE Program Operation Manual, Load Data).\n\nseq_machine_data\n\n\n\nseq_machine_data_3\n\n\n\nseq_machine_data_4\n\nUse this API routine to modify the sequence data of an existing machine in the working case (see PSSE Program Operation Manual, Positive Sequence Generator Impedance Data, Negative Sequence Generator Impedance Data and Zero Sequence Generator Impedance Data).\n\nseq_machine_ncs_data\n\nUse this API routine to modify a machine"
  },
  {
    "id": "chunk_20_part_0",
    "text": "’s existing non-conventional source fault current contribution (NCSFCC) data or to add NCSFCC data to an existing machine in the working case.\n\nseq_machine_ncs_data_purg\n\nUse this API routine to delete a machine’s existing non-conventional source fault current contribution (NCSFCC) data.\n\nseq_mutual_data\n\n modify existing zero sequence mutual impedance data in the working case or to add a new zero sequence mutual coupling to the working case (see PSSE Program Operation Manual, Zero Sequence Mutual Impedance Data).\n\nseq_ncs_flt_cntrb_chng\n\nThis API routine was first introduced in release 34.\n\nseq_ncs_flt_cntrb_data\n\n\n\nseq_ncs_flt_cntrb_purg\n\n\n\nseq_ncs_table_data\n\n modify the data of an existing non-conventional source fault contribution table in the working case or to add a new non-conventional source fault contribution table to the working case.\n\nseq_ncs_table_onept\n\n modify the one data point of an existing non-conventional source fault contribution table in the working case or to add"
  },
  {
    "id": "chunk_20_part_1",
    "text": " a new one data point to non-conventional source fault contribution table to the working case.\n\nseq_ncs_table_purg\n\n delete an existing non-conventional source fault contribution table from the working case.\n\nseq_ncs_table_purg_onept\n\n delete specified data point in an existing non-conventional source fault contribution table.\n\nseq_ncs_table_type\n\n get NCS table type.\n\nseq_switched_shunt_data\n\n\n\nseq_switched_shunt_data_3\n\n modify the zero sequence data of an existing switched shunt in the working case (see PSSE Program Operation Manual, Zero Sequence Switched Shunt Data).\n\nseq_three_winding_data\n\n\n\nseq_three_winding_data_3\n\n modify the zero sequence data of an existing three-winding transformer in the working case.\n\nseq_two_winding_data\n\n\n\nseq_two_winding_data_3\n\n modify the zero sequence data of an existing two-winding transformer in the working case (see PSSE Program Operation Manual, Zero Sequence Transformer Data).\n\n--- Fault Analysis Operation — .txt ---\n\nFault Analysis Operation "
  },
  {
    "id": "chunk_20_part_2",
    "text": "— \n\nFault Analysis Operation¶\n\n\n\n\n\nansi\n\n\n\nansi_2\n\n\n\nansi_3\n\nThis API routine executes the third release of the ANSI fault calculation function.\n\nascc\n\n\n\nascc_1a\n\n\n\nascc_2\n\n\n\nascc_3\n\nThis API is used to apply a series of faults at various locations in the working case.\n\nascc_scfile\n\nThis API reads ASCC short circuit results from SCFILE and produces same ASCC output report that was generated when SCFILE was created.\n\nbkdy\n\n calculate and report circuit breaker interrupting duty for 3-phase faults at all buses in a specified subsystem of the working case (activity BKDY).\n\ncheck_sequence_data\n\nUse this API routine to perform data checks on the selected categories of sequence data for all buses in the working case or for all buses in a specified subsystem.\n\nflat\n\n\n\nflat_2\n\nThis API routine is the second release of the flat conditions function.\n\niecs\n\n\n\niecs_2\n\n\n\niecs_3\n\n\n\niecs_4\n\nThis API executes the fourth release of the IEC short circuit calculations function.\n\niecs_scfile\n\nThis API rea"
  },
  {
    "id": "chunk_21_part_0",
    "text": "ds IECS short circuit results from SCFILE and produces same IECS output report that was generated when SCFILE was created.\n\nnewseq\n\n initialize the fault analysis data arrays, set them to default values, and set the flag indicating that sequence data is present in the working case.\n\nsceq\n\n construct network equivalents of the positive and zero sequence networks and calculates source impedances at equivalent source nodes for all three sequences in preparation for the unbalanced fault analysis activities of PSSE.\n\nscgr\n\n\n\nscmu\n\n\n\nscmu_2\n\n calculate simultaneous unbalances.\n\nscop\n\n tabulate unbalanced fault solution output.\n\nseqd\n\n\n\nseqd_2\n\nUse this API routine to factorize the sequence matrices in preparation for unbalanced fault calculations SCMU and SPCB.\n\nsequence_network_setup\n\n specify or return the option to enable or disable automatic fault analysis sequence network setup.\n\nsqex\n\n tabulate all fault analysis data pertaining to a specified bus.\n\n--- Fixed Shunt Bus Data — .txt ---\n"
  },
  {
    "id": "chunk_21_part_1",
    "text": "\nFixed Shunt Bus Data — \n\nFixed Shunt Bus Data¶\n\n\n\n\n\nafxshntbuschar\n\n return an array of character values for subsystem buses.\n\nafxshntbuscount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the fixed shunt bus data family.\n\nafxshntbuscplx\n\n return an array of complex values for subsystem buses.\n\nafxshntbusint\n\n return an array of integer values for subsystem buses.\n\nafxshntbusreal\n\n return an array of real values for subsystem buses.\n\nafxshntbustypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the fixed shunt bus data family (aFxShntBusInt, aFxShntBusReal, aFxShntBusCplx and aFxShntBusChar).\n\n--- Fixed Shunt Data — .txt ---\n\nFixed Shunt Data — \n\nFixed Shunt Data¶\n\n\n\n\n\nafxshuntchar\n\n return an array of character values for subsystem fixed shunts.\n\nafxshuntcount\n\n return the number of "
  },
  {
    "id": "chunk_21_part_2",
    "text": "array entries required to accommodate the data to be returned by the remaining members of the fixed shunt data family.\n\nafxshuntcplx\n\n return an array of complex values for subsystem fixed shunts.\n\nafxshuntint\n\n return an array of integer values for subsystem fixed shunts.\n\nafxshuntreal\n\n return an array of real values for subsystem fixed shunts.\n\nafxshunttypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the fixed shunt data family (aFxShuntInt, aFxShuntReal, aFxShuntCplx and aFxShuntChar).\n\n--- Gic Data — .txt ---\n\nGic Data — \n\nGic Data¶\n\n\n\n\n\ngic_2tdc\n\n modify or add new two terminal dc GIC shunt data to the working case.\n\ngic_2tdc_chng\n\n modify new two terminal dc GIC shunt data from the working case.\n\ngic_2tdc_purg\n\n purge new two terminal dc GIC shunt data from the working case.\n\ngic_brn\n\n modify or add new GIC branch data to the working case."
  },
  {
    "id": "chunk_22_part_0",
    "text": "gic_brn_chng\n\n modify new GIC branch data from the working case.\n\ngic_brn_purg\n\n purge GIC branch data from the working case.\n\ngic_earth1d_usr\n\n modify or add new GIC User 1D Earth Model data to the working case.\n\ngic_earth1d_usr_chng\n\n modify GIC User 1D Earth Model data from the working case.\n\ngic_facts\n\n modify or add new FACTS device GIC shunt data to the working case.\n\ngic_facts_chng\n\n modify new FACTS device GIC shunt data from the working case.\n\ngic_facts_purg\n\n purge new FACTS device GIC shunt data from the working case.\n\ngic_fxsh\n\n modify or add new fixed shunt GIC shunt data to the working case.\n\ngic_fxsh_chng\n\n modify fixed shunt GIC shunt data from the working case.\n\ngic_fxsh_purg\n\n purge fixed shunt GIC shunt data from the working case.\n\ngic_load\n\n modify or add new load GIC shunt data to the working case.\n\ngic_load_chng\n\n modify load GIC shunt data from the working case.\n\ngic_load_purg\n\n purge load GIC shunt data from the working case.\n\ngic_mtdc\n\n modify or add new multi "
  },
  {
    "id": "chunk_22_part_1",
    "text": "terminal dc GIC shunt data to the working case.\n\ngic_mtdc_chng\n\n modify new multi terminal dc GIC shunt data from the working case.\n\ngic_mtdc_purg\n\n purge new multi terminal dc GIC shunt data from the working case.\n\ngic_substn\n\n modify or add new GIC sub station data to the working case.\n\ngic_substn_chng\n\n modify GIC sub station data to the working case.\n\ngic_substn_purg\n\n purge GIC sub station data to the working case.\n\ngic_swsh\n\n modify or add new GIC switched shunt data to the working case.\n\ngic_swsh_chng\n\n modify GIC switched shunt data from the working case.\n\ngic_swsh_purg\n\n purge GIC switched shunt data from the working case.\n\ngic_trn\n\n modify or add new GIC transformer data to the working case.\n\ngic_trn_chng\n\n modify GIC transformer data to the working case.\n\ngic_trn_purg\n\n purge GIC transformer data from the working case.\n\ngic_vscdc\n\n modify or add new vscdc GIC shunt data to the working case.\n\ngic_vscdc_chng\n\n modify new vscdc GIC shunt data from the working case.\n\ngic_vscdc_p"
  },
  {
    "id": "chunk_22_part_2",
    "text": "urg\n\n purge new vscdc GIC shunt data from the working case.\n\n--- Gic Operation — .txt ---\n\nGic Operation — \n\nGic Operation¶\n\n\n\n\n\ngic\n\n\n\ngic_2\n\n\n\ngic_3\n\n\n\ngic_4\n\n\n\ngic_5\n\n\n\ngic_6\n\n\n\ngic_7\n\n\n\ngic_8\n\n calculate Geomagnetically Induced Currents (GIC) in electric power system network as a result of Geomagnetic Disturbance (GMD).\n\ngic_branch_efield_nn\n\n calculate geoelectric efield induced in the network branches from specified geoelectric efield grid data using nearest neigbor (NN) alogorithm.\n\ngic_earth1d_usr_purg\n\n purge GIC User 1D Earth Model data from the working case.\n\ngic_efield_waveshape\n\nFor Transformer Thermal Impact assessement due to geomagnetic disturbance event, set the geoelectric field waveshape as provided in EFLDFILE.\n\ngic_efield_waveshape_ref\n\nFor Transformer Thermal Impact assessement due to geomagnetic disturbance event, set the geoelectric field waveshape as NERC TPL-007-2 benhcmark event.\n\ngic_efield_waveshape_supp\n\nFor Transformer Thermal Impact assessement due to ge"
  },
  {
    "id": "chunk_23_part_0",
    "text": "omagnetic disturbance event, set the geoelectric field waveshape as NERC TPL-007-2 supplemental event.\n\ngic_mvarloss_scaling_factors\n\nSpecify KFACTORS to determine transformer reactive power losses due to geomagnetic currents (GICs) flow.\n\ngic_new\n\n initialize all data records required for GIC analysis.\n\ngic_pf_options\n\n specify the Newton-Raphson power flow solution options used in GIC.\n\ngic_purg\n\n purge all GIC data from the working case.\n\ngic_read\n\n read GIC Data Text (.gic) File into the working case memory.\n\ngic_read_efield_grid\n\n read Geoelectric Efield Grid Data File into the working case memory.\n\ngic_thermal_impact\n\n\n\ngic_thermal_impact_1\n\n calculate Transformer Thermal Impact assessement GIC(t) curve using specified effective Eastward GIC(E) and Nortward GIC(N) for one specific transformer.\n\ngic_write\n\n write working case GIC Data to text (.gic) file.\n\ngic_write_stn\n\n write working case GIC Data to text (.gic) file version 4 that has substation data.\n\n--- Graphical Analysis Ou"
  },
  {
    "id": "chunk_23_part_1",
    "text": "tput — .txt ---\n\nGraphical Analysis Output — \n\nGraphical Analysis Output¶\n\n\n\n\n\npoly_print\n\n print the results of activity POLY from a .pol results file.\n\npv_print\n\n print the results of PV analysis from the .pv results file\n\nqv_print\n\n print the results of QV analysis from a .qv resultsfile.\n\nsetfullviewgrapharea\n\n specify the parameters of the scales used for plotting the results of PV and QV analysis.\n\nsetfullviewscale\n\n specify the parameters of the scales used for plotting the results of PV and QV analysis.\n\n--- Harmonics Data — .txt ---\n\nHarmonics Data — \n\nHarmonics Data¶\n\n\n\n\n\nhar_2tdc\n\n modify or add new harmonics Two Terminal DC data to the working case.\n\nhar_2tdc_chng\n\n modify harmonics Two Terminal DC data in the working case.\n\nhar_2tdc_purg\n\n purge specified harmonics Two Terminal DC data from the working case.\n\nhar_brn\n\n modify or add new harmonics branch data to the working case.\n\nhar_brn_chng\n\n modify harmonics branch data to the working case.\n\nhar_brn_purg\n\n purge specifi"
  },
  {
    "id": "chunk_23_part_2",
    "text": "ed harmonics branch data from the working case.\n\nhar_cursrc\n\n modify or add new harmonics current source table data to the working case.\n\nhar_cursrc_chng\n\n change harmonics current source table data in the working case.\n\nhar_cursrc_chng_name\n\n change harmonics current source table name in the working case.\n\nhar_cursrc_chng_onept\n\n modify one data point to harmonics current source table in the working case.\n\nhar_cursrc_name\n\n add or change harmonics current source table name in the working case.\n\nhar_cursrc_onept\n\n modify or add new one data point to harmonics current source table in the working case.\n\nhar_cursrc_purg\n\n purge specified harmonics current source table data from the working case.\n\nhar_cursrc_purg_onept\n\n purge specified data point in harmonics current source table.\n\nhar_facts\n\n modify or add new harmonics FACTS device data to the working case.\n\nhar_facts_chng\n\n modify harmonics FACTS device data in the working case.\n\nhar_facts_purg\n\n purge specified harmonics FACTS device"
  },
  {
    "id": "chunk_24_part_0",
    "text": "data from the working case.\n\nhar_impchar\n\n modify or add new harmonics impedance characteristics table data to the working case.\n\nhar_impchar_chng\n\n change harmonics impedance characteristics table data in the working case.\n\nhar_impchar_chng_name\n\n change harmonics impedance characteristics table name in the working case.\n\nhar_impchar_chng_onept\n\n modify one data point to harmonics impedance characteristics table in the working case.\n\nhar_impchar_name\n\n add or change harmonics impedance characteristics table name in the working case.\n\nhar_impchar_onept\n\n modify or add new one data point to harmonics impedance characteristics table in the working case.\n\nhar_impchar_purg\n\n purge specified harmonics impedance characteristics table data from the working case.\n\nhar_impchar_purg_onept\n\n purge specified data point in harmonics impedance characteristics table.\n\nhar_indmc\n\n modify or add new harmonics induction machine data to the working case.\n\nhar_indmc_chng\n\n modify harmonics induction machi"
  },
  {
    "id": "chunk_24_part_1",
    "text": "ne data to the working case.\n\nhar_indmc_purg\n\n purge specified harmonics induction machine data from the working case.\n\nhar_load\n\n modify or add new harmonics load data to the working case.\n\nhar_load_chng\n\n modify harmonics load data to the working case.\n\nhar_load_purg\n\n purge specified harmonics load data from the working case.\n\nhar_mach\n\n modify or add new harmonics machine data to the working case.\n\nhar_mach_chng\n\n modify harmonics machine data to the working case.\n\nhar_mach_purg\n\n purge specified harmonics machine data from the working case.\n\nhar_mtdc\n\n modify or add new harmonics Multi Terminal DC data to the working case.\n\nhar_mtdc_chng\n\n modify harmonics Multi Terminal DC data in the working case.\n\nhar_mtdc_purg\n\n purge specified harmonics Multi Terminal DC data from the working case.\n\nhar_passive_filter\n\n modify or add new harmonics passive filter data to the working case.\n\nhar_passive_filter_chng\n\n modify harmonics passive filter data in the working case.\n\nhar_passive_filter_p"
  },
  {
    "id": "chunk_24_part_2",
    "text": "urg\n\n purge specified harmonics passive filter data from the working case.\n\nhar_set_par_lodmdl_cigre_measurement\n\n set parameters for harmonics load data user model CIGRE_MEASUREMENT.\n\nhar_set_par_lodmdl_cigre_motive\n\n set parameters for harmonics load data user model CIGRE_MOTIVE.\n\nhar_set_par_lodmdl_cigre_passive\n\n set parameters for harmonics load data user model CIGRE_PASSIVE.\n\nhar_set_par_lodmdl_ieee_2rl_parallel\n\n set parameters for harmonics load data user model IEEE_2RL_PARALLEL.\n\nhar_set_par_lodmdl_ieee_im\n\n set parameters for harmonics load data user model IEEE_IM.\n\nhar_set_par_lodmdl_ieee_measurement\n\n set parameters for harmonics load data user model IEEE_MEASUREMENT.\n\nhar_set_par_lodmdl_ieee_skin\n\n set parameters for harmonics load data user model IEEE_SKIN.\n\nhar_set_par_lodmdl_large_async_motor\n\n set parameters for harmonics load data user model LARGE_ASYNC_MOTOR.\n\nhar_trn\n\n modify or add new harmonics transformer data to the working case.\n\nhar_trn_chng\n\n modify harmonics"
  },
  {
    "id": "chunk_25_part_0",
    "text": "transformer data to the working case.\n\nhar_trn_purg\n\n purge specified harmonics transformer data from the working case.\n\nhar_vltsrc\n\n modify or add new harmonics voltage source table data to the working case.\n\nhar_vltsrc_chng\n\n change harmonics voltage source table data in the working case.\n\nhar_vltsrc_chng_name\n\n change harmonics voltage source table name in the working case.\n\nhar_vltsrc_chng_onept\n\n modify one data point to harmonics voltage source table in the working case.\n\nhar_vltsrc_name\n\n add or change harmonics voltage source table name in the working case.\n\nhar_vltsrc_onept\n\n modify or add new one data point to harmonics voltage source table in the working case.\n\nhar_vltsrc_purg\n\n purge specified harmonics voltage source table data from the working case.\n\nhar_vltsrc_purg_onept\n\n purge specified data point in harmonics voltage source table.\n\nhar_vscdc\n\n modify or add new harmonics VSCDC data to the working case.\n\nhar_vscdc_chng\n\n modify harmonics VSCDC data in the working case."
  },
  {
    "id": "chunk_25_part_1",
    "text": "\n\nhar_vscdc_purg\n\n purge specified harmonics VSCDC data from the working case.\n\n--- Harmonics Operation — .txt ---\n\nHarmonics Operation — \n\nHarmonics Operation¶\n\n\n\n\n\nhar_analysis\n\n\n\nhar_analysis_2\n\n run harmonics analysis.\n\nhar_create_pfcase\n\n save working case updated for harmonic frequency and passive filters added as fixed shunts.\n\nhar_exists_dstn_results\n\nCheck if Harmonics Distortion Calculation results available in PSSE working memory from previously run harmonic analysis activity.\n\nhar_exists_fscan_results\n\nCheck if Harmonics Frequency Scan results available in PSSE working memory from previously run harmonic analysis activity.\n\nhar_export_dstn\n\n export harmonics distortion calculation results to comma separated (.csv) file.\n\nhar_export_fscan\n\n export harmonics frequency scan results to comma separated (.csv) file.\n\nhar_new\n\n initialize all data records required for Harmonics analysis.\n\nhar_purg\n\n purge all harmonics data from the working case.\n\nhar_set_resn_thresholds\n\n set par"
  },
  {
    "id": "chunk_25_part_2",
    "text": "ameters to filter resonances from harmonic analysis frequency scan response.\n\nhar_set_resn_thresholds_default\n\n set default parameters to filter resonances from harmonic analysis frequency scan response.\n\n--- Induction Machine Bus Data — .txt ---\n\nInduction Machine Bus Data — \n\nInduction Machine Bus Data¶\n\n\n\n\n\naindmacbuschar\n\nUse this API routine to return an array of character values for subsystem buses.\n\naindmacbuscount\n\nUse this API routine to obtain the number of array entries required to accommodate the data to be returned by the remaining members of the induction machine bus data family.\n\naindmacbuscplx\n\nUse this API routine to return an array of complex values for subsystem buses.\n\naindmacbusint\n\nUse this API routine to return an array of integer values for subsystem buses.\n\naindmacbusreal\n\nUse this API routine to return an array of real values for subsystem buses.\n\naindmacbustypes\n\nUse this API routine to return an array of character values indicating the data types correspond"
  },
  {
    "id": "chunk_26_part_0",
    "text": "ing to a set of specified STRING values that are valid input values to any of the data retrieval routines of the induction machine bus data family (aIndMacBusInt, aIndMacBusReal, aIndMacBusCplx and aIndMacBusChar).\n\n--- Induction Machine Data — .txt ---\n\nInduction Machine Data — \n\nInduction Machine Data¶\n\n\n\n\n\naindmacchar\n\nUse this API routine to return an array of character values for subsystem induction machines.\n\naindmaccount\n\nUse this API routine to obtain the number of array entries required to accommodate the data to be returned by the remaining members of the induction machine data family.\n\naindmaccplx\n\nUse this API routine to return an array of complex values for subsystem induction machines.\n\naindmacint\n\nUse this API routine to return an array of integer values for subsystem induction machines.\n\naindmacreal\n\nUse this API routine to return an array of real values for subsystem induction machines.\n\naindmactypes\n\nUse this API routine to return an array of character values indicati"
  },
  {
    "id": "chunk_26_part_1",
    "text": "ng the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the induction machine data family (aIndMacInt, aIndMacReal, aIndMacCplx and aIndMacChar).\n\n--- Induction Machine Models — .txt ---\n\nInduction Machine Models — \n\nInduction Machine Models¶\n\n\n\n\n\nadd_indmac_model\n\n add an induction machine model to a specified machine.\n\nchange_immod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of an induction machine model at a specified machine.\n\nchange_immod_con\n\n change the value of a CON of a designated induction machine model at a specified machine.\n\nchange_immod_icon\n\n change the value of an integer ICON of a designated induction machine model at a specified machine.\n\nchange_immod_var\n\n change the value of a VAR of a designated induction machine model at a specified machine.\n\nimmod_pack\n\n remove entries that are marked as unused from the induction machine model contables.\n\nimm"
  },
  {
    "id": "chunk_26_part_2",
    "text": "od_remove\n\n remove an induction machine model of a designated type from a specified machine.\n\nimmod_status\n\n change the status of an induction machine model at a specified machine.\n\nimmod_unconnected\n\n list or remove from dynamics working memory those induction machine models that are assigned to machines that are not present in the current power flow working case (unconnected).\n\nimmod_user\n\n list user-written induction machine model definitions or to remove user-written induction machine model definitions that are not assigned to any machines (unused) from the user model definition tables.\n\n--- Line Relay Models — .txt ---\n\nLine Relay Models — \n\nLine Relay Models¶\n\n\n\n\n\nadd_relay_model\n\n add a line relay model in the designated relay slot of the from bus end of a specified branch.\n\nchange_rlmod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of the line relay model in the designated relay slot of the from bus end of a specified branch.\n\nchange_rlmod"
  },
  {
    "id": "chunk_27_part_0",
    "text": "_con\n\n change the value of a CON of the line relay model in the designated relay slot of the from bus end of a specified branch.\n\nchange_rlmod_data\n\n\n\nchange_rlmod_icon\n\n change the value of an integer ICON of the line relay model in the designated relay slot of the from bus end of a specified branch.\n\nchange_rlmod_var\n\n change the value of a VAR of the line relay model in the designated relay slot of the from bus end of a specified branch.\n\nrlmod_pack\n\n remove entries that are marked as unused from the line relay model connection tables and the line relay model array allocation tables.\n\nrlmod_remove\n\n remove the line relay model in the designated relay slot of the from bus end of a specified branch.\n\nrlmod_status\n\n change the status of the line relay model in the designated relay slot of the from bus end of a specified branch.\n\nrlmod_unconnected\n\n list or remove from dynamics working memory those line relay models that are assigned to branches that are not present in the current power"
  },
  {
    "id": "chunk_27_part_1",
    "text": " flow working case (unconnected).\n\nrlmod_user\n\n list user-written line relay model definitions or to remove user-written line relay model definitions that are not assigned to any branches (unused) from the user model definition tables.\n\n--- Load Bus Data — .txt ---\n\nLoad Bus Data — \n\nLoad Bus Data¶\n\n\n\n\n\nalodbuschar\n\n return an array of character values for subsystem buses.\n\nalodbuscount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the load bus data family.\n\nalodbuscplx\n\n return an array of complex values for subsystem buses.\n\nalodbusint\n\n return an array of integer values for subsystem buses.\n\nalodbusreal\n\n return an array of real values for subsystem buses.\n\nalodbustypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the load bus data family (aLodBusInt, aLodBusReal, aLodBusCplx and a"
  },
  {
    "id": "chunk_27_part_2",
    "text": "LodBusChar).\n\n--- Load Component Models — .txt ---\n\nLoad Component Models — \n\nLoad Component Models¶\n\n\n\n\n\nadd_loadc_model\n\n add a load component model of a designated type to a specified load or subsystem.\n\nchange_ldmodc_cdesc\n\n change the value of a Model Description of a load component model at a specified load or subsystem).\n\nchange_ldmodc_chricn\n\n change the value of a CHRICN of a load component model at a specified load or subsystem).\n\nchange_ldmodc_con\n\n change the value of a CON of a load component model at a specified load or subsystem.\n\nchange_ldmodc_icon\n\n change the value of a ICON of a load component model at a specified load or subsystem.\n\nchange_ldmodc_var\n\n change the value of a VAR of a load component model at a specified load or subsystem.\n\n--- Load Data — .txt ---\n\nLoad Data — \n\nLoad Data¶\n\n\n\n\n\naloadchar\n\n return an array of character values for subsystem loads.\n\naloadcount\n\n return the number of array entries required to accommodate the data to be returned by the rem"
  },
  {
    "id": "chunk_28_part_0",
    "text": "aining members of the load data family.\n\naloadcplx\n\n return an array of complex values for subsystem loads.\n\naloadint\n\n return an array of integer values for subsystem loads.\n\naloadreal\n\n return an array of real values for subsystem loads.\n\naloadtypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the load data family (aLoadInt, aLoadReal, aLoadCplx and aLoadChar).\n\n--- Load Related Models — .txt ---\n\nLoad Related Models — \n\nLoad Related Models¶\n\n\n\n\n\nadd_load_model\n\n add a load related model of a designated type to a specified load or subsystem.\n\nchange_ldmod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of a load related model at a specified load or subsystem.\n\nchange_ldmod_con\n\n change the value of a CON of a load related model at a specified load or subsystem.\n\nchange_ldmod_data\n\n\n\nchange_ldmod_icon\n\n change th"
  },
  {
    "id": "chunk_28_part_1",
    "text": "e value of an integer ICON of a load related model at a specified load or subsystem.\n\nchange_ldmod_var\n\n change the value of a VAR of a load related model at a specified load or subsystem.\n\nldmod_pack\n\n remove entries that are marked as unused from the load model connection tables and the load model array allocation tables.\n\nldmod_remove\n\n remove a load related model of a designated type from a specified load or subsystem.\n\nldmod_status\n\n change the status of a load related model of a designated type for all subsystem loads at which it is applied.\n\nldmod_status2\n\n change the status of a load related model of a designated type at a specified load.\n\nldmod_unconnected\n\n list or remove from dynamics working memory those load related models that are assigned to loads that are not present in the current power flow working case (unconnected).\n\nldmod_user\n\n list user-written load model definitions or to remove user-written load model definitions that are not assigned to any loads (unused) from"
  },
  {
    "id": "chunk_28_part_2",
    "text": " the user model definition tables.\n\nldmodc_pack\n\n remove entries that are marked as unused from the load component model connection tables.\n\nldmodc_remove\n\n remove a load component related model of a designated type from a specified load or subsystem.\n\nldmodc_status\n\n change the status of a load related model of a designated type for all subsystem loads at which it is applied.\n\nldmodc_unconnected\n\n list or remove from dynamics working memory those load Component models that are assigned to loads that are not present in the current power flow working case (unconnected).\n\nldmodc_user\n\n list user-written load component model definitions or to remove user-written load model definitions that are not assigned to any loads (unused) from the user model definition tables.\n\n--- Machine Data — .txt ---\n\nMachine Data — \n\nMachine Data¶\n\n\n\n\n\namachchar\n\n return an array of character values for subsystem machines.\n\namachcount\n\n return the number of array entries required to accommodate the data to be"
  },
  {
    "id": "chunk_29_part_0",
    "text": "returned by the remaining members of the machine data family.\n\namachcplx\n\n return an array of complex values for subsystem machines.\n\namachint\n\n return an array of integer values for subsystem machines.\n\namachreal\n\n return an array of real values for subsystem machines.\n\namachtypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the machine data family (aMachInt, aMachReal, aMachCplx and aMachChar).\n\n--- Multi-Terminal Dc Line Converter Data — .txt ---\n\nMulti-Terminal Dc Line Converter Data — \n\nMulti-Terminal Dc Line Converter Data¶\n\n\n\n\n\namultitrmdcconvchar\n\n return an array of character values for subsystem multi-terminal dc line converters.\n\namultitrmdcconvcount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the multi-terminal dc line converter data family.\n\namultitrmdcconvcplx\n\n return"
  },
  {
    "id": "chunk_29_part_1",
    "text": " an array of complex values for subsystem multi-terminal dc line converters.\n\namultitrmdcconvint\n\n return an array of integer values for subsystem multi-terminal dc line converters.\n\namultitrmdcconvreal\n\n return an array of real values for subsystem multi-terminal dc line converters.\n\namultitrmdcconvtypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the two-terminal dc line converter data family (aMultiTrmDcConvInt, aMultiTrmDcConvReal, aMultiTrmDcConvCplx and aMultiTrmDcConvChar).\n\n--- Multi-Terminal Dc Line Data — .txt ---\n\nMulti-Terminal Dc Line Data — \n\nMulti-Terminal Dc Line Data¶\n\n\n\n\n\namultitrmdcchar\n\n return an array of character values for subsystem multi-terminal dc lines.\n\namultitrmdccount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the multi-terminal dc line data family.\n"
  },
  {
    "id": "chunk_29_part_2",
    "text": "\namultitrmdccplx\n\n return an array of complex values for subsystem multi-terminal dc lines.\n\namultitrmdcint\n\n return an array of integer values for subsystem multi-terminal dc lines.\n\namultitrmdcreal\n\n return an array of real values for subsystem multi-terminal dc lines.\n\namultitrmdctypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the multi-terminal dc line data family (aMultiTrmDcInt, aMultiTrmDcReal, aMultiTrmDcCplx and aMultiTrmDcChar).\n\n--- Multiple Element Data — .txt ---\n\nMultiple Element Data — \n\nMultiple Element Data¶\n\n\n\n\n\navoltagedroopchar\n\n return an array of character values for the voltage droop controls.\n\navoltagedroopcount\n\n return the number of voltage droop controls.\n\navoltagedroopint\n\n return an array of real values for the voltage droop controls.\n\navoltagedroopreal\n\n return an array of real values for the voltage droop controls."
  },
  {
    "id": "chunk_30_part_0",
    "text": "getmodellibraries\n\nReturn the list of libraries that are searched for dynamically (i.e.\n\ngetmodelprograms\n\nReturn the list dynamically (i.e.\n\ngettspfprofilebyelement\n\n return an array of character values for the Time Series Power Flow profiles by element name.\n\ngettspfprofilecountbyelement\n\n return the number of Time Series Power Flow profile by element name.\n\ngettspfprofiledata\n\n return an array of real values for Time Series Power Flow profile data.\n\ngettspfprofiledatabyset\n\n return an array of real values for Time Series Power Flow profile data for given curve set id.\n\ngettspfprofiledatacolumncount\n\n return the number of Time Series Power Flow profile data column count for a curve set.\n\ngettspfprofiledatacount\n\n return the number of Time Series Power Flow profile data count.\n\nlast_pf\n\nReturn last attempted network solution data.\n\nrxpath\n\n return buses from starting bus to ending bus with shortest electricity distance in terms of one of two options, impedance and number of buses.\n\ntr"
  },
  {
    "id": "chunk_30_part_1",
    "text": "eedat\n\n return Swing Bus and Island Data of Working Case Network.\n\n--- Node Breaker Data — .txt ---\n\nNode Breaker Data — \n\nNode Breaker Data¶\n\n\n\n\n\nfetch_adjvar_term_node\n\n obtain the terminal node to which an OPF adjustable bus shunt is connected to.\n\nfetch_indmachine_term_node\n\n obtain the terminal node to which a machine is connected to.\n\nfetch_load_term_node\n\n obtain the terminal node to which a load is connected to.\n\nfetch_machine_term_node\n\n obtain the terminal node to which a machine is connected to.\n\nfetch_shunt_term_node\n\n obtain the terminal node to which a shunt is connected to.\n\nfetch_sws_shunt_term_node\n\n\n\nfetch_sws_shunt_term_node_2\n\n obtain the terminal node to which a switched shunt is connected to.\n\nplant_bus_section_chng\n\n\n\nstation_2dc_bus_term_chng\n\n change the station two-term dc rectifier or inverter node terminal connection in the working case.\n\nstation_2dc_conv_term_chng\n\nThis API changes both node terminal connections of an existing two-term dc rectifier and inve"
  },
  {
    "id": "chunk_30_part_2",
    "text": "rter terminal data in the working case.\n\nstation_adjvar_term_chng\n\n change a substation OPF adjustable bus shunt node terminal connection in the working case.\n\nstation_branch_term_chng\n\n access existing station branch terminal data in the working case.\n\nstation_branch_term_move\n\n move one terminal node connection of a branch in the working case.\n\nstation_bus_purg\n\nThis API routine was first introduced in release 34.2.\n\nstation_chng\n\n modify the data of an existing substation data in the working case.\n\nstation_data\n\n modify the data of an existing substation data in the working case, or to add a new substation to the working case.\n\nstation_facts_bus_term_chng\n\n change the station FACTS device node terminal data connection in the working case.\n\nstation_facts_term_chng\n\nThis API changes the FACTS device sending and terminal end node terminal connections.\n\nstation_indmachine_term_chng\n\n change a substation induction machine node terminal connection in the working case.\n\nstation_load_term_c"
  },
  {
    "id": "chunk_31_part_0",
    "text": "hng\n\n access existing station load terminal data in the working case.\n\nstation_machine_term_chng\n\n change a substation machine terminal connection in the working case.\n\nstation_mtdc_bus_term_chng\n\n change the station multi-terminal converter node terminal connection in the working case.\n\nstation_mtdc_term_chng\n\nThis API changes both node terminal connections of an existing multi-terminal converter in the working case.\n\nstation_node_chng\n\n modify the data of an existing substation node in the working case.\n\nstation_node_data\n\n modify the data of an existing substation node in the working case, or to add a new substation node to the working case.\n\nstation_node_number\n\n change a node number in an existing substation.\n\nstation_node_purg\n\n delete a node in an existing substation.\n\nstation_number\n\n change a substation number for an existing substation.\n\nstation_purg\n\n delete a substation and all node-breaker components within that substation from the working case.\n\nstation_shunt_term_chng\n\n "
  },
  {
    "id": "chunk_31_part_1",
    "text": "change a substation fixed shunt terminal connection in the working case.\n\nstation_swd_chng\n\n modify the data of an existing station switching device in the working case.\n\nstation_swd_data\n\n modify the data of an existing substation switching device in the working case, or to add a new substation switching device to the working case.\n\nstation_swd_mbid\n\n modify the circuit identifier of an existing station switching device in the working case.\n\nstation_swd_move\n\n move the “to” node of an existing substation switching device in the working case.\n\nstation_swd_purg\n\n delete an existing substation switching device in the working case.\n\nstation_sws_shunt_term_chng\n\n\n\nstation_sws_shunt_term_chng_2\n\n change a substation switched shunt node terminal connection in the working case.\n\nstation_three_wnd_term_chng\n\n access existing substation three-winding transformer terminal data in the working case.\n\nstation_three_wnd_term_move\n\n move one terminal node connection of a three-winding transformer in "
  },
  {
    "id": "chunk_31_part_2",
    "text": "the working case.\n\nstation_vscdc_bus_term_chng\n\n change the vsc dc converter node terminal connection in the working case.\n\nstation_vscdc_conv_term_chng\n\nThis API changes both node terminal connections of an existing vsc dc converter in the working case.\n\nsystem_swd_chng\n\n modify the data of an existing system switching device in the working case, or to add a new system switching device to the working case.\n\nsystem_swd_data\n\n add or modify the data of an existing system switching device in the working case, or to add a new system switching device to the working case.\n\n--- Node Breaker Operation — .txt ---\n\nNode Breaker Operation — \n\nNode Breaker Operation¶\n\n\n\n\n\nconvert_section_to_bus\n\nUse this API routine to convert a bus section, one that had been automatically created within a substation due to open substation switching devices, into a main network bus.\n\nisolate2dclinebybreaker\n\n isolate a two-terminal DC line using system or substation breakers.\n\nisolate3wtbybreaker\n\n isolate a thre"
  },
  {
    "id": "chunk_32_part_0",
    "text": "e-winding transformer using system or substation breakers.\n\nisolatebusbybreaker\n\n isolate a bus using system or substation breakers.\n\nisolatefactsbybreaker\n\n isolate a FACTS device using system or substation breakers.\n\nisolateindmachinebybreaker\n\n isolate an induction machine using system or substation breakers.\n\nisolatelinebybreaker\n\n isolate a two-winding transformer or non-transformer line using system or substation breakers.\n\nisolateloadbybreaker\n\n isolate a load using system or substation breakers.\n\nisolatemachinebybreaker\n\n isolate a machine using system or substation breakers.\n\nisolatemslinebybreaker\n\n isolate a multi-section line using system or substation breakers.\n\nisolatemtdclinebybreaker\n\n isolate a multi-terminal dc line using system or substation breakers.\n\nisolatenodebybreaker\n\n isolate a substation node using system or substation breakers.\n\nisolateshuntbybreaker\n\n isolate a fixed shunt using system or substation breakers.\n\nisolateswdbybreaker\n\n isolate a substation swit"
  },
  {
    "id": "chunk_32_part_1",
    "text": "ching device using system or substation breakers.\n\nisolateswshuntbybreaker\n\n\n\nisolateswshuntbybreaker_2\n\n isolate a switched shunt using system or substation breakers.\n\nisolatevscdclinebybreaker\n\n isolate a VSC DC line using system or substation breakers.\n\nrestorestatesfromisolate\n\n restore the network working case back to its original state; the state prior to all “Isolate By Breaker” actions that have been taken.\n\nstation_ampout\n\n print current within a substation.\n\nstation_build_config\n\n automatically build a general layout configuration for a bus being built within a substation.\n\nstation_list\n\n list components in a substation.\n\nstation_pout\n\n\n\nstation_pout_2\n\n print power flows within a substation.\n\nstation_tree\n\nUse this API routine to check the node breaker model and the consistency between node breaker and bus branch models.\n\n--- Non-Engineering — .txt ---\n\nNon-Engineering — \n\nNon-Engineering¶\n\n\n\n\n\nalert\n\n send output to the alert device.\n\nappendrecording\n\nStart recording progra"
  },
  {
    "id": "chunk_32_part_2",
    "text": "m operation at end of specified file.\n\nbeginreport\n\n create a new report tab in the GUI.\n\nclearalertoutput\n\nClear the Alerts/Warnings tab of the output bar in the GUI\n\nclearprogressoutput\n\nClear the Progress tab of the output bar in the GUI\n\nfilein\n\nGet input from file (Fortran unit number).\n\ngetbatdefaults\n\nRetrieve “no input” value for integers and reals.\n\ngetdefaultchar\n\nRetrieve “no input” value for characters (i.e., strings) other than filenames.\n\ngetdefaultint\n\nRetrieve “no input” value for integers.\n\ngetdefaultreal\n\nRetrieve “no input” value for reals (floats).\n\ngetloadedmodules\n\nget list of all modules currently loaded\n\ngetmodfunclist\n\nGet list if external callable methods given a module name.\n\nioflush\n\nForce all files in PSSE to flush buffers to disk, if possible.\n\nlaunch_program\n\nThis API routine was first introduced in release 34.1.\n\npagereport\n\n place a report separator on the active report tab of the GUI.\n\npauserecording\n\nPause or resume recording program operation.\n\nprogr"
  },
  {
    "id": "chunk_33_part_0",
    "text": "ess\n\nSend output to progress device.\n\nprompt\n\nSend output to prompt device.\n\npsseinit\n\nInitialize PSSE.\n\npsseversion\n\nGet PSSE version information.\n\nrefreshgui\n\nRefresh the graphical user interface.\n\nreport\n\nSend output to report device.\n\nruniplanfile\n\nExecute an IPLAN program.\n\nrunrspnsfile\n\nRun a response file.\n\nshowloadedlibraries\n\n\n\nshowloadedmodules\n\n\n\nstartrecording\n\nStart recording program operation.\n\nstoprecording\n\nStop recording program operation.\n\nt_alert_output\n\n specify a “T“‘d alert device, i.e. a destination for a copy of everything sent to the alert device.\n\nt_progress_output\n\n specify a “T“‘d progress device, i.e. a destination for a copy of everything sent to the progress device.\n\nt_prompt_output\n\n specify a “T“‘d prompt device, i.e. a destination for a copy of everything sent to the prompt device.\n\nt_report_output\n\n specify a “T“‘d report device, i.e. a destination for a copy of everything sent to the report device.\n\nuserin\n\nGet input from interactive device.\n\n--- Opt"
  },
  {
    "id": "chunk_33_part_1",
    "text": "imal Power Flow Data — .txt ---\n\nOptimal Power Flow Data — \n\nOptimal Power Flow Data¶\n\n\n\n\n\nnewopf\n\n initialize the working case with default OPF data for all bus oriented data records.\n\nopf_adjbrx_indv\n\n add an individual adjustable branch reactance data record to the working case.\n\nopf_adjbrx_subsys\n\n add or modify all OPF branch reactance data records in a specified subsystem of the working case.\n\nopf_adjload_tbl\n\n add an individual adjustable bus load table record to the working case.\n\nopf_adjvar_indv\n\n\n\nopf_adjvar_indv_2\n\n add an individual OPF adjustable bus shunt data record to the working case.\n\nopf_adjvar_subsys\n\n add or modify all OPF adjustable bus shunt records in a specified subsystem of the working case.\n\nopf_apdsp_tbl\n\n add an individual active power dispatch table record to the working case.\n\nopf_brflw_3wt_indv\n\n add a flow constraint record for an individual winding of a three-winding transformer in the working case.\n\nopf_brflw_brn_indv\n\n add an individual branch or two"
  },
  {
    "id": "chunk_33_part_2",
    "text": "-winding transformer flow constraint record to the working case.\n\nopf_brflw_subsys\n\n add or modify all branch flow data records in a specified subsystem of the working case.\n\nopf_bus_indv\n\n\n\nopf_bus_indv_2\n\n add OPF bus voltage magnitude data to the working case.\n\nopf_bus_subsys\n\n add OPF bus attribute data for all records in a specified subsystem of the working case.\n\nopf_change_3wt_flow_id\n\n change the identifier of a flow constraint record for an individual winding of a three-winding transformer in the working case.\n\nopf_change_adjvar_id\n\n\n\nopf_change_brn_flow_id\n\n change the identifier of a branch or two-winding transformer OPF flow constraint record in the working case.\n\nopf_csttbl_lin\n\n add a linear cost curve table record to the working case.\n\nopf_csttbl_poly\n\n add a polynomial and exponential cost curve table record to the working case.\n\nopf_csttbl_quad\n\n add a quadratic cost curve table record to the working case.\n\nopf_gen_rcap_indv\n\n add an individual generation reactive capa"
  },
  {
    "id": "chunk_34_part_0",
    "text": "bility data record to the working case.\n\nopf_gen_rcap_subsys\n\n add or modify all OPF generator reactive capability records in a specified subsystem of the working case.\n\nopf_gendsp_indv\n\n add generator dispatch data to an individual record in the working case.\n\nopf_gendsp_subsys\n\n add OPF generator dispatch data to all records in a specified subsystem of the working case.\n\nopf_genrsv_indv\n\n add an individual generator reserve data record to the working case.\n\nopf_genrsv_subsys\n\n add or modify all OPF generator reserve records in a specified subsystem of the working case.\n\nopf_intflw_3wt\n\n add a participating three-winding transformer winding to a specified interface flow constraint in the working case.\n\nopf_intflw_brn\n\n add a participating branch to a specified interface flow constraint in the working case.\n\nopf_intflw_main\n\n add an interface flow constraint record to the working case.\n\nopf_intflw_reset\n\n remove all interface branches associated with a particular interface flow constra"
  },
  {
    "id": "chunk_34_part_1",
    "text": "int in the working case.\n\nopf_lnceqn_adjload\n\n add a participating adjustable bus load variable to a specified linear constraint dependency equation in the working case.\n\nopf_lnceqn_adjvar\n\n add a participating adjustable bus shunt variable to a specified linear constraint dependency equation in the working case.\n\nopf_lnceqn_brflow\n\n add a participating branch flow variable to a specified linear constraint dependency equation in the working case.\n\nopf_lnceqn_intflow\n\n add a participating interface flow constraint variable to a specified linear constraint dependency equation in the working case.\n\nopf_lnceqn_main\n\n add a linear constraint dependency record to the working case.\n\nopf_lnceqn_pgen\n\n add a participating active power dispatch variable to a specified linear constraint dependency equation in the working case.\n\nopf_lnceqn_qgen\n\n add a participating reactive power dispatch variable of a specified linear constraint dependency equation in the working case.\n\nopf_lnceqn_reset\n\n remove"
  },
  {
    "id": "chunk_34_part_2",
    "text": " all participating variables from a particular OPF linear constraint dependency equation in the working case.\n\nopf_lnceqn_swshunt\n\n\n\nopf_lnceqn_swshunt_2\n\n add a participating switched shunt variable to a specified linear constraint dependency equation in the working case.\n\nopf_lnceqn_tran\n\n add a participating transformer control variable to a specified linear constraint dependency equation in the working case.\n\nopf_lnceqn_vang\n\n\n\nopf_lnceqn_vang_2\n\n add a participating bus voltage angle variable to a specified linear constraint dependency equation in the working case.\n\nopf_lnceqn_vmag\n\n\n\nopf_lnceqn_vmag_2\n\n add a participating bus voltage magnitude variable to a specified linear constraint dependency equation in the working case.\n\nopf_load_indv\n\n add an individual OPF bus load data record to the working case.\n\nopf_load_subsys\n\n add or modify all OPF bus load data records in a specified subsystem of the working case.\n\nopf_perrsv_gen\n\n add a participating generation reserve unit to a p"
  },
  {
    "id": "chunk_35_part_0",
    "text": "reviously defined period reserve constraint in the working case.\n\nopf_perrsv_main\n\n add a period reserve constraint record to the working case.\n\nopf_perrsv_reset\n\n remove all generation reserve units associated with a particular period reserve constraint in the working case.\n\npurge_all_opf_data\n\n purge and re-initialize all OPF data records in the working case.\n\npurge_opf_adjbrx_indv\n\n purge an individual adjustable branch reactance data record from the working case.\n\npurge_opf_adjbrx_subsys\n\n purge all OPF branch reactance data records from a specified subsystem of the working case.\n\npurge_opf_adjload_tbl\n\n purge an individual adjustable bus load table from the working case.\n\npurge_opf_adjvar_indv\n\n\n\npurge_opf_adjvar_indv_3\n\n purge an individual OPF adjustable bus shunt data record from the working case.\n\npurge_opf_adjvar_subsys\n\n purge all OPF adjustable bus shunt records from a specified subsystem of the working case.\n\npurge_opf_apdsp_tbl\n\n purge an individual active power dispatch "
  },
  {
    "id": "chunk_35_part_1",
    "text": "table record from the working case.\n\npurge_opf_brflw_3wt\n\n purge an individual flow constraint record of a three-winding transformer from the working case.\n\npurge_opf_brflw_brn\n\n purge an individual branch or two-winding transformer flow constraint record from the working case.\n\npurge_opf_brflw_subsys\n\n purge all branch flow data records in a specified subsystem in the working case.\n\npurge_opf_bus_indv\n\n\n\npurge_opf_bus_indv_3\n\n purge (re-initialize) OPF bus voltage magnitude data for an individual bus or bus section record in the working case.\n\npurge_opf_bus_subsys\n\n purge (re-initialize) OPF bus attribute data for all records in a specified subsystem of the working case.\n\npurge_opf_csttbl_lin\n\n purge an optimal power flow linear cost curve record from the working case.\n\npurge_opf_csttbl_poly\n\n purge an optimal power flow polynomial and exponential cost curve record from the working case.\n\npurge_opf_csttbl_quad\n\n purge an optimal power flow quadratic cost curve record from the working "
  },
  {
    "id": "chunk_35_part_2",
    "text": "case.\n\npurge_opf_gen_rcap_indv\n\n purge an individual OPF generation reactive capability data record from the working case.\n\npurge_opf_gen_rcap_subsys\n\n purge all OPF generator reactive capability records in a specified subsystem from the working case.\n\npurge_opf_gendsp_indv\n\n purge generator dispatch data for an individual record from the working case.\n\npurge_opf_gendsp_subsys\n\n purge generator dispatch data for all records from a specified subsystem of the working case.\n\npurge_opf_genrsv_indv\n\n purge an individual optimal power flow generator reserve data record from the working case.\n\npurge_opf_genrsv_subsys\n\n purge all OPF generator reserve records in a specified subsystem from the working case.\n\npurge_opf_intflw\n\n purge an OPF interface flow constraint record, including all of its participating branches, from the working case.\n\npurge_opf_intflw_3wt\n\n remove a participating three-winding transformer winding from a specified OPF interface flow constraint in the working case.\n\npurge_o"
  },
  {
    "id": "chunk_36_part_0",
    "text": "pf_intflw_brn\n\n remove a participating branch from a specified OPF interface flow constraint in the working case.\n\npurge_opf_lnceqn\n\n purge an OPF linear constraint dependency record, including all of its participating variables, from the working case.\n\npurge_opf_lnceqn_adjload\n\n remove a participating adjustable bus load variable from a specified OPF linear constraint dependency equation in the working case.\n\npurge_opf_lnceqn_adjvar\n\n remove a participating adjustable bus shunt variable from a specified OPF linear constraint dependency equation in the working case.\n\npurge_opf_lnceqn_brflow\n\n remove a participating branch flow variable from a specified OPF linear constraint dependency equation in the working case.\n\npurge_opf_lnceqn_intflow\n\n remove a participating interface flow constraint variable from a specified OPF linear constraint dependency equation in the working case.\n\npurge_opf_lnceqn_pgen\n\n remove a participating active power dispatch variable from a specified OPF linear con"
  },
  {
    "id": "chunk_36_part_1",
    "text": "straint dependency equation in the working case.\n\npurge_opf_lnceqn_qgen\n\n remove a participating reactive power dispatch variable from a specified OPF linear constraint dependency equation in the working case.\n\npurge_opf_lnceqn_swshunt\n\n\n\npurge_opf_lnceqn_swshunt_2\n\n remove a participating switched shunt variable from a specified OPF linear constraint dependency equation in the working case.\n\npurge_opf_lnceqn_tran\n\n remove a participating transformer control variable from a specified OPF linear constraint dependency equation in the working case.\n\npurge_opf_lnceqn_vang\n\n\n\npurge_opf_lnceqn_vang_2\n\n remove a participating bus voltage angle variable from a specified OPF linear constraint dependency equation in the working case.\n\npurge_opf_lnceqn_vmag\n\n\n\npurge_opf_lnceqn_vmag_2\n\n remove a participating bus voltage magnitude variable from a specified OPF linear constraint dependency equation in the working case.\n\npurge_opf_load_indv\n\n purge (re-initialize) an individual OPF bus load data rec"
  },
  {
    "id": "chunk_36_part_2",
    "text": "ord from the working case.\n\npurge_opf_load_subsys\n\n purge (re-initialize) all OPF bus load data records in a specified subsystem of the working case.\n\npurge_opf_perrsv\n\n purge an OPF period reserve constraint record and its association with participating reserve units from the working case.\n\npurge_opf_perrsv_gen\n\n remove a participating period reserve unit from a specified OPF period reserve constraint.\n\n--- Optimal Power Flow Operation — .txt ---\n\nOptimal Power Flow Operation — \n\nOptimal Power Flow Operation¶\n\n\n\n\n\nadd_details_to_opf_log\n\n specify or return the value of the OPF solution option to add details of the sensitivity values and Lagrange multipliers to the OPF Output Log file.\n\napply_alternate_step_size\n\n specify or return the value of the OPF solution option for applying an alternate lambda mismatch step size.\n\napply_automatic_scaling\n\n specify or return the value of the OPF solution option to apply automatic scaling of the objective coefficients and derivatives to improve co"
  },
  {
    "id": "chunk_37_part_0",
    "text": "nvergence of the OPF solution.\n\nbad_iter_coarse_limit\n\n specify or return the number of bad iterations allowed when the barrier coefficient is greater than 011 (mu greater then -2) before the solution progress is terminated as being infeasible.\n\nbad_iter_fine_limit\n\n specify or return the the bad iteration limit when the barrier coefficient is less than, or equal to 011 (mu less than or equal to -2) before the solution progress is terminated as being infeasible.\n\nclamp_nonoptimized_gens\n\n specify or return the value of the OPF solution option to apply the clamp equation to non-optimized generators.\n\nconstrain_interface_flows\n\n specify or return the value of the OPF option to constrain interface flows.\n\nfinal_opf_barrier_coeff\n\n specify or return the value of the final coefficient value that the barrier function is attempting to attain.\n\nimport_ecdi\n\n import data from an Economics Dispatch Data File, as prepared for use in activity ECDI, into the OPF working data.\n\ninitial_opf_barrier_c"
  },
  {
    "id": "chunk_37_part_1",
    "text": "oeff\n\n specify or return the value of the initial OPF barrier coefficient.\n\ninterface_flow_cost_coeff\n\n specify or return the value of the coefficient for the interface flow objective.\n\nlsto\n\n list OPF working case data in a form suitable for data documentation.\n\nminimize_adj_bus_shunts\n\n specify or return the value of the OPF minimize adjustable bus shunts (var compensation) objective function option.\n\nminimize_fuel_cost\n\n specify or return the value of the OPF minimize fuel cost objective option.\n\nminimize_interface_flows\n\n specify or return the value of the OPF minimize interface flows objective option.\n\nminimize_load_adjustments\n\n specify or return the value of the OPF minimize adjustable bus load objective option.\n\nminimize_p_losses\n\n specify or return the value of the OPF minimize active power loss objective option.\n\nminimize_p_slack\n\n specify or return the value of the OPF minimize active power slack objective option.\n\nminimize_q_losses\n\n specify or return the value of the OPF m"
  },
  {
    "id": "chunk_37_part_2",
    "text": "inimize reactive power loss objective option.\n\nminimize_q_slack\n\n specify or return the value of the OPF minimize reactive power slack objective option.\n\nminimize_reactive_reserve\n\n specify or return the value of the OPF minimize reactive reserve objective option.\n\nminimize_series_comp\n\n specify or return the value of the OPF minimize series compensation (adjustable branch reactance) objective option.\n\nnopf\n\n run the Optimal Power Flow solution.\n\nopen_bus_voltage_limits\n\n specify or return the value of the OPF solution option to automatically adjust bus voltage limits, making them more open for initial feasibility.\n\nopf_barrier_step_length\n\n specify or return the value of the barrier function step length setting.\n\nopf_clamp_decay_factor\n\n specify or return the value of the clamp equation decay factor.\n\nopf_final_clamp_tol\n\n specify or return the value of the final clamp tolerance.\n\nopf_fix_all_generators\n\n specify or return the value of the OPF option to treat all generators as nonopti"
  },
  {
    "id": "chunk_38_part_0",
    "text": "mized (fixed).\n\nopf_fix_phase_shifters\n\n specify or return the value of the OPF option to fix transformer phase shift angle settings.\n\nopf_fix_switched_shunts\n\n specify or return the value of the OPF option to fix switched shunt settings.\n\nopf_fix_tap_ratios\n\n specify or return the value of the OPF option to fix transformer tap ratio settings.\n\nopf_fixed_voltage_penalty\n\n specify or return the value of the penalty for fixed voltage excursions.\n\nopf_initial_clamp_tol\n\n specify or return the value of the initial clamp tolerance.\n\nopf_interior_shift_factor\n\n specify or return the value of the interior shift factor multiplier.\n\nopf_lambda_tolerance\n\n specify or return the value of the Lagrange multiplier blow-up tolerance during an optimal power flow solution.\n\nopf_lf_control_penalty\n\n specify or return the value of the quadratic penalty for loadflow controls.\n\nopf_max_tap_ratio_step\n\n specify or return the value of the maximum transformer tap ratio step.\n\nopf_min_tap_ratio_step\n\n set or r"
  },
  {
    "id": "chunk_38_part_1",
    "text": "eturn the value of the minimum transformer tap ratio step.\n\nopf_regulate_area_int\n\n set or return the value of the OPF option to regulate area interchange.\n\nopf_round_switched_shunts\n\n set or return the value of the OPF solution option to discretize switched shunts.\n\nopf_round_tap_ratios\n\n set or return the value of the OPF solution option to round transformer tap ratio settings.\n\nopf_scale_qgen_limits\n\n set or return the value of the OPF option to scale reactive generation limits in the clamped constraint equation.\n\nopf_step_length_tolerance\n\n set or return the value of the OPF minimum barrier step length tolerance.\n\nopf_use_generator_vsched\n\n set or return the value of the OPF option to employ the generator scheduled voltage.\n\nopto\n\nPlease use the individual OPF option setting API’s described in this section.\n\np_losses_cost_coeff\n\n set or return the value of the coefficient for the active power loss objective (OPF Solution Options).\n\nproduce_opf_log_file\n\n set or return the value of "
  },
  {
    "id": "chunk_38_part_2",
    "text": "the OPF solution option to produce an OPF solution log file, and if so, the name of the log file.\n\nq_losses_cost_coeff\n\n set or return the value of the coefficient for the reactive power loss objective.\n\nreactive_resv_cost_coeff\n\n set or return the value of the coefficient for the reactive reserve objective.\n\nropf\n\n read an Optimal Power Flow Raw Data File.\n\nrwop\n\n replicate the OPF data contained in the working case in the form of an Optimal Power Flow Data File.\n\nset_opf_report_subsystem\n\n define the subsystem to be used when producing the opf output report.\n\nuse_dual_criteria\n\n set or return the value of the OPF solution option to apply the power flow mismatch tolerance to the dual variable problem.\n\nuse_emergency_flow_limits\n\n set or return the value of the OPF solution option to impose the emergency flow limits instead of the normal flow limits.\n\nuse_emergency_volt_limits\n\n set or return the value of the OPF solution option to impose the emergency bus voltage limits instead of the"
  },
  {
    "id": "chunk_39_part_0",
    "text": "normal bus voltage limits.\n\nwrite_opf_options_file\n\n save the PSSE OPF solution option settings to the PSSOPF.OPT file.\n\n--- Owner Data — .txt ---\n\nOwner Data — \n\nOwner Data¶\n\n\n\n\n\naownerchar\n\n return an array of character values for subsystem owners.\n\naownercount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the owner data family.\n\naownercplx\n\n return an array of complex values for subsystem owners.\n\naownerint\n\n return an array of integer values for subsystem owners.\n\naownerreal\n\n return an array of real values for subsystem owners.\n\naownertypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the owner data family (aOwnerInt, aOwnerReal, aOwnerCplx and aOwnerChar).\n\n--- Owner Subsystems — .txt ---\n\nOwner Subsystems — \n\nOwner Subsystems¶\n\n\n\n\n\nosys\n\n define an owner subsystem.\n\nosysdef\n\n s"
  },
  {
    "id": "chunk_39_part_1",
    "text": "et the definition of an owner subsystem.\n\nosysinit\n\n initialize or re-initialize an owner subsystem.\n\n--- Plant Bus Data — .txt ---\n\nPlant Bus Data — \n\nPlant Bus Data¶\n\n\n\n\n\nagenbuschar\n\n return an array of character values for subsystem buses.\n\nagenbuscount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the plant bus data family.\n\nagenbuscplx\n\n return an array of complex values for subsystem buses.\n\nagenbusint\n\n return an array of integer values for subsystem buses.\n\nagenbusreal\n\n return an array of real values for subsystem buses.\n\nagenbustypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the plant bus data family (aGenBusInt, aGenBusReal, aGenBusCplx and aGenBusChar).\n\n--- Plant Related Models — .txt ---\n\nPlant Related Models — \n\nPlant Related Models¶\n\n\n\n\n\nadd_plant_model\n\n add a pla"
  },
  {
    "id": "chunk_39_part_2",
    "text": "nt related model of a designated type to a specified machine.\n\nchange_plmod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of a designated plant related model at a specified machine.\n\nchange_plmod_con\n\n change the value of a CON of a designated plant related model at a specified machine.\n\nchange_plmod_data\n\n\n\nchange_plmod_icon\n\n change the value of an integer ICON of a designated plant related model at a specified machine.\n\nchange_plmod_var\n\n change the value of a VAR of a designated plant related model at a specified machine.\n\ngmb_add_plant_model\n\n add a plant related GMB model to a specified machine.\n\nplmod_consistency\n\n check consistency among the plant related models referenced at each machine.\n\nplmod_pack\n\n remove entries that are marked as unused from the plant model connection tables and the plant model array allocation tables.\n\nplmod_remove\n\n remove a plant related model of a designated type from a specified machine.\n\nplmod_status\n\n change"
  },
  {
    "id": "chunk_40_part_0",
    "text": "the status of a plant related model of a designated type at a specified machine.\n\nplmod_unconnected\n\n list or remove from dynamics working memory those plant related models that are assigned to machines that are not present in the current power flow working case (unconnected).\n\nplmod_user\n\n list user-written plant model definitions or to remove user-written plant model definitions that are not assigned to any machines (unused) from the user model definition tables.\n\n--- Power Flow Data — .txt ---\n\nPower Flow Data — \n\nPower Flow Data¶\n\n\n\n\n\narea_data\n\n modify area data in the working case (see PSSE Program Operation Manual, Areas, Zones and Owners).\n\nbranch_chng\n\n\n\nbranch_chng_3\n\nUse this API routine to modify the data of an existing non-transformer branch in the working case (see PSSE Program Operation Manual, Non-Transformer Branch Data).\n\nbranch_data\n\n\n\nbranch_data_3\n\n modify the data of an existing non-transformer branch in the working case or to add a new non-transformer branch to t"
  },
  {
    "id": "chunk_40_part_1",
    "text": "he working case (see PSSE Program Operation Manual, Non- Transformer Branch Data).\n\nbus_chng_3\n\nUse this API routine to modify the data of an existing bus in the working case (see PSSE Program Operation Manual, Bus Data).\n\nbus_chng_4\n\nUse this API routine to modify the data of an existing bus in the working case (see PSSE Program Operation Manual, Bus Data).\n\nbus_data\n\n\n\nbus_data_2\n\n\n\nbus_data_3\n\n\n\nbus_data_4\n\nUse this API routine to modify the data of an existing bus in the working case, or to add a new bus to the working case (see PSSE Program Operation Manual, Bus Data).\n\nbus_number\n\n change the bus number of an existing bus in the working case.\n\ncase_title_data\n\n change the two line case title in the working case (see PSSE Program Operation Manual, Case Identification Data).\n\ncasolution_parameters\n\n modify the contingency analysis solution parameters.\n\ncasolution_parameters_2\n\n modify the contingency analysis solution parameters.\n\ncasolution_parameters_3\n\n modify the contingency an"
  },
  {
    "id": "chunk_40_part_2",
    "text": "alysis solution parameters.\n\nextr\n\n purge specified buses and all branches connected to them from the working case (activity EXTR).\n\nfacts_chng_2\n\n\n\nfacts_chng_3\n\nUse this API routine to modify the data of an existing FACTS device in the working case (see PSSE Program Operation Manual, FACTS Device Data).\n\nfacts_data\n\n\n\nfacts_data_2\n\n\n\nfacts_data_3\n\n modify the data of an existing FACTS device in the working case, or to add a new FACTS device to the working case (see PSSE Program Operation Manual, FACTS Device Data).\n\ngne_chng\n\nUse this API routine to modify the data of an existing GNE device in the working case (see PSSE Program Operation Manual, GNE Device Data).\n\ngne_data\n\nUse this API routine to run the GNE device data specification function.\n\nimpedance_correction_data\n\n\n\nimpedance_correction_data_3\n\n modify the data of an existing transformer impedance correction table in the working case or to add a new transformer impedance correction table to the working case (see PSSE Program"
  },
  {
    "id": "chunk_41_part_0",
    "text": "Operation Manual, Transformer Impedance Correction Table Data).\n\ninduction_machine_chng\n\nUse this API routine to modify the data of an existing induction machine in the working case (see PSSE Program Operation Manual, Induction Machine Data).\n\ninduction_machine_data\n\nUse this API routine to modify the data of an existing induction machine in the working case, or to add a new induction machine to the working case (see PSSE Program Operation Manual, Induction Machine Data).\n\nload_chng_4\n\n\n\nload_chng_5\n\n\n\nload_chng_6\n\nUse this API routine to modify the data of an existing load in the working case (see PSSE Program Operation Manual, Load Data).\n\nload_data\n\n\n\nload_data_3\n\n\n\nload_data_4\n\n\n\nload_data_5\n\n\n\nload_data_6\n\nUse this API routine to modify the data of an existing load in the working case, or to add a new load to the working case (see PSSE Program Operation Manual, Load Data).\n\nlong_title_data\n\n change the sixteen line long title in the working case (see PSSE Program Operation Manual,"
  },
  {
    "id": "chunk_41_part_1",
    "text": " activity CHTI).\n\nmachine_cap_curve_chng\n\nUse this API routine to modify the capability curve data of an existing machine in the working case.\n\nmachine_cap_curve_data\n\nUse this API routine to specify or modify the capability curve data of an existing machine in the working case.\n\nmachine_chng_2\n\n\n\nmachine_chng_3\n\nUse this API routine to modify the data of an existing machine in the working case (see PSSE Program Operation Manual, Plant Data).\n\nmachine_chng_4\n\nUse this API routine to modify the data of an existing machine in the working case (see PSSE Program Operation Manual, Plant Data).\n\nmachine_data\n\n\n\nmachine_data_2\n\n\n\nmachine_data_3\n\n modify the data of an existing machine in the working case, or to add a new machine to a plant bus in the working case (see PSSE Program Operation Manual, Plant Data).\n\nmachine_data_4\n\n modify the data of an existing machine in the working case, or to add a new machine to a plant bus in the working case (see PSSE Program Operation Manual, Plant Data)"
  },
  {
    "id": "chunk_41_part_2",
    "text": ".\n\nmbid2dc\n\n change the name of the specified two-terminal dc line.\n\nmbid3wnd\n\n change the identifier of the specified three-winding transformer.\n\nmbidatrn\n\n change the identifier of the specified inter-area transfer.\n\nmbidbrn\n\n change the identifier of the specified non-transformer branch or two-winding transformer.\n\nmbidfacts\n\n change the name of the specified FACTS device.\n\nmbidgne\n\nUse this API routine to change the GNE device name of the specified GNE device.\n\nmbidindmac\n\nUse this API routine to change the identifier of the specified induction machine.\n\nmbidload\n\n change the identifier of the specified load.\n\nmbidmac\n\n change the identifier of the specified machine.\n\nmbidmdc\n\n change the name of the specified multi-terminal dc line.\n\nmbidmsl\n\n change the identifier of the specified multi-section line.\n\nmbidshunt\n\n change the identifier of the specified fixed bus shunt.\n\nmbidswshunt\n\n change the identifier of the specified switched bus shunt.\n\nmbidvd\n\n change the voltage droop con"
  },
  {
    "id": "chunk_42_part_0",
    "text": "trol name of the specified voltage droop control in the working case.\n\nmbidvsc\n\n change the VSC dc line name of the specified VSC dc line.\n\nmulti_section_line_data\n\n modify the definition of an existing multi-section line grouping in the working case or to add a new multi-section line grouping to the working case (see PSSE Program Operation Manual, Multi-Section Line Grouping Data).\n\nmulti_section_line_edit\n\n modify the status and/or metered end designation of an existing multi-section line grouping in the working case (see PSSE Program Operation Manual, Multi-Section Line Grouping Data).\n\nmulti_term_dc_bus_data\n\n modify the data of a dc bus of an existing multi-terminal dc line in the working case or to add a new dc bus to a multi-terminal dc line in the working case (see PSSE Program Operation Manual, Multi-Terminal DC Transmission Line Data).\n\nmulti_term_dc_convr_data\n\n modify the data of a dc converter of an existing multi-terminal dc line in the working case or to add a new conver"
  },
  {
    "id": "chunk_42_part_1",
    "text": "ter to a multi-terminal dc line in the working case (see PSSE Program Operation Manual, Multi-Terminal DC Transmission Line Data).\n\nmulti_term_dc_line_chng\n\nUse this API routine to modify the control mode and mode switch voltage of an existing multi- terminal dc line in the working case (see PSSE Program Operation Manual, Multi-Terminal DC Transmission Line Data).\n\nmulti_term_dc_line_data\n\n modify the control mode and mode switch voltage of an existing multi-terminal dc line in the working case or to add a new multi-terminal dc line to the working case (see PSSE Program Operation Manual, Multi-Terminal DC Transmission Line Data).\n\nmulti_term_dc_link_data\n\n modify the data of a dc link of an existing multi-terminal dc line in the working case or to add a new dc link to a multi-terminal dc line in the working case (see PSSE Program Operation Manual, Multi-Terminal DC Transmission Line Data).\n\nowner_data\n\n modify owner data in the working case (see PSSE Program Operation Manual, Interarea"
  },
  {
    "id": "chunk_42_part_2",
    "text": " Transfer Data).\n\npbus_add_mod\n\n add or modify transaction event participating bus data.\n\npbus_delete\n\n remove a bus from the set of buses that are participating in a transaction event.\n\nplant_chng\n\n\n\nplant_chng_3\n\n\n\nplant_chng_4\n\nUse this API routine to modify the data of an existing plant that is part of a substation in the working case.\n\nplant_data\n\n\n\nplant_data_3\n\n\n\nplant_data_4\n\n modify the data of an existing plant in the working case, or to add a new plant to the working case (see PSSE Program Operation Manual, Fixed Bus Shunt Data).\n\npurg\n\nUse this API routine to delete specified outaged equipment items from the working case.\n\npurg2dc\n\n delete the specified two-terminal dc line from the working case.\n\npurg3wnd\n\n delete the specified three-winding transformer from the working case.\n\npurg_voltage_droop\n\n delete an existing voltage droop control from the working case.\n\npurgarea\n\n delete areas with no equipment assigned to them from the working case.\n\npurgatrn\n\n delete the specifie"
  },
  {
    "id": "chunk_43_part_0",
    "text": "d inter-area transfer from the working case.\n\npurgbrn\n\n delete the specified non-transformer branch or two-winding transformer from the working case.\n\npurgcapcurve\n\n delete the specified machine’s capability curve from the working case.\n\npurge_multi_term_dc_bus\n\n delete the specified dc bus from the specified multi-terminal dc line in the working case.\n\npurge_multi_term_dc_convr\n\n delete the specified converter from the specified multi-terminal dc line in the working case.\n\npurge_multi_term_dc_link\n\n delete the specified dc link from the specified multi-terminal dc line in the working case.\n\npurgfacts\n\n delete the specified FACTS device from the working case.\n\npurggne\n\nUse this API routine to delete the specified GNE device from the working case.\n\npurgindmac\n\nUse this API routine to delete the specified induction machine from the working case.\n\npurgindmacs\n\nUse this API routine to delete all induction machines from the specified bus in the working case.\n\npurgload\n\n delete the specified"
  },
  {
    "id": "chunk_43_part_1",
    "text": " load from the working case.\n\npurgloads\n\n delete all loads from the specified bus in the working case.\n\npurgmac\n\n delete the specified machine from the working case.\n\npurgmdc\n\n delete the specified multi-terminal dc line from the working case.\n\npurgmsl\n\n delete the specified multi-section line grouping from the working case.\n\npurgmut\n\n delete the specified zero sequence mutual coupling from the working case.\n\npurgowner\n\n delete owners with no equipment assigned to them from the working case.\n\npurgplnt\n\n delete the plant and machine data at the specified bus from the working case.\n\npurgshunt\n\n delete the specified fixed bus shunt from the working case.\n\npurgshunts\n\n delete all fixed shunts from the specified bus in the working case.\n\npurgsws\n\n delete all switched shunts from the specified bus in the working case.\n\npurgswshunt\n\n delete the specified switched bus shunt from the working case.\n\npurgvsc\n\n delete the specified VSC dc line from the working case.\n\npurgzone\n\n delete zones with n"
  },
  {
    "id": "chunk_43_part_2",
    "text": "o equipment assigned to them from the working case.\n\nratingsettextdata\n\n change the column and descriptions for a particular rating set used in reporting.\n\nshunt_chng\n\nUse this API routine to modify the data of an existing fixed bus shunt in the working case (see PSSE Program Operation Manual, Fixed Bus Shunt Data).\n\nshunt_data\n\n modify the data of an existing fixed bus shunt in the working case or to add a new fixed bus shunt to the working case (see PSSE Program Operation Manual, Fixed Bus Shunt Data).\n\nsolution_parameters\n\n\n\nsolution_parameters_2\n\n\n\nsolution_parameters_3\n\n\n\nsolution_parameters_4\n\n\n\nsolution_parameters_5\n\n modify the power flow solution parameters in the working case (see PSSE Program Operation Manual, Sections 6.3.13, 6.3.18, 6.5.1 and 11.7).\n\nswitched_shunt_chng_3\n\n\n\nswitched_shunt_chng_4\n\n\n\nswitched_shunt_chng_5\n\nUse this API routine to modify the data of an existing switched shunt in the working case (see PSSE Program Operation Manual, Switched Shunt Data).\n\nswit"
  },
  {
    "id": "chunk_44_part_0",
    "text": "ched_shunt_data\n\n\n\nswitched_shunt_data_3\n\n\n\nswitched_shunt_data_4\n\n\n\nswitched_shunt_data_5\n\n modify the data of an existing switched shunt in the working case or to add a new switched shunt to the working case (see PSSE Program Operation Manual, Switched Shunt Data).\n\nthree_winding_data\n\n\n\nthree_wnd_imped_chng_3\n\n\n\nthree_wnd_imped_chng_4\n\nUse this API routine to modify the impedance data of an existing three-winding transformer in the working case (see PSSE Program Operation Manual, Non-Transformer Branch Data).\n\nthree_wnd_imped_data_3\n\n\n\nthree_wnd_imped_data_4\n\nUse this API routine to modify the impedance data of an existing three-winding transformer in the working case, or to add a new three-winding transformer to the working case (see PSSE Program Operation Manual, Non-Transformer Branch Data).\n\nthree_wnd_impedance_data\n\n\n\nthree_wnd_winding_data\n\n\n\nthree_wnd_winding_data_3\n\n\n\nthree_wnd_winding_data_4\n\n\n\nthree_wnd_winding_data_5\n\n modify the data of one winding of an existing three-w"
  },
  {
    "id": "chunk_44_part_1",
    "text": "inding transformer in the working case (see PSSE Program Operation Manual, Non-Transformer Branch Data).\n\ntransaction_add_mod\n\n add or modify transaction event data in PSSE working memory.\n\ntransaction_delete\n\n delete a transaction event from PSSE working memory.\n\ntransfer_chng\n\nUse this API routine to modify the data of an inter-area transfer in the working case (see PSSE Program Operation Manual, Zone Data).\n\ntransfer_data\n\nUse this API routine to modify the data of an inter-area transfer in the working case, or to add a new inter-area transfer to the working case (see PSSE Program Operation Manual, Zone Data).\n\ntwo_term_dc_converter_data_3\n\n modify the data of a dc converter of an existing two-terminal dc line in the working case (see PSSE Program Operation Manual, Area Interchange Data).\n\ntwo_term_dc_convr_data\n\n\n\ntwo_terminal_dc_line_chng\n\nUse this API routine to modify the link data of an existing two-terminal dc line in the working case (see PSSE Program Operation Manual, Area I"
  },
  {
    "id": "chunk_44_part_2",
    "text": "nterchange Data).\n\ntwo_terminal_dc_line_data\n\nUse this API routine to modify the link data of an existing two-terminal dc line in the working case, or to add a new two-terminal dc line and its link data to the working case (see PSSE Program Operation Manual, Area Interchange Data).\n\ntwo_winding_chng_4\n\n\n\ntwo_winding_chng_5\n\n\n\ntwo_winding_chng_6\n\nUse this API routine to modify the data of an existing two-winding transformer in the working case (see PSSE Program Operation Manual, Owner Data).\n\ntwo_winding_data\n\n\n\ntwo_winding_data_3\n\n\n\ntwo_winding_data_4\n\n\n\ntwo_winding_data_5\n\n\n\ntwo_winding_data_6\n\n modify the data of an existing two-winding transformer in the working case, or to add a new two-winding transformer to the working case (see PSSE Program Operation Manual, Owner Data).\n\nvoltage_droop_chng\n\nUse this API routine to modify the voltage droop control in the working case(see PSSE Program Operation Manual.\n\nvoltage_droop_data\n\nUse this API routine to modify the voltage droop control"
  },
  {
    "id": "chunk_45_part_0",
    "text": "in the working case, or to add a new voltage droop control to the working case (see PSSE Program Operation Manual.\n\nvsc_dc_converter_data\n\n\n\nvsc_dc_converter_data_3\n\n modify the data of a dc converter of an existing VSC dc line in the working case (see PSSE Program Operation Manual, Voltage Source Converter (VSC) DC Transmission Line Data).\n\nvsc_dc_line_chng\n\nUse this API routine to modify the link data of an existing VSC dc line in the working case (see PSSE Program Operation Manual, Voltage Source Converter (VSC) DC Transmission Line Data).\n\nvsc_dc_line_data\n\nUse this API routine to modify the link data of an existing VSC dc line in the working case, or to add a new VSC dc line to the working case (see PSSE Program Operation Manual, Voltage Source Converter (VSC) DC Transmission Line Data).\n\nzone_data\n\n modify zone data in the working case (see PSSE Program Operation Manual, Zone Data).\n\n--- Power Flow Operation — .txt ---\n\nPower Flow Operation — \n\nPower Flow Operation¶\n\n\n\n\n\naccc\n\n\n\n"
  },
  {
    "id": "chunk_45_part_1",
    "text": "accc_2\n\n\n\naccc_multiple_merge\n\n merge a number of AC contingency solution files (acc files) into one acc file.\n\naccc_multiple_run_report\n\n\n\naccc_multiple_run_report_2\n\n report the results of up to twenty two executions of the AC Contingency Calculation function.\n\naccc_parallel\n\n\n\naccc_parallel_2\n\nUse this API routine to run the second release of the parallel implementation of the AC contingency calculation function (use ACCC_WITH_DSP_3 to run AC contingency calculation function serially).\n\naccc_single_run_report\n\n\n\naccc_single_run_report_2\n\n\n\naccc_single_run_report_3\n\n\n\naccc_single_run_report_4\n\n\n\naccc_single_run_report_5\n\n\n\naccc_single_run_report_6\n\nThis API is the sixth release of the AC Contingency Report function.\n\naccc_trip_cor\n\n\n\naccc_trip_cor_2\n\n\n\naccc_trip_cor_3\n\nThis API is the third release of the function to run AC contingency analysis with tripping simulation and corrective actions.\n\naccc_with_cor\n\n\n\naccc_with_cor_2\n\n\n\naccc_with_cor_3\n\nThis API is the third release of funct"
  },
  {
    "id": "chunk_45_part_2",
    "text": "ion to run AC contingency analysis with corrective actions.\n\naccc_with_dsp\n\n\n\naccc_with_dsp_2\n\n\n\naccc_with_dsp_3\n\n run the second release of AC contingency calculation function (ACCC, ACCC_WITH_DSP).\n\naccc_with_trip\n\n\n\naccc_with_trip_2\n\n run the second version of AC contingency calculation function with a post- contingency tripping function.\n\naccc_with_trip_parallel\n\n run the parallel version of AC contingency calculation function with a post- contingency tripping function (use ACCC_WITH_TRIP_2 to run the function sequentially).\n\naccor\n\n\n\naccor_2\n\n\n\naccor_3\n\nThis API is the third release of corrective action function.\n\nalert_output\n\n specify the alert device.\n\nallow_pssuserpf\n\n specify or return the option to allow or disallow the loading or use of the Powerflow Customization Interface (PCI) implementation module (pssuserpf).\n\nalph\n\n print an alphabetically sorted table of all buses in a specified subsystem of the working case (activity ALPH).\n\nappend_accc\n\n replicate system conditions"
  },
  {
    "id": "chunk_46_part_0",
    "text": "of a contingency case solution, as contained in a designated Saved Case File, in the form of a Contingency Solution Output File.\n\napply_var_limits\n\n specify or return the option for the default VAR limits setting; either apply automatically, apply immediately, ignore, or apply on a specific iteration\n\narea\n\n\n\narea_2\n\n tabulate area totals by area, as well as the desired area net interchange (activity AREA).\n\narea_zone\n\n tabulate area totals by area, along with subtotals by zone.\n\narnm\n\n\n\narnm_2\n\nThis API routine is the second release of the area renumbering function.\n\nbase_frequency\n\n specify or return the value of the base frequency option setting.\n\nbgen\n\n convert the mismatch at boundary buses to equivalent load and/or generation (activity BGEN).\n\nbrch\n\n\n\nbrch_2\n\n tabulate those branches where impedances or other characteristics are such that they may be detrimental to the rate of convergence of one or more of the power flow solution activities.\n\nbsnm\n\n change the bus numbers of spec"
  },
  {
    "id": "chunk_46_part_1",
    "text": "ified network buses in the working case and retain a tabulation, in file form, of bus number changes made (activity BSNM).\n\nbus_input\n\n specify or return the bus input option setting, for either numbers or names.\n\nbus_output\n\n specify or return the bus output option setting, for either numbers or names.\n\nbus_size_level\n\n specify or return the value of the PSSE size level option setting to a multiple of 1,000 between 1,000 and 200,000.\n\nbusn\n\n tabulate unused bus numbers within a specified bus number range (activity BUSN).\n\nca_iterations\n\n specify or return the contingency iterations limit setting.\n\ncase\n\n open a PSSE Saved Case file and transfers its data into the PSSE working case.\n\ncheck_powerflow_data\n\nUse this API routine to perform data checks on the selected categories of powerflow data for all buses in the working case or for all buses in a specified subsystem.\n\ncheckvoltagelimits\n\n tabulate those buses where voltage magnitude is beyond their normal or emergency voltage limits.\n"
  },
  {
    "id": "chunk_46_part_2",
    "text": "\nchkcntduplicon\n\nCheck duplicate labels in Contingengy (CON) file.\n\nchkcntduplidfx\n\nCheck duplicate labels in DFAX file.\n\nclose_powerflow\n\nRemoves the current powerflow working case from PSSE’s working memory.\n\nclose_report\n\nSets the report output device to the standard output and sets the command line to request device selection for individual reporting activities (Activity CLOS).\n\ncmpr\n\n tabulate certain case totals, as contained in the working case, with those of a designated Saved Case (activity CMPR).\n\ncntb\n\n tabulate the voltage setpoints and desired voltage bands of voltage-controlling equipment in the working case (activity CNTB).\n\ncong\n\n convert generators from their power flow representation in preparation for switching studies and dynamic simulations (activity CONG).\n\nconl\n\n convert the constant MVA load for a specified grouping of network loads to a specified mixture of the constant MVA, constant current, and constant admittance load characteristics (activity CONL).\n\nconne"
  },
  {
    "id": "chunk_47_part_0",
    "text": "ctivity_check\n\n specify or return the option to enable or disable the solution connectivity checking option setting.\n\ncontrol_area_interchange\n\n to specify or return the area interchange control option setting to disabled, or enabled with tie lines only, or enabled with tie lines and loads.\n\ncsv_to_rawx\n\n import a rawx (extended raw data) data table from a CSV (comma-separated values) file.\n\ncsv_to_rawx_with_metamodel\n\n import a rawx (extended raw data) data table from a CSV (comma-separated values) file with metamodel.\n\ndc_tap_adjustment\n\n specify or return the option to enable or disable the dc tap adjustment option setting.\n\ndccc\n\n\n\ndccc_2\n\n run contingency case solutions using a linear network (dc) model (activity DCCC).\n\ndccor\n\n apply corrective actions to the base case using linear programming methods.\n\ndccor_2\n\n apply corrective actions to the base case using linear programming methods.\n\ndclf\n\n\n\ndclf_2\n\nUse this API routine to apply the dc analogy network solution algorithm to t"
  },
  {
    "id": "chunk_47_part_1",
    "text": "he network modeled in the working case (activity DCLF).\n\ndcpscopf\n\nThis API is the DC based Preventive Security Constrained Optimal Power Flow solution (DCPSCOPF).\n\ndeltmpfiles\n\nDelete closed temporary files.\n\ndfax\n\n\n\ndfax_2\n\n construct a Distribution Factor Data File (activity DFAX).\n\ndfax_contingency\n\n combine one contingency in the first Distribution Factor file with one contingency in the second Distribution Factor file and so on, till specified contingency level is reached, to create multiple event contingencies and then export resulting contingencies to user defined report device.\n\ndfti\n\n compare tie lines, as contained in the working case, with those of a designated Saved Case (activity DFTI).\n\ndiff\n\n compare specified power flow data and solution results, as contained in the working case, with those of a designated Saved Case (activity DIFF).\n\ndscn\n\n electrically disconnect a bus (activity DSCN).\n\nduplicate_cntlabel_check\n\n specify or return the option to enable or disable the "
  },
  {
    "id": "chunk_47_part_2",
    "text": "duplicated contingency labels check     when Distribution Factor Data File (.dfx) or Contingency Description Data File (.con) files are used.\n\necdi\n\n place machines in a specified subsystem on- or off-line to satisfy a given subsystem minimum capacity; the in-service machines in the subsystem are then dispatched on the basis of incremental cost to meet a specified total subsystem generation (activity ECDI).\n\necho\n\n enable or disable response echoing (activity ECHO).\n\neeqv\n\n construct an electrical equivalent of a specified subsystem of the working case (activity EEQV).\n\neqrd\n\n build an electrical equivalent of radial and, optionally, two-point Type 1 buses in a specified subsystem of the working case (activity EQRD).\n\nexam\n\n tabulate all power flow data pertaining to a specified bus (activity EXAM).\n\nfact\n\n factorize the network admittance matrix in preparation for switching studies and dynamic simulations (activity FACT).\n\nfdns\n\n apply the fixed slope decoupled Newton-Raphson power fl"
  },
  {
    "id": "chunk_48_part_0",
    "text": "ow calculation (activity FDNS).\n\nfile_overwrite\n\n specify or return the option to set the file overwrite option setting to either ask first or overwrite.\n\nfind\n\n tabulate a list of buses matching a partial extended bus name (activity FIND).\n\nflat_start\n\n specify or return the option to enable or disable the voltage flat start option setting.\n\nfnsl\n\n apply the Newton-Raphson power flow calculation (activity FNSL).\n\ngcap\n\n\n\ngcap_2\n\n print a report of machine loading and reactive power limit data (activity GCAP).\n\ngdif\n\n calculate differences between the working case and a designated Saved Case (activity GDIF).\n\ngendsp\n\n impose a contingency specified in the Distribution Factor Data file and apply the generation dispatch algorithm used in contingency analysis on the working case.\n\ngendsp_2\n\n impose a contingency specified in the Distribution Factor Data file and apply the generation dispatch algorithm used in contingency analysis on the working case.\n\ngens\n\n tabulate the loading and volta"
  },
  {
    "id": "chunk_48_part_1",
    "text": "ge conditions at plant buses (activity GENS).\n\ngeol\n\n tabulate the loading and voltage conditions at the generator terminals for online machines at Type 2 and 3 buses in the working case (activity GEOL).\n\ngetcontingencysavedcase\n\nUse this API routine to place the working case in the form of a specified system condition as calculated during a previous run of one of the members of the the AC contingency calculation family.\n\ngic_pf\n\nAdd activity GIC calculated Mvar Qloss in scaled manner to the working case to arrive at the converged power flow solution.\n\ngnestatus\n\n specify or return the status of a GNE device.\n\ngnet\n\n change in-service generation to negative MVA load at all Type 2 and 3 buses in the subsystem specified by the user.\n\nimnet\n\nUse this API routine to change the status of induction machines that are in-service to out-of- service, and to replace the power flowing from the network into the machine with constant power load.\n\nimoutage\n\nUse this API routine to change the status o"
  },
  {
    "id": "chunk_48_part_2",
    "text": "f induction machines that are in-service, but that have been set to the “stalled” (for motors) or “tripped” (for generators) state by the power flow solution, to out-of-service.\n\nimpc\n\n calculate the impact of transaction events on MW flows using a linear network (dc) model.\n\nimplement_transfer\n\n\n\nimplement_transfer_2\n\nUse this API routine to apply a specified transfer using the same transfer dispatch methods that are available in the PV analysis calculation engine.\n\ninlf\n\n\n\ninlf_2\n\nUse this API routine to run the second release of the inertial and governor response power flow calculation.\n\ninta\n\n summarize tie flows between an interchange area and all other areas in the working case.\n\nintz\n\n summarize tie flows between each zone and all other zones in the working case.\n\nisolate_levels\n\n specify or return the maximum number of levels to go outward when isolating an element by breaker.\n\njoin\n\nThe API combines two buses into a single bus.\n\nlamp\n\n print power flow solution output, includi"
  },
  {
    "id": "chunk_49_part_0",
    "text": "ng loadings in amps, in a traditional power flow report format.\n\nline_shunt_reporting\n\n specify or return the option to enable or disable the line shunt reporting.\n\nlines_per_page\n\n specify or return the page length limits for the four output devices; also retrieve device names.\n\nlines_per_page_one_device\n\n specify or return the page length limit and device name for one of the four output devices.\n\nlist\n\nUse this API routine to tabulate the power flow working case in a form suitable for problem data documentation.\n\nlistcontingencysavedcases\n\nUse this API routine to obtain a report listing some or all of the system conditions preserved in a ZIP Archive Output File that was created during a previous run of one of the members of the the AC contingency calculation family.\n\nllrf\n\n apply the line loading relief calculation using a linear network (dc) model.\n\nload_reduction\n\n tabulate the amount of load reduction in a specified subsystem due to the voltage at the bus to which the load is conn"
  },
  {
    "id": "chunk_49_part_1",
    "text": "ected being below PQBRAK (for constant MVA load) or 0.5 (for constant current load.\n\nlout\n\n print the power flow solution results in a traditional power flow report format.\n\nltap\n\n insert a bus at a designated location along a line.\n\nmaccc\n\n\n\nmaccc_2\n\n run the second release of multiple level contingency analysis.\n\nmaccc_3\n\n run the third release of multiple level contingency analysis.\n\nmaccc_parallel\n\n run the multiple level contingency analysis in parallel when the number of contingency processors in Program Settings is greater than 1.\n\nmaccc_parallel_2\n\n run the multiple level contingency analysis in parallel when the number of contingency processors in Program Settings is greater than 1.\n\nmaccc_trip_cor\n\n\n\nmaccc_trip_cor_2\n\n\n\nmaccc_trip_cor_3\n\nThis API is the third release of function to run multiple AC contingency analysis with tripping simulations and corrective actions.\n\nmaccc_trip_cor_4\n\nThis API is the third release of function to run multiple AC contingency analysis with trip"
  },
  {
    "id": "chunk_49_part_2",
    "text": "ping simulations and corrective actions.\n\nmaccc_with_cor\n\n\n\nmaccc_with_cor_2\n\n\n\nmaccc_with_cor_3\n\nThis API is the third release of function to run multiple AC contingency analysis with corrective actions.\n\nmaccc_with_cor_4\n\nThis API is the third release of function to run multiple AC contingency analysis with corrective actions.\n\nmaccc_with_trip\n\n\n\nmaccc_with_trip_2\n\n run the second version of multiple level contingency analysis with tripping simulation.\n\nmaccc_with_trip_3\n\n run the second version of multiple level contingency analysis with tripping simulation.\n\nmaccc_with_trip_parallel\n\n run the multiple level contingency analysis with tripping simulation in parallel when the number of contingency processors in Program Settings is greater than 1.\n\nmaccc_with_trip_parallel_2\n\n run the multiple level contingency analysis with tripping simulation in parallel when the number of contingency processors in Program Settings is greater than 1.\n\nmatrix_growth_factor\n\n specify or return the valu"
  },
  {
    "id": "chunk_50_part_0",
    "text": "e of the matrix growth factor option setting.\n\nmcre\n\n read a Machine Impedance Data File and add the data specified in it to the working case.\n\nmodr\n\n uniformly increase or decrease the line resistances of in-service nontransformer branches.\n\nmov_alpha\n\n specify or return the value of the MOV iteration ALPHA option setting.\n\nmov_iterations\n\n specify or return the value of the maximum MOV iterations option setting.\n\nmov_tolerance\n\n specify or return the value of the MOV iteration tolerance option setting.\n\nmove3wnd\n\n disconnect the third bus of a specified three-winding transformer from the bus to which it is currently connected, and reconnect it to a designated bus.\n\nmovebrn\n\n disconnect the to bus of a specified non-transformer branch or two-winding transformer from the bus to which it is currently connected, and reconnect it to a designated bus.\n\nmoveindmac\n\nUse this API routine to disconnect the specified induction machine from the bus to which it is currently connected, and reconne"
  },
  {
    "id": "chunk_50_part_1",
    "text": "ct it to a designated bus.\n\nmoveindmacs\n\nUse this API routine to disconnect all of the induction machines at the specified bus, and reconnect them to a designated bus.\n\nmoveload\n\n disconnect the specified load from the bus to which it is currently connected, and reconnect it to a designated bus.\n\nmoveloads\n\n disconnect all of the load from the specified bus, and reconnect it to a designated bus.\n\nmovemac\n\n disconnect the specified machine from the bus to which it is currently connected, and reconnect it to a designated bus.\n\nmoveplnt\n\n disconnect all of the machines from the specified bus, and reconnect it to a designated bus.\n\nmoveshunt\n\n disconnect the specified fixed shunt from the bus to which it is currently connected, and reconnect it to a designated bus.\n\nmoveshunts\n\n disconnect all of the fixed shunts from the specified bus and reconnect them to a designated bus.\n\nmovesws\n\n\n\nmoveswshunt\n\n disconnect the specified switched shunt from the bus to which it is currently connected, a"
  },
  {
    "id": "chunk_50_part_2",
    "text": "nd reconnect it to a designated bus.\n\nmoveswshunts\n\n disconnect all of the switched shunts from the specified bus and reconnect them to a designated bus.\n\nmslv\n\n apply the modified Gauss-Seidel power flow calculation.\n\nmsum\n\n print a summary of mileage by owner.\n\nmtdc\n\n produce a report of bus voltages and flows for each in-service multi-terminal dc line.\n\nmultisection_reporting\n\n specify or return the option to enable or disable multi-section line reporting.\n\nmwmi\n\n apply the MAPP MW-mile calculation .\n\nmwomwmsf\n\n tabulate generation (MW) on MW-mile shift factors for a specified transaction event.\n\nmwomwosf\n\n tabulate generation (MW) on MW-ohm shift factors for a specified transaction event.\n\nn11_accc\n\n\n\nn11_accc_2\n\nThis API is the second release of N-1-1 contingency analysis solution.\n\nn11_accc_3\n\nThis API is the second release of N-1-1 contingency analysis solution.\n\nn11_accc_parallel\n\n run the N-1-1 contingency analysis in parallel when the number of contingency processors in Progr"
  },
  {
    "id": "chunk_51_part_0",
    "text": "am Settings is greater than 1.\n\nn11_accc_parallel_2\n\n run the N-1-1 contingency analysis in parallel when the number of contingency processors in Program Settings is greater than 1.\n\nn11_accc_pscopf\n\n\n\nn11_accc_pscopf_2\n\nThe API is the second release of N-1-1 contingency analysis solution in either corrective mode or security constrained optimal power flow mode (SCOPF).\n\nn11_accc_pscopf_3\n\nThe API is the second release of N-1-1 contingency analysis solution in either corrective mode or security constrained optimal power flow mode (SCOPF).\n\nnetg\n\n change the in-service generation to negative MVA load at all Type 2 and 3 buses except those in the subsystem specified by the user.\n\nnew_dimension\n\n reset PSSE to an increased bus size level.\n\nnewcas\n\n\n\nnewcase_2\n\nThis API is the second release of the function used to initialize a new power flow case.\n\nnewton_tolerance\n\n specify or return the value of the default Newton-Raphson convergence tolerance.\n\nnon_divergent\n\n specify or return the opt"
  },
  {
    "id": "chunk_51_part_1",
    "text": "ion to specify or return the option to enable or disable the non-divergent Newton power flow solution.\n\nnon_trans_percent_units\n\n set the non-transformer branch percent units option setting to either MVA or current expressed as MVA.\n\nnsol\n\n apply the decoupled Newton-Raphson power flow calculation.\n\nnumber_threads\n\n specify or return the number of processors available for parallel operations.\n\nordr\n\n calculate a sparsity preserving ordering of buses in preparation for the processing of network matrices.\n\notdf\n\n tabulate vectors of distribution factors using a linear network (dc) model.\n\noutput_y_matrix\n\n display the network admittance matrix for a subsystem of the working case in the form of a list of matrix terms.\n\nouts\n\n tabulate those components in the working case that are removed from service.\n\nownm\n\n\n\nownm_2\n\n\n\nownm_3\n\nThis API routine is the third release of the owner renumbering function.\n\nownr\n\n tabulate owner totals by owner.\n\npath\n\n specify a directory pathname.\n\nphase_shift"
  },
  {
    "id": "chunk_51_part_2",
    "text": "_adjustment\n\n specify or return the option to enable or disable the phase shift adjustment.\n\npoly\n\n calculate interchange limits of a study system against two opposing systems using a linear network (dc) model.\n\npout\n\n print the power flow solution results with boundary condition and flow information on the left side of the report and other information on the right side.\n\npower_output\n\n specify or return the option to display power output in either MVA or kVA.\n\npp_accc\n\n report the results of the AC contingency calculation function.\n\npp_accc_multi_case\n\n\n\nprint_outaged_branches\n\n specify or return the option to enable or disable whether to print out-of- service branches.\n\nprint_winding_buses\n\n specify or return the option to enable or disable whether to print winding “to” buses of three-winding transformers.\n\nprogress_output\n\n specify the progress output device.\n\nprompt_output\n\n specify the prompt output device.\n\nprti\n\n print the 16 line long title.\n\npscopf\n\n\n\npscopf_2\n\nThis API is the"
  },
  {
    "id": "chunk_52_part_0",
    "text": "second release of Preventive Security Constrained Optimal Power Flow solution (PSCOPF).\n\npseb\n\n convert a PSEB command file into a PSSE response file.\n\npssehalt\n\n\n\npssehalt_2\n\n end the operation of PSSE, closes all associated files and returns to the calling application.\n\npv_engine\n\n\n\npv_engine_1a\n\n\n\npv_engine_2\n\n\n\npv_engine_3\n\n\n\npv_engine_4\n\n\n\npv_engine_5\n\n\n\npv_engine_6\n\nUse this API routine to run the PV analysis calculation engine.\n\nqv_engine\n\n\n\nqv_engine_2\n\n\n\nqv_engine_3\n\n\n\nqv_engine_4\n\nUse this API routine to run the QV analysis calculation engine.\n\nrank\n\n estimate the severity of designated single branch outage contingencies and builds a contingency solution output file with contingencies specified in decreasing order of their estimated severities.\n\nrank_brn_and_mac\n\n estimate the severity of designated single element outage contingencies and builds a contingency description data file with contingencies specified in decreasing order of their estimated severities.\n\nrate\n\n\n\nrate_2\n"
  },
  {
    "id": "chunk_52_part_1",
    "text": "\n check branch loadings.\n\nrating_set\n\n specify or return the current rating set, from 1 to 12.\n\nrawd\n\n\n\nrawd_2\n\n replicate the working case in the form of a power flow raw data file.\n\nrawdx\n\n\n\nrawx_to_csv\n\n export rawx (extended raw data) table to a CSV (comma-separated values) file.\n\nrdch\n\n read power flow change data into the working case.\n\nrdchrawversion\n\n read a Power Flow Change Raw Data File into the working case.\n\nrdeq\n\n build an electrical equivalent of radial and, optionally, two-point Type 1 buses outside of a specified subsystem of the working case.\n\nread\n\n read a power flow raw data file and add all the data specified in it to the working case.\n\nreadcapcurves\n\n read data contained in a Machine Capability Curve Data File into the working case.\n\nreadrawversion\n\n read a power flow raw data file and add all the data specified in it to the working case.\n\nreadrawx\n\n read an extended raw data file and add all the data specified to the working case.\n\nreadsub\n\n read a power flow raw"
  },
  {
    "id": "chunk_52_part_2",
    "text": " data file and add subsystem data specified in it to the working case.\n\nreadsubrawversion\n\n read a power flow raw data file and add subsystem data specified in it to the working case.\n\nreadx\n\n\n\nrecn\n\n electrically reconnect a bus.\n\nregb\n\n tabulate those buses where voltages are controlled by generation, switched shunts, and/or other voltage controlling equipment.\n\nrelind\n\n\n\nrelind_2\n\n run probabilistic reliability assessment for transmission systems.\n\nremm\n\n read transaction event data from a transactions raw data file and add it to PSSE working memory.\n\nreport_output\n\n specify the report output device.\n\nresq\n\n read sequence data from a sequence data file and add it to the working case.\n\nresqversion\n\n read a network sequence data file and add all the data specified in it to the working case.\n\nresult_table_output\n\n get and set the default tabular output.\n\nreti\n\n read the long title from an input file into the working case.\n\nretry_pssuserpf\n\n allow the loading or use of the Powerflow Cu"
  },
  {
    "id": "chunk_53_part_0",
    "text": "stomization Interface (PCI) implementation module (pssuserpf) after a failure.\n\nrev29_names\n\n set the extended bus name input format to either the PSSE-29 or PSSE-30 format.\n\nrnfi\n\n reproduce the results of a working case bus renumbering operation in auxiliary data input files.\n\nrsol\n\n perform a robust power flow solution (activity RSOL).\n\nrunlastsolution\n\n run the last known power flow solution.\n\nrwcm\n\n replicate the working case in IEEE common tape format.\n\nrwma\n\n replicate machine parametric data from the working case in the form of a machine impedance data file.\n\nrwmm\n\n replicate transaction event data in the form of a transactions data file.\n\nrwsq\n\n\n\nrwsq_2\n\n replicate the sequence data contained in the working case in the form of a sequence data file.\n\nsave\n\n save the PSSE working case in a saved case file.\n\nscal\n\n\n\nscal_2\n\n\n\nscal_3\n\n\n\nscal_4\n\nUse this API routine to uniformly increase or decrease any or all specified bus quantities for a specified group of buses.\n\nsensitivity_fl"
  },
  {
    "id": "chunk_53_part_1",
    "text": "ow\n\nThis API is used to calculate sensitivity factors of a branch flow to MW power at buses, MW power at generator buses, MW at load buses, phase angle of phase shifters, tap postion of tap changing transformers as well as admittance of switched shunts:\n\nsensitivity_flows\n\nThis API is used to calculate sensitivity factors of flows on the branches in a subsystem to MW power at buses, MW power at generator buses, MW power at load buses, phase angle of phase shifters, tap postion of tap changing transformers as well as admittance of switched shunts.\n\nsensitivity_interface\n\nThis API is used to calculate sensitivity factors of  an interface flow to MW power at buses, MW power at generator buses, MW power at load buses, phase angle of phase shifters, tap position of tap changing transformers as well as admittance of switched shunts.\n\nsensitivity_voltage\n\nThis API is used to calculate sensitivity factors of a bus voltage to MW and MVar power at buses, MW power at generator buses, MW and MVar "
  },
  {
    "id": "chunk_53_part_2",
    "text": "at load buses, phase angle of phase shifters, tap postion of tap changing transformers as well as admittance of switched shunts.\n\nsensitivity_voltages\n\nThis API is used to calculate sensitivity factors of  bus voltages in a subsystem to MW and MVar power at buses, MW power at generator buses, MW and MVar at load buses, phase angle of phase shifters, tap postion of tap changing transformers as well as admittance of switched shunts.\n\nset_input_dev\n\n set the terminal input device to a file.\n\nset_progress_verbose\n\n to set the option progress message verbose value.\n\nshnt\n\n tabulate fixed and/or switched bus shunts contained in the working case.\n\nshort_circuit_coordinates\n\n specify or return the option to set the fault analysis voltage and current output coordinates to either rectangular or polar coordinates.\n\nshort_circuit_modeling\n\n specify or return the option for the fault analysis modeling setting; either normal three-phase or center tapped two-phase.\n\nshort_circuit_units\n\n specify or r"
  },
  {
    "id": "chunk_54_part_0",
    "text": "eturn the option to set the fault analysis voltage and current output units to either per unit or physical units.\n\nshort_circuit_warning\n\n specify or return the option to enable or disable the fault analysis warning option setting.\n\nshort_circuit_z_coordinates\n\n specify or return the option to set the fault analysis output impedance coordinates to either rectangular or polar coordinates.\n\nshort_circuit_z_units\n\n specify or return the option to set the fault analysis output impedance units to either per unit or ohms.\n\nshow\n\n tabulate summaries of Saved Case and/or Snapshot Files.\n\nshowtable\n\nDirects a report table to output console.\n\nshowtablebyindex\n\nThis API routine was first introduced in release 35.\n\nsize\n\n obtain a summary of the number of components in the working case (activity SIZE).\n\nsolv\n\n apply the Gauss-Seidel power flow calculation.\n\nspcb\n\n calculate positive sequence equivalents of branch unbalances.\n\nspil\n\n calculate transmission interchange limits using a linear network "
  },
  {
    "id": "chunk_54_part_1",
    "text": "(dc) model.\n\nsplt\n\n add a bus to the working case and place a zero impedance line between bus BUS and the new bus.\n\nsqli\n\n tabulate the sequence data in a form suitable for problem data documentation.\n\nsraind\n\n run the substation reliability analysis.\n\nstop\n\n\n\nstop_2\n\n end the operation of PSSE.\n\nsubs\n\n summarize conditions in the working case by tabulating the conditions at each swing system bus, conditions at each area slack area bus, number of components, generation/ load/shunt totals, and loss/line shunt/charging totals by voltage levels.\n\nswitched_shunt_adjustment\n\n specify or return the option to enable or disable switched shunt adjustment.\n\ntap_adjustment\n\n specify or return the option for the default tap adjustment setting; either disabled, stepping or direct.\n\ntext\n\nThis API does nothing.\n\ntflg\n\n set or reset the adjustment control mode flags for all automatically adjustable transformers contained in the specified subsystem.\n\nties\n\n tabulate the flows on all area tie lines, wi"
  },
  {
    "id": "chunk_54_part_2",
    "text": "th tie flows grouped by area.\n\ntiez\n\n tabulate the flows on all zone tie lines, with tie flows grouped by zone.\n\ntime\n\n tabulate timing statistics.\n\ntlst\n\n tabulate those transformers in the working case where off-nominal turns ratio or phase shift angle may be adjusted by the power flow solution activities.\n\ntltg\n\n calculate transmission interchange limits using a linear network (dc) model.\n\ntpch\n\n check the adjustment data associated with voltage or flow controlling transformers.\n\ntransformer_percent_units\n\n specify or return the option to set the transformer percent units to either MVA or current expressed as MVA.\n\ntransmission_line_units\n\n to specify or return the option set the transmission line units to either per unit or ohms.\n\ntree\n\n check for the existence of in-service ac islands that do not contain a Type 3 (swing) bus.\n\ntspfprofilecurvevalue\n\n return real parameters of Time Series Power Flow profile data.\n\ntysl\n\n run switching study network solutions.\n\nuser\n\n run the user-w"
  },
  {
    "id": "chunk_55_part_0",
    "text": "ritten activity, subroutine USERAC.\n\nvamm\n\n tabulate the vector absolute MW-mile report.\n\nvamo\n\n tabulate the vector absolute MW-ohm report.\n\nvchk\n\n tabulate those buses where voltage magnitude is outside a specified range.\n\nvoltage_input\n\n specify or return the voltage input option setting; either per unit or kV.\n\nvoltage_output\n\n specify or return the voltage output option setting; either per unit or kV.\n\nvsmo\n\n tabulate the vector MW-ohm report.\n\nwrite_options_file\n\n save the present values of the PSSE-25 program option settings to the file psse.opt.\n\nwritecapcurves\n\n write the capability curve data in the working case in the form of a Capability Curve Raw Data File.\n\nwriterawversion\n\n replicate the working case in the form of power flow raw data file compatible with PSSE 15 or later.\n\nwriterawx\n\n write an extended raw data file from data in the current working case.\n\nwriterawxsubsys\n\n write an extended raw data file from data in the current working case, specifying a subsystem.\n\nwr"
  },
  {
    "id": "chunk_55_part_1",
    "text": "iteseqversion\n\n\n\nwriteseqversion_2\n\n replicate the working case in the form of a network sequence data file compatible with PSSE 27 or later.\n\nxeqv\n\n build an electrical equivalent of the portion of the working case outside of a specified subsystem of the working case.\n\nzone\n\n\n\nzone_2\n\n tabulate zone totals by zone.\n\nzone_area\n\n tabulate zone totals by zone, along with subtotals by area.\n\nzonm\n\n\n\nzonm_2\n\nUse this API routine to reassign the buses, loads and/or induction machines in a specified subsystem of the working case from their original zone to a designated zone.\n\n--- Scenarios — .txt ---\n\nScenarios — \n\nScenarios¶\n\n\n\n\n\nclosescenariofile\n\n\n\nnewscenariofile\n\n\n\nopenscenariofile\n\n\n\nsavescenariofile\n\n\n\nscenarioclose\n\n close the currently open Scenario.\n\nscenariocopyfile\n\n copy a file from one group to another group.\n\nscenariofileadd\n\n add a file to the specified group.\n\nscenariofilecount\n\n retrieve the number of files in a specified group in the Scenario.\n\nscenariofilegetattrs\n\n retri"
  },
  {
    "id": "chunk_55_part_2",
    "text": "eve the attributes of the specified file.\n\nscenariofilegetcomments\n\n retrieve the comments for the specified file.\n\nscenariofilelengthcomments\n\n determine the buffer size needed to hold the comments for the specified file.\n\nscenariofilelist\n\n retrieve the list of files in the specified group.\n\nscenariofileremove\n\n remove a file from the specified group.\n\nscenariofilerename\n\n rename one of the files in the Scenario.\n\nscenariofilesetattrs\n\n modify the attributes of the specified file.\n\nscenariofilesetcomments\n\n define or modify the comments for the specified file.\n\nscenariogetattrs\n\n retrieve the attributes of the Scenario.\n\nscenariogetcomments\n\n retrieve the Scenario comments.\n\nscenariogetopt\n\n retrieve the Scenario options.\n\nscenariogroupadd\n\n add a group to the Scenario.\n\nscenariogroupcount\n\n retrieve the number of groups in the Scenario.\n\nscenariogroupgetcomments\n\n retrieve the comments for the specified group.\n\nscenariogrouplengthcomments\n\n determine the buffer size needed to hold t"
  },
  {
    "id": "chunk_56_part_0",
    "text": "he comments for the specified group.\n\nscenariogrouplist\n\n retrieve the list of groups in the Scenario.\n\nscenariogroupopen\n\n add a group to the Scenario.\n\nscenariogroupremove\n\n remove a group from the Scenario.\n\nscenariogrouprename\n\n rename one of the groups in the Scenario.\n\nscenariogroupsetcomments\n\n define or modify the comments for the specified group.\n\nscenarioisdirty\n\n determine if there are any unsaved changes in the current Scenario.\n\nscenarioisvalid\n\n determine if there is a valid Scenario in memory.\n\nscenariolengthcomments\n\n determine the buffer size needed to hold the current Scenario comments.\n\nscenariomodelgroup\n\n create a new group that is identical to another group.\n\nscenariomovefile\n\n move a file from one group to another group.\n\nscenarionew\n\n create a new Scenario.\n\nscenarioopen\n\n open a previously created Scenario.\n\nscenariosave\n\n save the currently open Scenario.\n\nscenariosetattrs\n\n modify the root path and startup group attributes of the Scenario.\n\nscenariosetcomment"
  },
  {
    "id": "chunk_56_part_1",
    "text": "s\n\n define or modify the Scenario comments.\n\nscenariosetopt\n\n modify the Scenario options.\n\nscenariotrackfileadd\n\n add the files currently being tracked.\n\nscenariotrackfilelist\n\n retrieve the list of files being tracked.\n\nscenariotrackfilenum\n\n retrieve the current number of files being tracked.\n\nscenariounzip\n\n unzip a zipped Scenario.\n\nscenariounzipproblems\n\n retrieve the problems that occurred during the last unzip attempt.\n\nscenariounzipsolutions\n\n submit potential solutions to the problems that occurred during the last unzip attempt.\n\nscenariozip\n\n zip up the current Scenario.\n\nscenariozipactive\n\n determine if the Scenario is currently in Zip Mode.\n\nscenariozipopen\n\n open a zipped Scenario.\n\nscenariozipsave\n\nThis API routine was first introduced in release 33.2.\n\n--- Set Disturbance Definition — .txt ---\n\nSet Disturbance Definition — \n\nSet Disturbance Definition¶\n\n\n\n\n\ndist_def_3phase_bus_fault\n\n define a three phase fault at a bus in dynamic simulations.\n\ndist_def_3wind_fault\n\n de"
  },
  {
    "id": "chunk_56_part_2",
    "text": "fine a fault at the IBUS end of a three-winding transformer in dynamic simulations.\n\ndist_def_branch_fault\n\n define a fault at the IBUS end of a non-transformer branch or a two-winding transformer in dynamic simulations.\n\ndist_def_scmu_fault_3\n\n define an unbalanced fault at a bus in dynamic simulations.\n\ndist_def_spcb_fault_2\n\nUse this API routine to define a branch unbalance in dynamic simulations.\n\n--- Set Disturbance — .txt ---\n\nSet Disturbance — \n\nSet Disturbance¶\n\n\n\n\n\ndist_3phase_bus_fault\n\n apply a three phase fault at a bus during dynamic simulations.\n\ndist_3wind_close\n\n set a three-winding transformer to in-service during dynamic simulations.\n\ndist_3wind_fault\n\n apply a fault at the IBUS end of a three-winding transformer during dynamic simulations.\n\ndist_3wind_trip\n\n set a three-winding transformer to out-of-service during dynamic simulations.\n\ndist_branch_close\n\n set a non-transformer branch or a two-winding transformer to in-service during dynamic simulations.\n\ndist_branch_"
  },
  {
    "id": "chunk_57_part_0",
    "text": "fault\n\n apply a fault at the IBUS end of a non-transformer branch or a two-winding transformer during dynamic simulations.\n\ndist_branch_trip\n\n set a non-transformer branch or a two-winding transformer to out-of-service during dynamic simulations.\n\ndist_bus_fault\n\n\n\ndist_bus_fault_2\n\n\n\ndist_bus_fault_3\n\n apply an unbalanced fault at a bus during dynamic simulations.\n\ndist_bus_trip\n\n disconnect a bus during dynamic simulations.\n\ndist_clear_fault\n\n clear a fault during dynamic simulations.\n\ndist_machine_trip\n\n set a machine to out-of-service during dynamic simulations.\n\ndist_scmu_fault\n\n\n\ndist_scmu_fault_2\n\n\n\ndist_scmu_fault_3\n\n calculate an unbalanced fault and apply the equivalent positive sequence fault admittance at a bus during dynamic simulations.\n\ndist_spcb_fault\n\n\n\ndist_spcb_fault_2\n\nUse this API routine to run the second release of the dynamics branch unbalance function.\n\n--- Single Element Data — .txt ---\n\nSingle Element Data — \n\nSingle Element Data¶\n\n\n\n\n\napierrstr\n\n return the "
  },
  {
    "id": "chunk_57_part_1",
    "text": "message string associated with a specific error code returned from a recordable PSSE API routine.\n\nardat\n\n return area totals.\n\naredat\n\n return real area data items.\n\nareint\n\n return integer area data items.\n\narenam\n\n return the area name.\n\narenum\n\n return the area number.\n\nareuse\n\n indicate if an area is in use.\n\naritoj\n\n return the interchange between two areas.\n\nbrncur\n\n\n\nbrndat\n\n return real branch parameters.\n\nbrndt2\n\n return complex positive and zero sequence parameters for non-transformer branches, and complex positive sequence parameters for transformer branches.\n\nbrnflo\n\n return the complex branch flow (P+jQ) as calculated at IBUS.\n\nbrnint\n\n return integer branch parameters.\n\nbrnmsc\n\n return real branch flow values.\n\nbrnmva\n\n\n\nbrnnam\n\n return the name of an AC branch.\n\nbrnstt\n\n\n\nbsysisdef\n\n check whether a bus subsystem has been defined for a given subsystem ID.\n\nbusdat\n\n return real bus values.\n\nbusdt1\n\n return complex bus parameters as MVA.\n\nbusdt2\n\n return complex bus param"
  },
  {
    "id": "chunk_57_part_2",
    "text": "eters.\n\nbusexs\n\n check for the existence of a specified bus.\n\nbusint\n\n return integer bus parameters.\n\nbusmsm\n\n return complex bus mismatch.\n\nbusordpos\n\n return the ordinal position of the specified bus or bus section in the numerically ordered list of non-star point buses (i.e., star point buses are excluded).\n\nbussectdat\n\nUse this API routine to return real bus section values.\n\nbussectdt1\n\nUse this API routine to return complex bus section parameters as MVA.\n\nbussectdt2\n\nUse this API routine to return complex bus section parameters.\n\nbussectexs\n\nUse this API routine to check for the existence of a specified bus section.\n\nbussectint\n\nUse this API routine to return real bus section values.\n\ncctmdlnam_2dco\n\n return model name of CCT 2-terminal dc line other models.\n\ncctmdlnam_2wtd\n\n return model name of the CCT 2-winding transformer device model.\n\ncctmdlnam_3wtd\n\n return model name of the CCT 3-winding transformer device model.\n\ncctmdlnam_brnd\n\n return model name of the CCT branch devic"
  },
  {
    "id": "chunk_58_part_0",
    "text": "e model.\n\ncctmdlnam_brno\n\n return model name of the CCT branch other model.\n\ncctmdlnam_buso\n\n return model name of CCT Bus other models.\n\ncctmdlnam_mcno\n\n return model name of the CCT machine other models.\n\ncctmdlnam_mcnp\n\n return model name of the CCT machine protection models.\n\ncctmdlnam_msco\n\n return model name of the CCT Miscellaneous other model.\n\ncctmdlnam_swso_2\n\n return model name of the CCT switched shunt other type models.\n\ncctmind_2dco\n\n return starting array indices and status of CCT 2-terminal dc line other models.\n\ncctmind_2wtd\n\n return starting array indices and status of CCT 2-winding transformer device models.\n\ncctmind_3wtd\n\n return starting array indices and status of CCT 3-winding transformer device models.\n\ncctmind_brnd\n\n return starting array indices and status of CCT branch device models.\n\ncctmind_brno\n\n return starting array indices and status of CCT branch other models.\n\ncctmind_buso\n\n return starting array indices and status of CCT Bus other models.\n\ncctmind_mc"
  },
  {
    "id": "chunk_58_part_1",
    "text": "no\n\n return starting array indices and status of CCT machine other models.\n\ncctmind_mcnp\n\n return starting array indices and status of CCT machine protection models.\n\ncctmind_msco\n\n return starting array indices and status of CCT Miscellaneous other models.\n\ncctmind_swso\n\n\n\ncctmind_swso_2\n\n return starting array indices and status of CCT Switched Shunt other models.\n\nchktre\n\n check for Type 4 (or greater) buses with in-service branches connected to them.\n\nchnval\n\n return the present value of the simulation variable assigned to a specified output channel.\n\ndc2auxmind\n\n return the starting array indices and status of auxiliary signal model associated with 2-terminal dc line for the specified signal index.\n\ndc2auxmnam\n\n return the auxiliary signal model name associated with a 2-terminal dc line for the specified auxiliary signal index.\n\ndc2dat\n\n\n\ndc2dat_2\n\nThis API is the second release of the API that returns real two-terminal dc line quantities.\n\ndc2int\n\n\n\ndc2int_2\n\nThis API is the seco"
  },
  {
    "id": "chunk_58_part_2",
    "text": "nd release of the API that returns integer two-terminal dc line quantities.\n\ndc2mind\n\n return 2-terminal dc line model starting array indices and status.\n\ndc2mnam\n\n return 2-terminal dc line model name.\n\ndcnauxmind\n\n return the starting array indices and status of auxiliary signal model associated with N-terminal dc line for the specified signal index.\n\ndcnauxmnam\n\n return the auxiliary signal model name associated with a N-terminal dc line for the specified auxiliary signal index.\n\ndcncin\n\n\n\ndcncin_2\n\nThis API is the second release of the API that returns integer multi-terminal dc line converter quantities.\n\ndcndat\n\n\n\ndcndat_2\n\nThis API is the second release of the API that returns real multi-terminal dc line quantities.\n\ndcnint\n\n\n\ndcnint_2\n\nThis API is the second release of the API that returns integer multi-terminal dc line quantities.\n\ndcnmind\n\n return N-terminal dc line model starting array indices and status.\n\ndcnmnam\n\n return N-terminal dc line model name.\n\ndscval\n\n return dynam"
  },
  {
    "id": "chunk_59_part_0",
    "text": "ics character array values.\n\ndsival\n\n return dynamics integer array values.\n\ndsrval\n\n return dynamics real values.\n\nfcdauxmind\n\n return the starting array indices and status of auxiliary signal model associated with FACTS device for the specified signal index.\n\nfcdauxmnam\n\n return the auxiliary signal model name associated with a FACTS device for the specified auxiliary signal index.\n\nfcddat\n\n\n\nfcddat_2\n\nThis API is the second release of the API that returns FACTS device real quantities.\n\nfcdint\n\n\n\nfcdint_2\n\nThis API is the second release of the API that returns FACTS device integer quantities.\n\nfcdmind\n\n return FACTS device model starting array indices and status.\n\nfcdmnam\n\n return FACTS device model name.\n\nfxsdt1\n\n return the magnitude of a specified fixed bus shunt.\n\nfxsdt2\n\n return complex fixed bus shunt.\n\nfxsint\n\n return integer quantities of the specified fixed bus shunt.\n\ngencnv\n\n return a flag indicating whether generators are converted.\n\ngendat\n\n return plant total power outp"
  },
  {
    "id": "chunk_59_part_1",
    "text": "ut.\n\ngendt1\n\nReturns total plant power output in MVA.\n\ngensectdat\n\nUse this API routine to return a bus section’s plant total power output.\n\ngensectdt1\n\nUse this API routine to return a bus section’s total plant power output in MVA.\n\nget_mstate\n\n return the MSTATE value.\n\ngethomepath\n\n retrieve a user’s HOMEPATH directory.\n\ngnechr\n\nUse this API routine to return character quantities of a specified GNE device.\n\ngnedat\n\nUse this API routine to return real quantities of a specified GNE device.\n\ngneint\n\nUse this API routine to return integer quantities of a specified GNE device.\n\ninddt1\n\nUse this API routine to return real induction machine quantities.\n\ninddt2\n\nUse this API routine to return complex induction machine quantities.\n\nindint\n\nUse this API routine to return integer induction machine quantities.\n\nini2dc\n\nInitializes the two-terminal dc line fetching routine ‘NXT2DC’ for retrieving two-terminal dc lines in dc line name alphabetical order.\n\ninibrn\n\nInitializes the branch fetching r"
  },
  {
    "id": "chunk_59_part_2",
    "text": "outine ‘NXTBRN’ or ‘NXTBRN3’ for returning branches connected to IBUS.\n\ninibrn_2\n\nInitializes the branch fetching routine ‘NXTBRN_2’ or ‘NXTBRN3_2’ for returning branches connected to bus sections described by IBUS and INODE.\n\ninibrx\n\nInitializes the branch fetching routine, ‘NXTBRN’ or ‘NXTBRN3’ for returning branches connected to IBUS.\n\ninibrx_2\n\nInitializes the branch fetching routine, ‘NXTBRN_2’ or ‘NXTBRN3_2’ for returning branches connected to IBUS.\n\ninibus\n\nInitializes the bus fetching routine ‘NXTBUS’ for retrieving buses in ascending numerical order.\n\ninibus_2\n\nInitializes the bus fetching routine ‘NXTBUS_2’ for retrieving buses in ascending numerical order.\n\ninibux\n\nInitializes the bus fetching routine ‘NXTBUS’ for retrieving buses in ascending numerical order.\n\ninifax\n\nInitializes the FACTS device fetching routine ‘NXTFAX’ for retrieving FACTS devices in FACTS device name alphabetical order.\n\ninifxs\n\nInitializes the fixed bus shunt fetching routine ‘NXTFXS’ for returning fix"
  },
  {
    "id": "chunk_60_part_0",
    "text": "ed shunts attached to bus IBUS.\n\niniind\n\nInitializes induction machine fetching routine ‘NXTIND’ for returning induction machines attached to IBUS.\n\ninilod\n\nInitializes load fetching routine ‘NXTLOD’ for returning loads attached to IBUS.\n\ninimac\n\nInitializes machine fetching routine ‘NXTMAC’ for returning machines attached to IBUS.\n\ninimdc\n\nInitializes the multi-terminal dc line fetching routine ‘NXTMDC’ for retrieving multi-terminal dc lines in dc line name alphabetical order.\n\ninimsl\n\nInitializes the multi-section line member fetching routine ‘NXTMSL’ for retrieving lines that are sections of the specified multi-section line from IBUS to JBUS.\n\nininam\n\nInitializes the bus fetching routine ‘NXTBUS’ for retrieving buses in ascending alphabetical order.\n\nininam_2\n\nInitializes the bus fetching routine ‘NXTBUS_2’ for retrieving buses in ascending alphabetical order.\n\nininax\n\nInitializes the bus fetching routine ‘NXTBUS’ for retrieving buses in ascending alphabetical order.\n\ninistabussect\n"
  },
  {
    "id": "chunk_60_part_1",
    "text": "\nUse this API routine to initialize the bus section fetching routine ‘NXTSTABUSSECT’ for retrieving the bus sections in a substation.\n\ninistanode\n\nUse this API routine to initialize the node fetching routine ‘NXTSTANODE’ for retrieving the nodes in a sub-station.\n\ninistaswdev\n\nUse this API routine to initialize the switching device fetching routine ‘NXTSTASWDEV’ for retrieving the switching devices in a substation.\n\ninisws\n\nInitializes the switched shunt fetching routine ‘NXTSWS’ for returning switched shunts attached to bus IBUS.\n\ninitie\n\nInitializes the tie branch fetching routine ‘NXTTIE’ or ‘NXTTIE3’ for returning tie branches from area IAR.\n\ninitix\n\nInitializes the tie branch fetching routine ‘NXTTIE’ or ‘NXTTIE3’ for returning tie branches from area IAR.\n\ninivsc\n\nInitializes the VSC dc line fetching routine ‘NXTVSC’ for retrieving VSC dc lines in dc line name alphabetical order.\n\nisland\n\nTrips in-service branches connected to Type 4 (or greater) buses, and disconnects islands not"
  },
  {
    "id": "chunk_60_part_2",
    "text": " containing a swing bus.\n\niterat\n\n return the number of iterations used in the last solution attempt.\n\nlmodind\n\nReturns load-related model starting array indices and status.\n\nlmodnam\n\nReturns load-related model name.\n\nlodcnv\n\nThis obsolete API always returns a 0.\n\nloddt1\n\nReturns load quantities in MVA.\n\nloddt2\n\n return complex load quantities.\n\nlodind\n\n return the load array index.\n\nlodint\n\n return integer load quantities.\n\nlodtype\n\n return the load type character string.\n\nmacchr\n\n return character machine quantities.\n\nmacdat\n\n return real machine quantities.\n\nmacdt2\n\n return complex machine quantities.\n\nmacind\n\n return the machine array index.\n\nmacint\n\n return integer machine quantities.\n\nmacstt\n\n return the machine status value.\n\nmaxmsm\n\n return the complex bus mismatch at the bus with the largest MVA mismatch.\n\nmdlind\n\n return plant-related model starting array indices and status.\n\nmdllibcnt\n\n return the number of libraries in the list to be searched for dynamics library models.\n\nm"
  },
  {
    "id": "chunk_61_part_0",
    "text": "dlnam\n\n return plant-related model name.\n\nmdlpgmcnt\n\n returns the number of model programs loaded from dynamics model libraries.\n\nnatono\n\n return the bus number for a specified 18-character extended bus name.\n\nnotona\n\n return the bus 18-character extended bus name for a specified bus number.\n\nnotonasect\n\n return the bus 18-character extended bus name for a specified bus section.\n\nnxt2dc\n\nReturns the next two-terminal dc line in dc line name alphabetical order.\n\nnxtbrn\n\nReturns the next branch connected to a bus, excluding three-winding transformers.\n\nnxtbrn3\n\nReturns the next branch connected to a bus, including three-winding transformers.\n\nnxtbrn3_2\n\nReturns the next branch connected to a bus section, including three-winding transformers.\n\nnxtbrn_2\n\nReturns the next branch connected to a bus, excluding three-winding transformers.\n\nnxtbus\n\nReturns the next bus in ordered sequence.\n\nnxtbus_2\n\nReturns the next bus in ordered sequence.\n\nnxtfax\n\nReturns the next FACTS device in FACTS devic"
  },
  {
    "id": "chunk_61_part_1",
    "text": "e name alphabetical order.\n\nnxtfxs\n\n return the identifier of the next fixed shunt connected to a bus.\n\nnxtind\n\nUse this API routine to return the identifier of the next induction machine connected to a bus.\n\nnxtlod\n\n return the identifier of the next load connected to a bus.\n\nnxtmac\n\n return the identifier of the next machine connected to a bus.\n\nnxtmdc\n\nReturns the next multi-terminal dc line in dc line name alphabetical order.\n\nnxtmsl\n\n return the next multi-section line member branch.\n\nnxtstabussect\n\nUse this API routine to retrieve the next bus section in the specified substation.\n\nnxtstanode\n\nUse this API routine to retrieve the next node in the specified substation.\n\nnxtstaswdev\n\nUse this API routine to retrieve the next switching device in the specified substation.\n\nnxtsws\n\n return the identifier of the next switched shunt connected to a bus.\n\nnxttie\n\n return the next tie branch from an area, excluding three-winding transformers.\n\nnxttie3\n\n return the next tie branch from an ar"
  },
  {
    "id": "chunk_61_part_2",
    "text": "ea, including three-winding transformers.\n\nnxtvsc\n\nReturns the next VSC dc line in dc line name alphabetical order.\n\nokstrt\n\nRoutine which may be called after activity STRT or MSTR to indicate the presence of INITIAL CONDITIONS SUSPECT errors (for activity STRT) or at least one MODEL NOT AVAILABLE IN MSTR/MRUN message (for MSTR).\n\nopenun\n\nConnects an IPLAN unit number to the Fortran unit used by activity OPEN and returns that IPLAN unit number.\n\nordbus\n\nThis API routine returns the bus number corresponding to the specified position in the ordered list (numeric or alphabetic) of non-hidden buses (i.e., star point buses and topological buses are excluded).\n\nordbussect\n\nThis API routine returns the bus number and section number corresponding to the specified position in the ordered list (numeric or alphabetic) of non-star point buses (i.e., star point buses are excluded).\n\nowndat\n\nReturns the data associated with an owner (‘LOAD’ gets loads at buses of owner ‘IAR’, ‘LOADLD’ gets loads ass"
  },
  {
    "id": "chunk_62_part_0",
    "text": "igned to owner ‘IAR’).\n\nownnam\n\nReturns the owner name for a specified owner number.\n\nownnum\n\nReturns the owner number for a specified owner name.\n\nownuse\n\n indicate whether an owner is in use.\n\nprmdat\n\nUse this API routine to return real-valued solution parameters.\n\nprmint\n\nUse this API routine to return integer-valued solution parameters.\n\nratchr\n\n get rating set parameters.\n\nrmodind\n\nReturns the branch relay model starting array indices and status.\n\nrmodnam\n\nReturns the branch relay model name.\n\nsbsgtbkv\n\n get previously defined bus subsystem voltage limits.\n\nsc3wnd\n\nReturns the three-winding transformer short circuit currents arriving at IBUS following activity SCMU.\n\nscbrn2\n\nReturns the branch short circuit currents arriving at IBUS following activity SCMU.\n\nscbus2\n\nReturns complex bus voltages and currents following activity SCMU.\n\nscdone\n\n restore the working case after ‘SCINIT’.\n\nscinit\n\n initialize the short-circuit data retrieval APIs.\n\nscmac2\n\n return the machine short circu"
  },
  {
    "id": "chunk_62_part_1",
    "text": "it currents following activity SCMU.\n\nselctr\n\n return the activity selector indicator.\n\nsethomepath\n\n set a user’s HOMEPATH directory.\n\nsfiles\n\n return the current Saved Case and Snapshot filenames.\n\nslmodind\n\n return the subsystem load-related model starting array indices and status.\n\nslmodnam\n\n return the subsystem load-related model name.\n\nsolstr\n\n return a string indicating the result of the last solution attempt.\n\nsolved\n\n check whether the last solution attempt reached tolerance.\n\nsolved_ca\n\n check whether the last corrective action solution attempt reached tolerance.\n\nstadat\n\nUse this API routine to return real substation values.\n\nstaint\n\nUse this API routine to return integer substation values.\n\nstaname\n\nUse this API routine to return a substation’s name.\n\nstanodeint\n\nUse this API routine to return integer substation values.\n\nstanodename\n\nUse this API routine to return the name of a substation node.\n\nstarea\n\n restrict ‘NXTBUS’ to a single area.\n\nstaswdevdat\n\nUse this API routin"
  },
  {
    "id": "chunk_62_part_2",
    "text": "e to return real substation switching device values.\n\nstaswdevint\n\nUse this API routine to return integer substation switching device values.\n\nstaswdevname\n\nUse this API routine to return the name of a substation switching device.\n\nstbskv\n\n restrict ‘NXTBUS’ to a single base voltage level.\n\nstzone\n\n restrict ‘NXTBUS’ to a single zone.\n\nswsblk\n\n\n\nswsblk_2\n\n return data for a specified block of a specified switched shunt.\n\nswsblz\n\n\n\nswsblz2\n\n\n\nswsdat\n\n\n\nswsdat_2\n\n return switched shunt real data.\n\nswsdt1\n\n\n\nswsint\n\n\n\nswsint_2\n\n return switched shunt integer parameters.\n\nswsmind\n\n\n\nswsmind_2\n\n return switched shunt model starting array indices and status.\n\nswsmnam\n\n\n\nswsmnam_2\n\n return switched shunt model name.\n\nsysmsm\n\n return the total system MVA mismatch.\n\nsysmva\n\n return the system base MVA.\n\nsystot\n\n return complex system-wide values.\n\ntitldt\n\n return the two line case title.\n\ntotbus\n\n return the total number of buses in the working case.\n\ntr3dat\n\n return three-winding transformer r"
  },
  {
    "id": "chunk_63_part_0",
    "text": "eal values.\n\ntr3dt2\n\n return three-winding transformer complex values.\n\ntr3int\n\n return three-winding transformer integer values.\n\ntr3nam\n\n return three-winding transformer name.\n\ntrndat\n\n\n\ntrxdat\n\n return the inter-area transfer MW.\n\ntspfprofilechr\n\n return string parameters of Time Series Power Flow profile.\n\ntspfprofilecurvechr\n\n return string parameters of Time Series Power Flow profile curve.\n\ntspfprofilecurveint\n\n return integer parameters of Time Series Power Flow profile curve.\n\ntspfprofilecurvereal\n\n return real parameters of Time Series Power Flow profile curve.\n\ntspfprofileint\n\n return integer parameters of Time Series Power Flow profile.\n\ntspfprofilereal\n\n return real parameters of Time Series Power Flow profile.\n\nvoltagedroopdata\n\n return voltage droop control real parameters.\n\nvoltagedroopint\n\n return voltage droop control integer parameters.\n\nvscauxmind\n\n return the starting array indices and status of auxiliary signal model associated with VSC dc line for the specified "
  },
  {
    "id": "chunk_63_part_1",
    "text": "signal index.\n\nvscauxmnam\n\n return the auxiliary signal model name associated with a VSC dc line for the specified auxiliary signal index.\n\nvsccdt\n\n return VSC dc line real parameters.\n\nvsccin\n\n return VSC dc line converter integer parameters.\n\nvscint\n\n return VSC dc line integer parameters.\n\nvscmind\n\n return VSC dc line model starting array indices and status.\n\nvscmnam\n\n return VSC dc line model name.\n\nwindmind\n\n return wind model starting array indices and status.\n\nwindmnam\n\n return wind model name.\n\nwnddat\n\n return three-winding transformer real values for winding connected to bus IBUS.\n\nwnddt2\n\n return three-winding transformer complex values for winding connected to bus IBUS.\n\nwndint\n\n return three-winding transformer integer values for winding connected to bus IBUS.\n\nxfrdat\n\n return two-winding transformer real parameters.\n\nxfrint\n\n return two-winding transformer integer parameters.\n\nxfrnam\n\n return two-winding transformer name.\n\nzndat\n\n return zone totals.\n\nznitoj\n\n return the i"
  },
  {
    "id": "chunk_63_part_2",
    "text": "nterchange between two zones.\n\nzonnam\n\n return the zone name.\n\nzonnum\n\n return the zone number.\n\nzonuse\n\n indicate whether a zone is in use.\n\n--- Substation Data — .txt ---\n\nSubstation Data — \n\nSubstation Data¶\n\n\n\n\n\nastationchar\n\n return an array of character values for subsystem substations.\n\nastationcount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the substation data family.\n\nastationint\n\n return an array of integer values for subsystem substations.\n\nastationreal\n\n return an array of real values for subsystem substations.\n\nastationtypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the substation data family (aStationInt, aStationReal and aStationChar).\n\n--- Substation Node Data — .txt ---\n\nSubstation Node Data — \n\nSubstation Node Data¶\n\n\n\n\n\nanodechar\n\n return an array of characte"
  },
  {
    "id": "chunk_64_part_0",
    "text": "r values for subsystem substation nodes.\n\nanodecount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the substation node data family.\n\nanodeint\n\n return an array of integer values for subsystem substation nodes.\n\nanodereal\n\n return an array of real values for subsystem substation nodes.\n\nanodetypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the substation node data family (aNodeInt and aNodeChar).\n\n--- Substation Switching Device Data — .txt ---\n\nSubstation Switching Device Data — \n\nSubstation Switching Device Data¶\n\n\n\n\n\nastaswdevchar\n\n return an array of character values for subsystem substation switching devices.\n\nastaswdevcount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the substation switching device data family"
  },
  {
    "id": "chunk_64_part_1",
    "text": ".\n\nastaswdevcplx\n\n return an array of complex values for subsystem substation switching devices.\n\nastaswdevint\n\n return an array of integer values for subsystem substation switching devices.\n\nastaswdevreal\n\n return an array of real values for subsystem substation switching devices.\n\nastaswdevtypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the substation switching device data family (aStaSwDevInt, aStaSwDevReal, aStaSwDevCplx and aStaSwDevChar).\n\n--- Substation Terminal Data — .txt ---\n\nSubstation Terminal Data — \n\nSubstation Terminal Data¶\n\n\n\n\n\naterminalchar\n\n return an array of integer values for subsystem substation terminals.\n\naterminalcount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the substation terminal data family.\n\naterminalint\n\n return an array of integer values for su"
  },
  {
    "id": "chunk_64_part_2",
    "text": "bsystem substation terminals.\n\naterminaltypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the substation terminal data family (aTerminalInt and aTerminalChar).\n\n--- Switched Shunt Bus Data — .txt ---\n\nSwitched Shunt Bus Data — \n\nSwitched Shunt Bus Data¶\n\n\n\n\n\naswshuntbuschar\n\n return an array of character values for subsystem buses.\n\naswshuntbuscount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the switched shunt bus data family.\n\naswshuntbuscplx\n\n return an array of complex values for subsystem buses.\n\naswshuntbusint\n\n return an array of integer values for subsystem buses.\n\naswshuntbusreal\n\n return an array of real values for subsystem buses.\n\naswshuntbustypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are v"
  },
  {
    "id": "chunk_65_part_0",
    "text": "alid input values to any of the data retrieval routines of the switched shunt bus data family (aSwShntBusInt, aSwShntBusReal, aSwShntBusCplx and aSwShntBusChar).\n\n--- Switched Shunt Data — .txt ---\n\nSwitched Shunt Data — \n\nSwitched Shunt Data¶\n\n\n\n\n\naswshchar\n\n return an array of character values for subsystem switched shunts.\n\naswshcount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the switched shunt data family.\n\naswshcplx\n\n return an array of complex values for subsystem switched shunts.\n\naswshint\n\n return an array of integer values for subsystem switched shunts.\n\naswshreal\n\n return an array of real values for subsystem switched shunts.\n\naswshtypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the switched shunt data family (aSwshInt, aSwshReal, aSwshCplx and aSwshChar).\n\n--- Switch"
  },
  {
    "id": "chunk_65_part_1",
    "text": "ed Shunt Models — .txt ---\n\nSwitched Shunt Models — \n\nSwitched Shunt Models¶\n\n\n\n\n\nadd_swshunt_model\n\n\n\nadd_swshunt_model_2\n\n add a switched shunt model to the specified switched shunt device.\n\nchange_swsmod_chricn\n\n\n\nchange_swsmod_chricn_2\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of the switched shunt model of a specified switched shunt device.\n\nchange_swsmod_con\n\n\n\nchange_swsmod_con_2\n\n change the value of a CON of the switched shunt model of a specified switched shunt device.\n\nchange_swsmod_icon\n\n\n\nchange_swsmod_icon_2\n\n change the value of an integer ICON (i.e., an element of the ICON array) of the switched shunt model of a specified switched shunt device.\n\nchange_swsmod_var\n\n\n\nchange_swsmod_var_2\n\n change the value of a VAR of the switched shunt model of a specified switched shunt device.\n\ngmb_add_swshunt_model\n\n\n\ngmb_add_swshunt_model_2\n\n add a GMB switched shunt model to the specified switched shunt device.\n\nswsmod_pack\n\n remove entries that a"
  },
  {
    "id": "chunk_65_part_2",
    "text": "re marked as unused from the switched shunt model connection tables and the switched shunt model array allocation tables.\n\nswsmod_remove\n\n\n\nswsmod_remove_2\n\n remove the switched shunt model from a specified switched shunt.\n\nswsmod_status\n\n\n\nswsmod_status_2\n\n change the status of the switched shunt model at a specified switched shunt device.\n\nswsmod_unconnected\n\n list or remove from dynamics working memory those switched shunt models that are assigned to switched shunt that are not present in the current power flow working case (unconnected).\n\nswsmod_user\n\n list user-written switched shunt model definitions or to remove user-written switched shunt model definitions that are not assigned to any switched shunt devices (unused) from the user model definition tables.\n\n--- Three-Winding Transformer Data — .txt ---\n\nThree-Winding Transformer Data — \n\nThree-Winding Transformer Data¶\n\n\n\n\n\natr3char\n\n return an array of character values for subsystem three-winding transformers.\n\natr3count\n\n retur"
  },
  {
    "id": "chunk_66_part_0",
    "text": "n the number of array entries required to accommodate the data to be returned by the remaining members of the three-winding transformer data family.\n\natr3cplx\n\n return an array of complex values for subsystem three-winding transformers.\n\natr3int\n\n return an array of integer values for subsystem three-winding transformers.\n\natr3real\n\n return an array of real values for subsystem three-winding transformers.\n\natr3types\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the three-winding transformer data family (aTr3Int, aTr3Real, aTr3Cplx and aTr3Char).\n\n--- Three-Winding Transformer Winding Data — .txt ---\n\nThree-Winding Transformer Winding Data — \n\nThree-Winding Transformer Winding Data¶\n\n\n\n\n\nawndchar\n\n return an array of character values for subsystem three-winding transformer windings.\n\nawndcount\n\n return the number of array entries required to accommodat"
  },
  {
    "id": "chunk_66_part_1",
    "text": "e the data to be returned by the remaining members of the three-winding transformer winding data family.\n\nawndcplx\n\n return an array of complex values for subsystem three-winding transformer windings.\n\nawndint\n\n return an array of integer values for subsystem three-winding transformer windings.\n\nawndreal\n\n return an array of real values for subsystem three-winding transformer windings.\n\nawndtypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the three-winding transformer winding data family (aWndInt, aWndReal, aWndCplx and aWndChar).\n\n--- Time Series Power Flow Data — .txt ---\n\nTime Series Power Flow Data — \n\nTime Series Power Flow Data¶\n\n\n\n\n\npurge_tspf_channel\n\n delete all Time Series Power Flow profiles for an element.\n\npurge_tspf_channel_all\n\n remover all time series power flow channels for a selected element.\n\npurge_tspf_profile\n\n delete Time Seri"
  },
  {
    "id": "chunk_66_part_2",
    "text": "es Power Flow profile by profile name.\n\npurge_tspf_profilecurve\n\n delete Time Series Power Flow profile curve by curvesetid and curvecol and index.\n\npurge_tspf_profilecurveset\n\n delete Time Series Power Flow profile curve set by profile curvesetid.\n\npurge_tspf_profiledata\n\n delete Time Series Power Flow profile data by curvesetid and curvecol and index.\n\ntspf_channel_chng\n\n select time series power flow Cchannels.\n\ntspf_channel_data\n\n select time series power flow Cchannels.\n\ntspf_profile_chng\n\nUse this API routine to modify the data of an existing Time Series Power Flow profile.\n\ntspf_profile_data\n\nUse this API routine to modify the data of an existing Time Series Power Flow profile, or to add a new Time Series Power Flow profile.\n\ntspf_profilecurveset_chng\n\nUse this API routine to modify the data of an existing Time Series Power Flow profile curve set.\n\ntspf_profilecurveset_data\n\nUse this API routine to modify the data of an existing Time Series Power Flow profile curve set, or to ad"
  },
  {
    "id": "chunk_67_part_0",
    "text": "d a new Time Series Power Flow profile curve set.\n\ntspf_profiledata_chng\n\nUse this API routine to modify the data of an existing Time Series Power Flow profile curve value.\n\ntspf_profiledata_data\n\nUse this API routine to modify the data of an existing Time Series Power Flow profile curve value, or to add a new Time Series Power Flow profile curve value.\n\n--- Time Series Power Flow Operation — .txt ---\n\nTime Series Power Flow Operation — \n\nTime Series Power Flow Operation¶\n\n\n\n\n\nimposeprofile\n\n impose generation/load at the given time point on profile curves.\n\ntspf\n\n run the time series power flow solution.\n\ntspf_output_pmatrix\n\n output the profile curves within one profile set in the matrix format.\n\ntspf_output_pmatrix_2\n\n output the profile curves within one profile set in the matrix format.\n\n--- Two-Terminal Dc Line Converter Data — .txt ---\n\nTwo-Terminal Dc Line Converter Data — \n\nTwo-Terminal Dc Line Converter Data¶\n\n\n\n\n\na2trmdcconvchar\n\n return an array of character values for subs"
  },
  {
    "id": "chunk_67_part_1",
    "text": "ystem two-terminal dc line converters.\n\na2trmdcconvcount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the two-terminal dc line converter data family.\n\na2trmdcconvcplx\n\n return an array of complex values for subsystem two-terminal dc line converters.\n\na2trmdcconvint\n\n return an array of integer values for subsystem two-terminal dc line converters.\n\na2trmdcconvreal\n\n return an array of real values for subsystem two-terminal dc line converters.\n\na2trmdcconvtypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the two-terminal dc line converter data family (a2TrmDcConvInt, a2TrmDcConvReal, a2TrmDcConvCplx and a2TrmDcConvChar).\n\n--- Two-Terminal Dc Line Data — .txt ---\n\nTwo-Terminal Dc Line Data — \n\nTwo-Terminal Dc Line Data¶\n\n\n\n\n\na2trmdcchar\n\n return an array of character values for subsyst"
  },
  {
    "id": "chunk_67_part_2",
    "text": "em two-terminal dc lines.\n\na2trmdccount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the two-terminal dc line data family.\n\na2trmdccplx\n\n return an array of complex values for subsystem two-terminal dc lines.\n\na2trmdcint\n\n return an array of integer values for subsystem two-terminal dc lines.\n\na2trmdcreal\n\n return an array of real values for subsystem two-terminal dc lines.\n\na2trmdctypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the two-terminal dc line data family (a2TrmDcInt, a2TrmDcReal, a2TrmDcCplx and a2TrmDcChar).\n\n--- Two-Winding Transformer Data — .txt ---\n\nTwo-Winding Transformer Data — \n\nTwo-Winding Transformer Data¶\n\n\n\n\n\natrnchar\n\n return an array of character values for subsystem two-winding transformers.\n\natrncount\n\n return the number of array entries required to acco"
  },
  {
    "id": "chunk_68_part_0",
    "text": "mmodate the data to be returned by the remaining members of the two-winding transformer data family.\n\natrncplx\n\n return an array of complex values for subsystem two-winding transformers.\n\natrnint\n\n return an array of integer values for subsystem two-winding transformers.\n\natrnreal\n\n return an array of real values for subsystem two-winding transformers.\n\natrntypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the two-winding transformer data family (aTrnInt, aTrnReal, aTrnCplx and aTrnChar).\n\n--- Using The Vendor Neutral Contingency And Ras Auxiliary File — .txt ---\n\nUsing The Vendor Neutral Contingency And Ras Auxiliary File — \n\nUsing The Vendor Neutral Contingency And Ras Auxiliary File¶\n\n\n\n\n\naccc_ras\n\n\n\naccc_ras_2\n\n run AC contingency calculation function with RAS model.\n\nadd2windingconditionelement\n\nAdd 2WindingConditionElement to RAS memory model\n"
  },
  {
    "id": "chunk_68_part_1",
    "text": "\nadd2windingcontingencyelement\n\nAdd 2WindingContingencyElement to RAS memory model\n\nadd2windingremedialactionelement\n\nAdd 2WindingRemedialActionElement to RAS memory model\n\nadd3windingconditionelement\n\nAdd 3WindingConditionElement to RAS memory model\n\nadd3windingcontingencyelement\n\nAdd 3WindingContingencyElement to RAS memory model\n\nadd3windingremedialactionelement\n\nAdd 3WindingRemedialActionElement to RAS memory model\n\naddaclineconditionelement\n\nAdd AclineConditionElement to RAS memory model\n\naddaclinecontingencyelement\n\nAdd AclineContingencyElement to RAS memory model\n\naddaclineremedialactionelement\n\nAdd AclineRemedialActionElement to RAS memory model\n\naddbusconditionelement\n\nAdd BusConditionElement to RAS memory model\n\naddbuscontingencyelement\n\nAdd BusContingencyElement to RAS memory model\n\naddbusremedialactionelement\n\nAdd BusRemedialActionElement to RAS memory model\n\naddcondition\n\nAdd Condition to RAS memory model\n\naddconditionelement\n\nAdd ConditionElement to RAS memory model\n\naddc"
  },
  {
    "id": "chunk_68_part_2",
    "text": "ontingency\n\nAdd Contingency to RAS memory model\n\naddcontingencyelement\n\nAdd ContingencyElement to RAS memory model\n\nadddcconvconditionelement\n\nAdd DcconvConditionElement to RAS memory model\n\nadddcconvcontingencyelement\n\nAdd DcconvContingencyElement to RAS memory model\n\nadddcconvremedialactionelement\n\nAdd DcconvRemedialActionElement to RAS memory model\n\nadddclineconditionelement\n\nAdd DclineConditionElement to RAS memory model\n\nadddclinecontingencyelement\n\nAdd DclineContingencyElement to RAS memory model\n\nadddclineremedialactionelement\n\nAdd DclineRemedialActionElement to RAS memory model\n\naddfixshuntconditionelement\n\nAdd FixshuntConditionElement to RAS memory model\n\naddfixshuntcontingencyelement\n\nAdd FixshuntContingencyElement to RAS memory model\n\naddfixshuntremedialactionelement\n\nAdd FixshuntRemedialActionElement to RAS memory model\n\naddgenconditionelement\n\nAdd GenConditionElement to RAS memory model\n\naddgencontingencyelement\n\nAdd GenContingencyElement to RAS memory model\n\naddgenremedia"
  },
  {
    "id": "chunk_69_part_0",
    "text": "lactionelement\n\nAdd GenRemedialActionElement to RAS memory model\n\naddloadconditionelement\n\nAdd LoadConditionElement to RAS memory model\n\naddloadcontingencyelement\n\nAdd LoadContingencyElement to RAS memory model\n\naddloadremedialactionelement\n\nAdd LoadRemedialActionElement to RAS memory model\n\naddnestedcondition\n\nAdd NestedCondition to RAS memory model\n\naddpythonconditionelement\n\nAdd PythonConditionElement to RAS memory model\n\naddpythoncontingencyelement\n\nAdd PythonContingencyElement to RAS memory model\n\naddpythonremedialactionelement\n\nAdd PythonRemedialActionElement to RAS memory model\n\naddremedialaction\n\nAdd RemedialAction to RAS memory model\n\naddremedialactionelement\n\nAdd RemedialActionElement to RAS memory model\n\naddsubconditionelement\n\nAdd SubConditionElement to RAS memory model\n\naddsubcontingencyelement\n\nAdd SubContingencyElement to RAS memory model\n\naddsubremedialactionelement\n\nAdd SubRemedialActionElement to RAS memory model\n\naddvscdcconditionelement\n\nAdd VscdcConditionElement to"
  },
  {
    "id": "chunk_69_part_1",
    "text": " RAS memory model\n\naddvscdccontingencyelement\n\nAdd VscdcContingencyElement to RAS memory model\n\naddvscdcremedialactionelement\n\nAdd VscdcRemedialActionElement to RAS memory model\n\nappend_ras\n\n read a Contingency Definition and Remedial Actions auxiliary file, adding to definitions in memory, if present.\n\nread_ras\n\n read a Contingency Definition and Remedial Actions auxiliary file into memory.\n\nvalidate_ras\n\n validate Contingency and Remedial Actions definitions in memory.\n\nwrite_ras\n\n write a Contingency Definition and Remedial Actions auxiliary file from memory.\n\n--- Vsc Dc Line Converter Data — .txt ---\n\nVsc Dc Line Converter Data — \n\nVsc Dc Line Converter Data¶\n\n\n\n\n\navscdcconvchar\n\n return an array of character values for subsystem VSC dc line converters.\n\navscdcconvcount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the VSC dc line converter data family.\n\navscdcconvcplx\n\n return an array of complex values for subsyst"
  },
  {
    "id": "chunk_69_part_2",
    "text": "em VSC dc line converters.\n\navscdcconvint\n\n return an array of integer values for subsystem VSC dc line converters.\n\navscdcconvreal\n\n return an array of real values for subsystem VSC dc line converters.\n\navscdcconvtypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the VSC dc line converter data family (aVscDcConvInt, aVscDcConvReal, aVscDcConvCplx and aVscDcConvChar).\n\n--- Vsc Dc Line Data — .txt ---\n\nVsc Dc Line Data — \n\nVsc Dc Line Data¶\n\n\n\n\n\navscdcchar\n\n return an array of character values for subsystem VSC dc lines.\n\navscdccount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the VSC dc line data family.\n\navscdccplx\n\n return an array of complex values for subsystem VSC dc lines.\n\navscdcint\n\n return an array of integer values for subsystem VSC dc lines.\n\navscdcreal\n\n return an array"
  },
  {
    "id": "chunk_70_part_0",
    "text": "of real values for subsystem VSC dc lines.\n\navscdctypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the VSC dc line data family (aVscDcInt, aVscDcReal, aVscDcCplx and aVscDcChar).\n\n--- Wind Related Models — .txt ---\n\nWind Related Models — \n\nWind Related Models¶\n\n\n\n\n\nadd_wind_model\n\n add a renewable related model of a designated type to a specified renewable machine.\n\nchange_wnmod_chricn\n\n change the value of a character ICON (i.e., an element of the CHRICN array) of a designated renewable related model at a specified renewable machine.\n\nchange_wnmod_con\n\n change the value of a CON of a designated renewable machine related model at a specified renewable machine.\n\nchange_wnmod_icon\n\n change the value of an integer ICON of a designated renewable machine related model at a specified renewable machine.\n\nchange_wnmod_var\n\n change the value of a VAR of a d"
  },
  {
    "id": "chunk_70_part_1",
    "text": "esignated renewable machine related model at a specified renewable machine.\n\nwnmod_consistency\n\n check consistency among the renewable machine related models referenced at each machine.\n\nwnmod_pack\n\n remove entries that are marked as unused from the wind model connection tables and the renewable machine model array allocation tables.\n\nwnmod_remove\n\n remove a renewable machine related model of a designated type from a specified renewable machine.\n\nwnmod_status\n\n change the status of a renewable machine related model of a designated type at a specified renewable machine.\n\nwnmod_unconnected\n\n list or remove from dynamics working memory those renewable machine related models that are assigned to renewable machines that are not present in the current power flow working case (unconnected).\n\nwnmod_user\n\n list user-written renewable machine model definitions or to remove user-written renewable machine model definitions that are not assigned to any renewable machines (unused) from the user mode"
  },
  {
    "id": "chunk_70_part_2",
    "text": "l definition tables.\n\n--- Zero Sequence Mutuals Data — .txt ---\n\nZero Sequence Mutuals Data — \n\nZero Sequence Mutuals Data¶\n\n\n\n\n\nazmutchar\n\n return an array of character values for subsystem zero sequence mutual branches.\n\nazmutcount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the branch zero sequence mutual data family.\n\nazmutcplx\n\n return an array of complex values for subsystem zero sequence mutual branches.\n\nazmutint\n\n return an array of integer values for subsystem zero sequence mutual branches.\n\nazmutreal\n\n return an array of real values for subsystem zero sequence mutual branches.\n\nazmuttypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the branch zero sequence mutual data family (aZmutInt, aZmutReal, aZmutCplx and aZmutChar).\n\n--- Zone Data — .txt ---\n\nZone Data — \n\nZone Dat"
  },
  {
    "id": "chunk_71",
    "text": "a¶\n\n\n\n\n\nazonechar\n\n return an array of character values for subsystem zones.\n\nazonecount\n\n return the number of array entries required to accommodate the data to be returned by the remaining members of the zone data family.\n\nazonecplx\n\n return an array of complex values for subsystem zones.\n\nazoneint\n\n return an array of integer values for subsystem zones.\n\nazonereal\n\n return an array of real values for subsystem zones.\n\nazonetypes\n\n return an array of character values indicating the data types corresponding to a set of specified STRING values that are valid input values to any of the data retrieval routines of the zone data family (aZoneInt, aZoneReal, aZoneCplx and aZoneChar).\n\n--- Zone Subsystems — .txt ---\n\nZone Subsystems — \n\nZone Subsystems¶\n\n\n\n\n\nzsys\n\n define a zone subsystem.\n\nzsysdef\n\n set the definition of an zone subsystem.\n\nzsysinit\n\n initialize or re-initialize a zone subsystem."
  }
]